[{"id":"9cd7258a-bd79-4c4a-a295-e29ef9df2687","type":"Full Time","url":"https://jobs.github.com/positions/9cd7258a-bd79-4c4a-a295-e29ef9df2687","created_at":"Tue Apr 13 07:50:33 UTC 2021","company":"InnoGames GmbH","company_url":"https://www.innogames.com","location":"Hamburg","title":"(Experienced) Haxe Developer – Video Game: Forge of Empires – InnoGames","description":"\u003cp\u003eOur \u003cstrong\u003eForge of Empires\u003c/strong\u003e team is open to hire an experienced \u003cstrong\u003eHaxe Developer\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eHaxe Developer\u003c/strong\u003e, you will join the \u003cstrong\u003eTech team\u003c/strong\u003e of the Forge of Empires project to improve our Development processes and the technical infrastructure. Make use of your professional expertise in Haxe Development, your interest in improving Game Development infrastructure, and your communicational skills to find solutions in a team of Developers to provide the best user experience for our players.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eWork in Game Development.\u003c/strong\u003e Contribute to the continuous development and improvement of one of our keystone games: Forge of Empires.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eShape our infrastructure.\u003c/strong\u003e Strengthen our technical infrastructure by improving our Development tools \u0026amp; workflows, focused on our browser frontend built with Haxe.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBuild team-internal bridges.\u003c/strong\u003e Share your Haxe / Frontend Game Development knowledge while collaborating closely with Mobile- \u0026amp; Backend Developers, Game Designers, and Artists.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBroaden your horizon.\u003c/strong\u003e Participate in the whole feature development lifecycle with a commitment to high-quality results and develop your individual career path within our team of dedicated professionals.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour skill set:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eProfessional Haxe experience.\u003c/strong\u003e You have worked on commercial Haxe projects.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSoftware craftsmanship.\u003c/strong\u003e You are experienced and well-versed in software architecture and using design patterns.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eQuality mindset.\u003c/strong\u003e You contribute by creating effective code, proven by browser automation tests.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCan-do attitude.\u003c/strong\u003e You are working solution-oriented and efficiently.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eOpen-minded team player.\u003c/strong\u003e You are eager to use your English skills every day \u0026amp; confident working in an international, multicultural environment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eFavorable\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eProfessional Game Developer.\u003c/strong\u003e You have been working as a Frontend / Software Developer in a Game Development team.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003e(F2P) Gamer by heart.\u003c/strong\u003e You are passionate about online games (strategy/F2P) and knowledgeable of relevant game mechanics.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eProfessionally qualified.\u003c/strong\u003e Your theoretical understanding of Software Development is ideally based on a University degree in Computer Sciences, Business Information Systems or similar studies.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAutomation interest.\u003c/strong\u003e You know your way around popular scripting languages (Python / Bash / Groovy).\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eDynamic mindset.\u003c/strong\u003e You are a proactive and motivated individual with a willingness to learn and improve.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour power-ups:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eHybrid working model.\u003c/strong\u003e Contribute from your home in any German city - our company adapted to a hybrid working model, offering remote work even after all the COVID limitations are gone.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eFlexible working hours.\u003c/strong\u003e We offer trust-based working hours as well as active breaks - play table tennis with your team, work out in our gym or go to our rooftop terrace to get some fresh air.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eEquipment delivery.\u003c/strong\u003e If you are interested in remote work, we will send all the needed equipment to your home office.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eRelocation assistance.\u003c/strong\u003e If you are interested in relocating to Hamburg/Germany, we will help you relocate to Hamburg/Germany regarding all the needed resources.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTeam of specialists.\u003c/strong\u003e Shape the success story of InnoGames with a great team of driven experts in an international culture.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eDynamic people.\u003c/strong\u003e Work as part of an agile multicultural team – enabling you and your team to form and actively optimize work processes.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCreative processes.\u003c/strong\u003e We are offering an atmosphere to empower creative thinking and strong results.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTeam events.\u003c/strong\u003e Participate in regular team events (e.g., curling, cooking, paintball), barbecue together on our rooftop terrace, and enjoy regular company-get-togethers.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eEnglish first.\u003c/strong\u003e Our company language is English, and we support all our employees and their partners with optional German lessons.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eOutstanding remuneration.\u003c/strong\u003e We are offering competitive compensation \u0026amp; exceptional benefits, ranging from a company gym to smartphone/tablet of your own choice for personal use.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCareer opportunities.\u003c/strong\u003e We actively support personal development, pay for any necessary textbooks as well as sending you to conferences.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTransportation support.\u003c/strong\u003e We contribute to your public transport ticket and subsidize contributions to the company pension plan.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eFood \u0026amp; drinks.\u003c/strong\u003e We offer free drinks and fresh fruit to contribute to your health and wellbeing; enjoy the meals delivered by our in-house canteen or cook on your own in one of our employee kitchens.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eComfy offices.\u003c/strong\u003e Learn more about our charms and benefits in our \u003ca href=\"https://www.youtube.com/watch?v=yZR6GlDxRag\"\u003evirtual office tour\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur story:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInnoGames is Germany's leading developer and publisher of mobile and online games. The company based in Hamburg is best known for Forge of Empires, Elvenar, and Tribal Wars. InnoGames' complete portfolio encompasses seven live games and several mobile titles in production.\u003c/p\u003e\n\u003cp\u003eBorn as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years.\nTo further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eApply and #stayhome:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eExcited to start your journey with InnoGames and join our dynamic team as a \u003cstrong\u003eHaxe Developer\u003c/strong\u003e?\nWe look forward to receiving your application through our \u003ca href=\"https://www.innogames.com/career/detail/job/-experienced-haxe-developer-video-game-forge-of-empires-innogames/?s=GitHub\"\u003eonline application form\u003c/a\u003e. \u003cstrong\u003eMaximilian Kaeding\u003c/strong\u003e would be happy to answer any questions you may have.\u003c/p\u003e\n\u003cp\u003eDue to the \u003cstrong\u003ecoronavirus\u003c/strong\u003e outbreak, we switched our operations company-wide to home office and turned our hiring process into a \u003cstrong\u003efully virtual one\u003c/strong\u003e. When hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly.\nStay home and safe!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.innogames.com/career/detail/job/-experienced-haxe-developer-video-game-forge-of-empires-innogames/?s=GitHub\"\u003ehttps://www.innogames.com/career/detail/job/-experienced-haxe-developer-video-game-forge-of-empires-innogames/?s=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWFnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--db7732f3f8182b1d41900a96a8b3a04a059010ac/logo_innogames_devlop.png"},{"id":"740b072e-86d5-435c-93b9-1ea3d116af69","type":"Full Time","url":"https://jobs.github.com/positions/740b072e-86d5-435c-93b9-1ea3d116af69","created_at":"Tue Apr 13 00:05:20 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote","title":"Senior Software Engineer- MacOS","description":"\u003cp\u003eABOUT THE ROLE\u003c/p\u003e\n\u003cp\u003eHELP US BUILD THE NEXT GENERATION OF IDENTITY AND ACCESS MANAGEMENT (IAM) SOLUTIONS\nMAKE A BIG IMPACT ON PRODUCT IN A FLEXIBLE WORK ENVIRONMENT WITH A STRONG FOCUS ON PROFESSIONAL DEVELOPMENT\u003c/p\u003e\n\u003cp\u003eOneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers. OneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers. As part of building out new cloud services, we’re looking for talented SOFTWARE ENGINEERS.\u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL BE DOING:\u003c/p\u003e\n\u003cp\u003eWork on technically challenging product that is solving real problems for our customers\nEnjoying a friendly working environment where you can grow (a lot!)\nCommunicating with other OneLogin engineers across the world\nBuilding and designing secure, useable, and reliable applications on MacOS\nThinking out-of-the-box to come up with a solution to problems that do not seem to have one\nContinuously trying new technologies and applying them if they make sense and solve customer problems\nSwift, Objective-C, Cocoa, Apple Security Framework\u003c/p\u003e\n\u003cp\u003eWHAT YOU CAN BRING TO THE TABLE:\u003c/p\u003e\n\u003cp\u003eSecurity-first mindset\u003c/p\u003e\n\u003cp\u003eGetting things done attitude with focus on quality\u003c/p\u003e\n\u003cp\u003eBringing different perspectives and opinions\u003c/p\u003e\n\u003cp\u003e5+ years of experience working MacOS and/or iOS\u003c/p\u003e\n\u003cp\u003eStrong engineering ability in multiple languages - Swift, Objective-C\u003c/p\u003e\n\u003cp\u003eStrong experience in Cocoa, Apple Frameworks, and RESTful web services\u003c/p\u003e\n\u003cp\u003eExperience with IAM or SSO systems, or Apple Security Frameworks would be a big bonus\u003c/p\u003e\n\u003cp\u003eComputer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States\u003c/p\u003e\n\u003cp\u003eWHY YOU SHOULD JOIN US:\u003c/p\u003e\n\u003cp\u003eGet in early on a small, close-knit team with ownership and impact on products trusted by millions\nAward-winning company culture, strong local leadership, and great career development opportunities\nCompetitive salary plus great perks including equity, full insurance (medical, dental, \u0026amp; vision), unlimited time off, and flexible WFH policies\u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN\u003c/p\u003e\n\u003cp\u003eOneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide. We are headquartered in San Francisco, California. For more information, visit \u003ca href=\"http://www.onelogin.com\"\u003ewww.onelogin.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOur core values\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/1fcba5581us\"\u003ehttps://grnh.se/1fcba5581us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcU9nIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bb06d1b936a3d5f9927aecbabf33566eb98cdafa/onelogin%20work%20mark.png"},{"id":"0e9fc2a4-dbe0-4930-845d-c8df56730837","type":"Full Time","url":"https://jobs.github.com/positions/0e9fc2a4-dbe0-4930-845d-c8df56730837","created_at":"Tue Apr 13 00:03:39 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote","title":"Engineering Lead, Test/Release Automation","description":"\u003cp\u003eABOUT THE ROLE:\u003c/p\u003e\n\u003cp\u003eOneLogin needs an experienced software engineer and technical team lead to assume ownership of all things Automation. Join our close knit Quality Engineering team that is responsible for the quality of our product offerings from the beginning of the SDLC all the way through the release to production.\u003c/p\u003e\n\u003cp\u003eProvide leadership for a team of automation engineers: providing solid feedback and advice to the team manager, managing team projects, and leading team meetings.\u003c/p\u003e\n\u003cp\u003eAssume principle ownership of our proprietary E2E test framework (Node.js, puppeteer, Ava):  enhance and maintain this framework, document its use, and provide training and tooling necessary to enable the feature teams to write their own effective and maintainable E2E tests.\u003c/p\u003e\n\u003cp\u003eConsult and collaborate with the Platform team to ensure that the CI/CD pipeline meets the needs of the company throughout the development, testing, and release cycles.\u003c/p\u003e\n\u003cp\u003eProject planning, implementation, and delegation to provide tooling to integrate the E2E tests into a continuous test pipeline.\u003c/p\u003e\n\u003cp\u003eBuild a system that provides telemetry, quality metrics, reports and alerting for automated tests.\u003c/p\u003e\n\u003cp\u003eParticipate in Release Management (with oversight) in the short term, until the current manual processes are effectively automated/streamlined.\u003c/p\u003e\n\u003cp\u003eDevelop, maintain, extend a software solution linking TestRail test plans with JIRA tickets and the E2E test framework for well directed automatic test run generation and reporting.\u003c/p\u003e\n\u003cp\u003eWhile this position is principally concerned with E2E tests, must be able to clearly communicate with and advise feature teams on effective unit and integration test coverage. \u003c/p\u003e\n\u003cp\u003eWill own measuring (not implementing) unit/integration test coverage, helping to ensure that we have comprehensive test coverage at the proper places in the test pyramid.\u003c/p\u003e\n\u003cp\u003eABOUT YOU:\u003c/p\u003e\n\u003cp\u003eThe right person for this position needs to be a strong contributor to the design and implementation of complex, multi-team software projects as well as providing leadership for the existing Automation engineers. Must be able and willing to participate in the manual deployment processes to understand and affect major releases and then implement  their replacement with automation.  Will participate in second tier on-call rotation for the systems the Automation team is responsible for.\u003c/p\u003e\n\u003cp\u003eIn order to truly be effective in OneLogin culture, the right candidate will need to cooperate with other teams to get the right things done, providing advice and guidance.  The successful candidate must stand on their principles but be flexible in approach, comfortable with finding best-fit solutions, tracking the technical debt any compromises introduce, and be vigilant in following up over time to eliminate that debt.\u003c/p\u003e\n\u003cp\u003e3+ years of Quality Engineering experience preferably in an enterprise SaaS company\u003c/p\u003e\n\u003cp\u003e3+ years NodeJS experience.  Familiarity with promises and functional programming will be a plus.  Experience with other programming languages, particularly Ruby a definite advantage.\u003c/p\u003e\n\u003cp\u003e3+ years of UI and API test automation, using Selenium, Puppeteer or similar.\u003c/p\u003e\n\u003cp\u003e3+ years experience building, using, maintaining CI/CD pipelines, gitHub Actions or similar a plus.\u003c/p\u003e\n\u003cp\u003e3+ years of small team tech lead experience.\u003c/p\u003e\n\u003cp\u003e2+ years Experience testing microservices, being mindful of dependencies between services and monolithic components.\u003c/p\u003e\n\u003cp\u003e1+ years of experience providing automatic quality metrics, using observability and monitoring tools (our stack includes Sumo, DataDog, NewRelic and Elasticsearch)\u003c/p\u003e\n\u003cp\u003eProfessional experience with Kubernetes, EKS, GKE, AKS, etc a plus.\u003c/p\u003e\n\u003cp\u003eDemonstrated ability to effectively partner with development teams on quality initiatives.\u003c/p\u003e\n\u003cp\u003eStrong communication and decision making skills with the ability to balance conflicting interests\u003c/p\u003e\n\u003cp\u003eBachelor’s degree in Computer Science, Engineering or related field\u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN:\u003c/p\u003e\n\u003cp\u003eOneLogin is the leader in Unified Access Management, Enabling Organizations to Access the World™. Businesses of all sizes use OneLogin to secure company data, while increasing IT administrator and end users efficiencies. Implementation of our identity management solutions can be achieved in hours not days, delivering a fully featured administrative and self-service portal. Our ability to handle on-premises and cloud/SaaS applications makes us the identity as a service vendor of choice for the hybrid enterprise. Two-factor authentication, mobile identity management for one-click access on smartphones and tablets, and real-time directory synchronization add an extra layer of protection.\u003c/p\u003e\n\u003cp\u003eOur core values:\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/97d274da1us\"\u003ehttps://grnh.se/97d274da1us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcCtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ebd5ab8ae0cb54316363e2b26023287289036078/onelogin%20work%20mark.png"},{"id":"5633f376-475f-4016-ab7c-51bd1d327f88","type":"Full Time","url":"https://jobs.github.com/positions/5633f376-475f-4016-ab7c-51bd1d327f88","created_at":"Mon Apr 12 23:22:39 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote","title":"Senior BackEnd Software Engineer","description":"\u003cp\u003eABOUT THE ROLE\u003c/p\u003e\n\u003cp\u003eHELP US BUILD THE NEXT GENERATION OF CLOUD-BASED IDENTITY AND ACCESS MANAGEMENT (IAM) SOLUTIONS\nMAKE A BIG IMPACT ON PRODUCT IN A FLEXIBLE WORK ENVIRONMENT WITH A STRONG FOCUS ON PROFESSIONAL DEVELOPMENT\u003c/p\u003e\n\u003cp\u003eOneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers.  We just closed a $100M series-D, and we are growing. OneLogin provides industry-leading, enterprise IAM solutions for every user, device, and application. We manage and secure millions of identities for thousands of enterprise customers. As part of building out new cloud services, we’re looking for talented SOFTWARE ENGINEERS. \u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL BE DOING:\u003c/p\u003e\n\u003cp\u003eWork on technically challenging product that is solving real problems for our customers\u003c/p\u003e\n\u003cp\u003eEnjoying friendly working environment where you can grow (a lot!)\u003c/p\u003e\n\u003cp\u003eCommunicating with other OneLogin engineers across the world\u003c/p\u003e\n\u003cp\u003eBuilding and designing secure, scalable, and reliable micro-services in cloud SaaS environment\u003c/p\u003e\n\u003cp\u003eRedesigning or splitting the legacy monolith in something much nicer\u003c/p\u003e\n\u003cp\u003eThinking out-of-the-box to come up with a solution to problems that do not seem to have one\u003c/p\u003e\n\u003cp\u003eContinuously trying new technologies and applying them if they make sense and solve customer problems\u003c/p\u003e\n\u003cp\u003eRuby, Rails, NodeJS, Javascript, React, Redis, Postgres, HAProxy, Networking, API’s, Authentication, MFA, RabbitMQ, Docker, Swarm, Consul, CI/CD … and a lot more and always changing\u003c/p\u003e\n\u003cp\u003eWHAT YOU BRING TO THE TABLE:\u003c/p\u003e\n\u003cp\u003eSecurity-first mindset\u003c/p\u003e\n\u003cp\u003eGetting things done attitude with focus on quality\u003c/p\u003e\n\u003cp\u003eBringing different perspectives and opinions\u003c/p\u003e\n\u003cp\u003e4+ years of experience working in SaaS or Cloud environment \u003c/p\u003e\n\u003cp\u003eStrong engineering ability in multiple languages - Ruby/Rails, Javascript/NodeJS are plus\u003c/p\u003e\n\u003cp\u003eKnowledge and interest in IAM/authentication is great\u003c/p\u003e\n\u003cp\u003eExperience working on the backend, with a background in building and deploying scalable micro-services\u003c/p\u003e\n\u003cp\u003eUnderstanding of best practices in the design of RESTful APIs\u003c/p\u003e\n\u003cp\u003eSQL and general database knowledge\u003c/p\u003e\n\u003cp\u003eComputer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States\u003c/p\u003e\n\u003cp\u003eWHY YOU SHOULD JOIN US:\u003c/p\u003e\n\u003cp\u003eJoin a small, close-knit team with the ability to impact highly visible product already trusted by millions\nGet in early on a small, close-knit team with ownership and impact on products trusted by millions\nAward-winning company culture, strong local leadership, and great career development opportunities\nCompetitive salary plus great perks including equity, full insurance (medical, dental, \u0026amp; vision), unlimited time off, and flexible WFH policies \u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN\u003c/p\u003e\n\u003cp\u003eOneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide. We are headquartered in San Francisco, California. For more information, visit www.onelogin.com.\u003c/p\u003e\n\u003cp\u003eOur core values\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/a143f6531us\"\u003ehttps://grnh.se/a143f6531us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a79482b48ee40fe1a3a126c2b7544281d0a46ff0/onelogin%20work%20mark.png"},{"id":"64328a9b-5db9-4d2b-b6b9-f4c7ab42ced0","type":"Full Time","url":"https://jobs.github.com/positions/64328a9b-5db9-4d2b-b6b9-f4c7ab42ced0","created_at":"Mon Apr 12 23:56:25 UTC 2021","company":"OneLogin","company_url":"http://www.onelogin.com","location":"Remote","title":"Lead/Staff Software Engineer, Directories","description":"\u003cp\u003eABOUT THE ROLE\u003c/p\u003e\n\u003cp\u003eHELP US BUILD THE NEXT GENERATION OF CLOUD-BASED IDENTITY AND ACCESS MANAGEMENT (IAM) SOLUTIONS\nMAKE A BIG IMPACT IN A FLEXIBLE WORK ENVIRONMENT WITH A STRONG FOCUS ON PROFESSIONAL DEVELOPMENT\u003c/p\u003e\n\u003cp\u003eOneLogin provides industry-leading enterprise IAM solutions for every user, device and application. We manage and secure millions of identities for thousands of enterprise customers and fortune 500 customers as well.\u003c/p\u003e\n\u003cp\u003eAs part of extending our team, we’re looking for a talented LEAD SOFTWARE ENGINEER with experience in the architecture and development of modern cloud services and on-prem products. In this role, you will be in charge of two main connectors which are responsible for syncing users either from Active Directory or LDAP to OneLogin. You will need to work closely with our support team to provide technical support and answer their questions that they receive everyday from our customers.\u003c/p\u003e\n\u003cp\u003eYou’ll join the team that owns a variety of different functionalities around cloud directories and organizational data.  We have existing systems as well as opportunities to design and implement solutions that provide functionality and scalability beyond any competitors.\u003c/p\u003e\n\u003cp\u003eWHAT YOU’LL BE DOING:\u003c/p\u003e\n\u003cp\u003eRamp and take ownership of existing services in the Active Directory and LDAP area\u003c/p\u003e\n\u003cp\u003eDrive the design and implementation of critical features and improvements\u003c/p\u003e\n\u003cp\u003eFocus on the quality, performance, and security of our existing as well as new platform\u003c/p\u003e\n\u003cp\u003eCollaborate with other engineers and leaders to define the next generation functionality and scalability solutions for cloud directories\u003c/p\u003e\n\u003cp\u003eWork in cross-functional teams to help define and build scenarios across feature areas\u003c/p\u003e\n\u003cp\u003eABOUT YOU:\u003c/p\u003e\n\u003cp\u003eYou value open collaboration, have a strong desire to learn, and are excited to pick up new skills and technologies. You enjoy solving difficult problems, and find creative solutions and understand current patterns and architecture. You’re excited to work closely with people throughout the organization, from close teammates to members of cooperating departments.\u003c/p\u003e\n\u003cp\u003eWHAT YOU BRING TO THE TABLE:\u003c/p\u003e\n\u003cp\u003e5+ years of experience working on backend services, with a background in building and deploying scalable microservices platforms\u003c/p\u003e\n\u003cp\u003e2+ years of customer support experience\u003c/p\u003e\n\u003cp\u003eReviewing code of other senior developers\u003c/p\u003e\n\u003cp\u003eStrong Java, C# (preferred),  NodeJs and/or Ruby experience\u003c/p\u003e\n\u003cp\u003eVery good experience with multi-threading in C# and Java\u003c/p\u003e\n\u003cp\u003eVery good experience with low level http and web-socket programming\u003c/p\u003e\n\u003cp\u003eVery solid experience with any TDD and BDD frameworks, such as NUnit or Puppeteer\u003c/p\u003e\n\u003cp\u003eEnterprise directory experience with Active Directory or LDAP\u003c/p\u003e\n\u003cp\u003eAn understanding of best practices in the design of server-based application with multi-threading mechanisms\u003c/p\u003e\n\u003cp\u003eAbility to provide accurate engineering effort estimates in a dynamic environment\u003c/p\u003e\n\u003cp\u003eExperience troubleshooting in production environments\u003c/p\u003e\n\u003cp\u003eSupport and mentor teammates, encouraging the highest levels of craftsmanship and contribution to engineering and business goals\u003c/p\u003e\n\u003cp\u003eComputer Science degree (or relevant industry experience with demonstrable CS fundamentals) and eligibility to work in the United States or Mexico\u003c/p\u003e\n\u003cp\u003eBonus points for experience with: IAM technologies\u003c/p\u003e\n\u003cp\u003eWHAT’S IN IT FOR YOU:\u003c/p\u003e\n\u003cp\u003eJoin a small, close-knit team with the ability to impact highly visible products already trusted by millions\nAward-winning company culture, strong local leadership, and great career development opportunities\nCompetitive salary plus great perks including equity, full insurance (medical, dental, \u0026amp; vision), unlimited time off, and flexible WFH policies\u003c/p\u003e\n\u003cp\u003eABOUT ONELOGIN\u003c/p\u003e\n\u003cp\u003eOneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide.\u003c/p\u003e\n\u003cp\u003eOur core values\u003c/p\u003e\n\u003cp\u003eSecurity first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind\nCustomer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value\nCollaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team\nAccountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels\nCreative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/6af897351us\"\u003ehttps://grnh.se/6af897351us\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"224f07bf-655d-4359-ac7f-5eb2a96aa661","type":"Full Time","url":"https://jobs.github.com/positions/224f07bf-655d-4359-ac7f-5eb2a96aa661","created_at":"Mon Apr 12 18:45:20 UTC 2021","company":"Toptal","company_url":"https://www.toptal.com/","location":"Remote","title":"React Developer – Full-Time, Remote","description":"\u003cp\u003eDesign your full-time freelance career as a top freelance developer with Toptal.\u003c/p\u003e\n\u003cp\u003eFreelance work is defining developer careers in exciting new ways. If you’re passionate about finding rapid career growth potential working with leading Fortune 500 brands and innovative Silicon Valley startups, Toptal could be a great fit for your next career shift.\u003c/p\u003e\n\u003cp\u003eToptal is an elite talent network made up of the world’s top 3% of developers, connecting the best and brightest freelancers with top organizations. Unlike a 9-to-5 job, you’ll choose your own schedule and work from anywhere. Jobs come to you, so you won’t bid for projects against other developers in a race to the bottom. Plus, Toptal takes care of all the overhead, empowering you to focus on successful engagements while getting paid on time, at the rate you decide, every time. Our sophisticated screening process makes sure you are provided with top clients without additional overhead, as well as assistance in maximizing the potential of your full-time freelance career. Joining the Toptal network also gives you access to technical training programs, mentors, and coaching programs, so you can connect with a global community of experts like you to share peer-to-peer knowledge and expand your network globally.\u003c/p\u003e\n\u003cp\u003eAs a freelance developer, you can become a part of an ever-expanding community of experts in over 120 countries, working remotely on projects that meet your career ambitions.\u003c/p\u003e\n\u003cp\u003eThat’s why the world’s top 3% of developers choose Toptal. Developers in our elite network share:\u003c/p\u003e\n\u003cp\u003eEnglish language proficiency\u003c/p\u003e\n\u003cp\u003e3+ years of professional experience\u003c/p\u003e\n\u003cp\u003eProject management skills\u003c/p\u003e\n\u003cp\u003eA keen attention to detail\u003c/p\u003e\n\u003cp\u003eExperience with system architecture or leading a software team is a strong advantage\u003c/p\u003e\n\u003cp\u003eFull-time availability is a strong advantage\u003c/p\u003e\n\u003cp\u003eIf you’re interested in pursuing an engaging career working on full-time freelance jobs for exclusive clients, take the next step by clicking apply and filling out the short form: \u003ca href=\"https://topt.al/v7cnRN\"\u003ehttps://topt.al/v7cnRN\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTake the next step by clicking apply and filling out the short form: \u003ca href=\"https://topt.al/v7cnRN\"\u003ehttps://topt.al/v7cnRN\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzZnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ef8cac0eccaead1d9ed898249fd179347c15e6a8/toptal_logo.png"},{"id":"2fdcf257-3257-450e-ba3d-adc03a6f41aa","type":"Full Time","url":"https://jobs.github.com/positions/2fdcf257-3257-450e-ba3d-adc03a6f41aa","created_at":"Mon Apr 12 17:28:09 UTC 2021","company":"Cased","company_url":"https://cased.com","location":"Remote, US","title":"Backend Engineer","description":"\u003cp\u003eAt Cased, we create innovative solutions and workflows for the growing number of security, compliance, and productivity challenges that face software companies.\u003c/p\u003e\n\u003cp\u003eCased was founded in early 2020 by four former GitHub employees, with investment from Founders Fund and some of the most experienced angel investors in technology. Our product enables growing tech companies to ship fast, while staying secure as they grow. Our product includes features like approval workflows for important operations, automatic logging and recording of DevOps tooling, and integrations that link identity providers to command line tools. And we're just getting started.\u003c/p\u003e\n\u003cp\u003eYou'll help to shape both the future of our product and the company we become. You'll ship world-class software and work alongside engineering, design, and product leaders who helped build GitHub, Facebook, Zillow, Yelp, and Simple.\u003c/p\u003e\n\u003cp\u003eCased embraces diversity, equity and inclusion, and invites applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we're looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years experience writing Ruby on Rails code (or significant experience with a similar framework) and have previously collaborated with others in large codebases.\u003c/li\u003e\n\u003cli\u003eYou're excited about working on a fast-growing product, and can adapt to changing product and customer needs.\u003c/li\u003e\n\u003cli\u003eYou are familiar with good REST API design and best practices including authentication, rate limiting, content encoding, schemas, and errors.\u003c/li\u003e\n\u003cli\u003eSolid database design skills, and some familiarity with search technology is helpful.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you'll do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork alongside Cased founders and engineers to assist in the design, scalability, and implementation of customer-centric features.\u003c/li\u003e\n\u003cli\u003eLearn from customer feedback and weigh in on product decisions.\u003c/li\u003e\n\u003cli\u003eHelp to build a diverse and inclusive company culture. As an early employee you'll have a significant impact on the type of company Cased becomes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork remotely from anywhere in the United States\u003c/li\u003e\n\u003cli\u003eCompetitive equity and salary\u003c/li\u003e\n\u003cli\u003eMedical, dental, and vision health care coverage\u003c/li\u003e\n\u003cli\u003eA maxed-out MacBook Pro (or equivalent depending on your preference)\u003c/li\u003e\n\u003cli\u003e$1,500 stipend to setup your home office as you see fit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur tech stack right now includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby on Rails\u003c/li\u003e\n\u003cli\u003eGo\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eKafka\u003c/li\u003e\n\u003cli\u003eElasticsearch\u003c/li\u003e\n\u003cli\u003eTerraform\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eTo apply, send your resume, GitHub, or LinkedIn profile to \u003ca href=\"mailto:team@cased.com\"\u003eteam@cased.com\u003c/a\u003e, along with a brief note on why you'd like to work at Cased.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2lnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2217bef5c097da7b45e3d2f92692e87cfa4294ce/Frame%2015.png"},{"id":"3cc340d4-6662-4a10-8a53-f7cb571427b3","type":"Full Time","url":"https://jobs.github.com/positions/3cc340d4-6662-4a10-8a53-f7cb571427b3","created_at":"Wed Jan 13 11:00:56 UTC 2021","company":"Remote","company_url":"http://www.remote.com","location":"Anywhere","title":"Senior Frontend Engineer","description":"\u003cp\u003eRemote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. Read more about \u003ca href=\"https://remote.com/how-it-works\"\u003ehow it works\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe encourage folks from all ethnic groups, genders, sexuality, age and abilities to apply. We value kindness, ownership and team collaboration. You can check out  \u003ca href=\"https://remote.com/handbook\"\u003epublic handbook\u003c/a\u003e to learn more about our culture. If this job description resonates with you, we want to hear from you!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow we work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRemote is fully remote (ah!) and we love \u003ca href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\"\u003eWorking Async\u003c/a\u003e. This means you get to do your own schedule no matter the timezone. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in \u003ca href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\"\u003eThe Remote Flow\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe team you'll be joining: 30 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrevious experience working as Frontend Engineer/Developer for at least 4 years\u003c/li\u003e\n\u003cli\u003eSolid understanding of \u003cstrong\u003eJavascript ES6\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eProficient with \u003cstrong\u003eReact\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eExperience with \u003cstrong\u003eJest\u003c/strong\u003e and \u003cstrong\u003eReact Testing Library\u003c/strong\u003e or \u003cstrong\u003eEnzyme\u003c/strong\u003e in writing meaningful tests.\u003c/li\u003e\n\u003cli\u003eInterest in build pages with performance, accessibility and API design in mind\u003c/li\u003e\n\u003cli\u003eAttention to the details when implementing UI mockups made by our amazing design team.\u003c/li\u003e\n\u003cli\u003eIt's not required to have experience working remotely, but considered a plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eExperience Bonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNext.js\u003c/li\u003e\n\u003cli\u003eElixir/Phoenix\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGitLab CI\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRemote work culture\u003c/li\u003e\n\u003cli\u003eYour family comes first! Unlimited paid \u003ca href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\"\u003etime off\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003eThe equipment/tools you need to do your job well and comfortable* Good salary and company options\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eHome office setup\u003c/li\u003e\n\u003cli\u003eHealth insurance\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(async) Application is reviewed by your future manager (CTO)\u003c/li\u003e\n\u003cli\u003eInterview with the recruiter\u003c/li\u003e\n\u003cli\u003eInterview with the CTO\u003c/li\u003e\n\u003cli\u003e(async) Code exercise (async, no deadline, a very simple exercise)\nInterview with the team (no managers on the call, just for you to get a sense of who you'd be working with)\u003c/li\u003e\n\u003cli\u003e(async) Offer\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply at \u003ca href=\"https://grnh.se/f7ebb2123us\"\u003ehttps://grnh.se/f7ebb2123us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FWIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cbe5144ce9fdf21e6b57c9b1845fb2a64276fd1/pJ-7_0_R_400x400.png"},{"id":"9c5ae713-5177-4b13-a915-2112b8ee7231","type":"Full Time","url":"https://jobs.github.com/positions/9c5ae713-5177-4b13-a915-2112b8ee7231","created_at":"Thu Jan 21 16:19:48 UTC 2021","company":"Remote","company_url":"http://www.remote.com","location":"Anywhere","title":"Senior Backend Engineer - Elixir","description":"\u003cp\u003eRemote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. Read more about \u003ca href=\"https://remote.com/how-it-works\"\u003ehow it works\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eRemote is fully remote (ah!) and you can read more about us in our \u003ca href=\"https://remote.com/handbook\"\u003epublic handbook\u003c/a\u003e. More specifically, the team you'll be joining: 25 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow we work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe love \u003ca href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\"\u003eWorking Async\u003c/a\u003e and this means you get to do your own schedule. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in \u003ca href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\"\u003eThe Remote Flow\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe empower ownership and proactivity and when in doubt default to action instead of waiting.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMust have (professional experience):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2 years (minimum) working with Elixir and Phoenix\u003c/li\u003e\n\u003cli\u003ePostgres (or similar)\u003c/li\u003e\n\u003cli\u003eRedis (Similar)\u003c/li\u003e\n\u003cli\u003eCI/CD (GitLab, Github, Jenkins or similar)\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNice to have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eElasticsearch\u003c/li\u003e\n\u003cli\u003eAWS\u003c/li\u003e\n\u003cli\u003eNextjs\u003c/li\u003e\n\u003cli\u003eReact/Vue/Angular\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited personal time off - Read our \u003ca href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\"\u003etime off\u003c/a\u003e policy\u003c/li\u003e\n\u003cli\u003eThe equipment/tools you need to do your job well and comfortable\u003c/li\u003e\n\u003cli\u003eTraining budget\u003c/li\u003e\n\u003cli\u003eGood salary and company options\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(async) Application is reviewed\u003c/li\u003e\n\u003cli\u003eInterview with our recruiter\u003c/li\u003e\n\u003cli\u003eInterview with your future manager (CTO)\u003c/li\u003e\n\u003cli\u003e(async) code exercise (you're not expected to waste more than 2 - 4 hours)\u003c/li\u003e\n\u003cli\u003eInterview with the team (without any manager in the call so you can really get to know the people and ask all you want to ask)\u003c/li\u003e\n\u003cli\u003e(async) Reference calls\u003c/li\u003e\n\u003cli\u003e(async) Offer\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/b5c3a0243us\"\u003ehttps://grnh.se/b5c3a0243us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a57a82f1721b0118c31f828755e628381a93b019/pJ-7_0_R_400x400.png"},{"id":"6ce8038c-9b2b-4842-9522-2ff2802879d0","type":"Full Time","url":"https://jobs.github.com/positions/6ce8038c-9b2b-4842-9522-2ff2802879d0","created_at":"Mon Apr 12 16:38:06 UTC 2021","company":"Bright Cellars","company_url":"https://jobs.lever.co/brightcellars","location":"Remote","title":"Full Stack Engineer","description":"\u003cp\u003eWe're looking for a Full Stack Engineer to join our growing Data Platform team.\u003c/p\u003e\n\u003cp\u003eWhat You’ll be Working On:\nImplement new features on core data products\nDesign API while keeping speed and cost in mind\nCollaborate with the team to gather requirements\nCommunicate with design team to implement based on product roadmap\u003c/p\u003e\n\u003cp\u003eKey Technical Skills You’ll Bring:\nPython, Flask, unittest, flask_testing, MySQL, PostgreSQL\nAWS ECS, RDS, Redshift\nGit, Github, CircleCI, Jest\u003c/p\u003e\n\u003cp\u003eAdditional Skills:\nData ETL experience, Apache airflow\nExperience with advanced data visualization tool  (e.g. D3.js, observable, and vega)\nExperience with designing and implementing REST APIs\u003c/p\u003e\n\u003cp\u003eExperience You’ll Bring:\nBachelor's degree in Computer Science (or a related field) and 3+ years of relevant experience\n3+ years working in Python, and MySQL\nProficient with HTML, CSS, React (or a similar frontend framework)\nExperience with AWS and CI / CD processes\nKnowledge of other programming languages a plus\u003c/p\u003e\n\u003cp\u003eWho You Are:\nYou’re an Innovator - You enjoy working with new technologies ranging from the frontend to backend, and are particularly passionate and an expert in multiple stacks\nYou’re A Problem Solver - You have strong experience with various technologies, and know how to pick the right tool for any job.\nYou’re a Team Player - You love to collaborate closely with the team to brainstorm ideas, gather requirements, and review and improve code\nYou’re Driven - You have the ability to take initiative and work with minimal supervision\nYou’re Curious - You are naturally curious and have an interest in learning new things.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to \u003ca href=\"mailto:caila.cullen@brightcellars.com\"\u003ecaila.cullen@brightcellars.com\u003c/a\u003e OR, apply directly on our careers page.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--82afcc935314e4e0cf3655aa54c348504a20c889/Square_socialLogoBC%20(3).png"},{"id":"0da0542a-a23c-46ee-9284-c16f0af97763","type":"Full Time","url":"https://jobs.github.com/positions/0da0542a-a23c-46ee-9284-c16f0af97763","created_at":"Mon Apr 12 16:22:46 UTC 2021","company":"ProvatoHR, Inc. ","company_url":"http://www.provatohr.com","location":"Remote","title":"Full Stack Developer","description":"\u003cp\u003eWe are looking for a Full Stack Developer to join our client's talented team.\u003c/p\u003e\n\u003cp\u003eThe selected candidate will support Agile Application Development technologies and capabilities in the areas of software development, systems engineering, integration, and test of software applications and infrastructure. This effort will support the U.S. Citizenship and Immigration Services (USCIS) an agency of the United States Department of Homeland Security (DHS).\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cp\u003eWill work within a fast-paced Agile DevOps team contributing and collaborating within your scrum team on a daily basis.\nAnalyze software requirements and provide solutions. Perform analysis, design, coding, testing, implementation, and maintenance of software solutions.\nProvide consultation and support services for the full life cycle of software product development. These activities will include communication with the user community during requirements analysis, prototyping, system analysis, development, fielding, and maintenance of systems.\nEvaluate new software products and technologies and provide recommendations to enhance existing systems or build new ones.\nProvide software development support for the prototyping of analytical tools, data management and user interfaces to databases, and computational utilities.\nSupport the Scrum team in reviewing Pull Requests and help junior and mid level developers with technical tasks as well as promoting features through the CI pipeline.\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eMust be able to pass a DHS Suitability clearance\u003c/p\u003e\n\u003cp\u003eMinimum 4+ years software development experience\nProficient in Java Spring Boot and JPA\nFull Stack Development capabilities supporting Database, server side development, front end development and CI/CD integration\nTypescript experience to include angular.js, react.js or vue.js\nExperience working within a Continuous Integration environment using Docker and Docker Compose to promote through multiple environments\nExperience working with AWS tools and environments\nExperience writing automated tests\nPreferred experience with Jira or a similar scrum management tool\nExcellent communication skills\nStrong analytical and creative problem-solving skills\nSeeking candidates for mid to senior levels\nExperience with Asynchronous messaging using Kafka and JMS\u003c/p\u003e\n\u003cp\u003eDesired Skills/Experience\u003c/p\u003e\n\u003cp\u003eJava and J2EE (full stack)\nJavascript based stacks (MEAN) and open source technologies\nOpenShift PaaS using Docker\nExperience in Java with Spring MVC/REST/Data/Boot, JUnit and JPA\nExperience with the following technologies: Angular (typescript), React (typescript) or NodeJS\nXML and JSON\nWriting queries with relational databases\nWeb technologies - HTML, CSS, JavaScript, JSON, jQuery\nTesting frameworks Selenium, Cumber, JUnit/TestNG\nAutomated Test-Driven Development (ATDD) tools using Selenium, Cucumber\nKafka/JMS and messaging tools\nDesired: Docker, Docker Compose, Git, Jenkins, Java Applications servers (Tomcat/JBoss/etc), SQL and NoSQL DB, Gradle or Maven, Agile Development\nAdditional Desired: Liquibase, Flyway, ElasticSearch, Solr/Lucene, Cucumber\nContinuous integration tools and DevOps automation\nDHS/USCIS experience preferred\u003c/p\u003e\n\u003cp\u003eSecurity Clearance: Must be a US Citizen and have or are able to obtain a Government Agency Suitability Clearance.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your resume to \u003ca href=\"mailto:SSanz-Guerrero@provatohr.com\"\u003eSSanz-Guerrero@provatohr.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"833a538c-bf21-4ba9-8a0c-c1fa2a72945f","type":"Full Time","url":"https://jobs.github.com/positions/833a538c-bf21-4ba9-8a0c-c1fa2a72945f","created_at":"Mon Apr 12 15:30:52 UTC 2021","company":"kognition","company_url":"https://kognition.ai","location":"Philadelphia, PA or remote","title":"Senior Software Engineer, Video ","description":"\u003cp\u003eJob Title: Senior Software Engineer, Video\nCompany: Kognition AI\nDept./Group: Engineering\nEmployment Terms :Contract to hire (3-6 months) for Full-Time\nPosition reports to: Chief Technology Officer\nNumber of Direct Reports: 0-3\nCompensation: Market salary rate + equity incentives + full benefits upon hiring\u003c/p\u003e\n\u003cp\u003ePosition Summary (Purpose of job):\u003c/p\u003e\n\u003cp\u003eKognition is an enterprise AI software company that develops an interoperability infrastructure for smart buildings and smart cities. Kognition's AI-powered policy engine automates complex business operations in real-time. We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R\u0026amp;D team. We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!\u003c/p\u003e\n\u003cp\u003eAs a Senior Software Engineer, you will be a key part of our research and development team that builds our core products. You will design, develop, document, test and debug software applications and services. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eAnalyze, design, and plan complex software solutions -- 20%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead programming effort -- 40%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePerforms complex bug verification, testing, and program support for various products -- 30%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvide technical assistance, mentorship and guidance to junior software developers -- 10%\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eMinimum Job Qualifications:\u003c/p\u003e\n\u003cp\u003eEducation/Training: Bachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related\u003c/p\u003e\n\u003cp\u003eBusiness Experience:\n5+ years experience in software engineering\u003c/p\u003e\n\u003cp\u003eCritical Skills:\u003c/p\u003e\n\u003cp\u003e-Working with digital video and particularly low latency stable web video (WebRTC, MPEG-DASH, HLS).\n-Experience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)\n-Experience with streaming live web cam or IP camera video using RTSP\n-Thorough understanding of modern web languages (e.g. HTML5, CSS3, ES6+)\n-Strong application design skills and understanding of enterprise software design patterns\n-Thorough understanding and experience working with both functional and object oriented programming languages and paradigms (e.g. Java, C++, Rust)\n-Thorough understanding and experience working with scripts and scripting languages (e.g. Bash, Python)\n-Experience developing highly available, highly scalable web applications\n-Experience working with various testing methodologies, including test-driven development (TDD), behavior-driven development (BDD), and unit testing\n-Experience with performance-monitoring and tuning of complex applications\n-Experience deploying, managing, and configuring applications both on-prem and in-cloud (AWS, Google Cloud, Azure)\n-Solid understanding of the Software Development Life Cycle in Agile environment (e.g. Kanban, Scrum)\u003c/p\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cp\u003e-Experience with real-time pub/sub, flow, and streaming frameworks (e.g. Kafka, NiFi)\n-Experience with NoSQL databases (e.g. MongoDB, Cassandra)\n-Experience building and integrating RESTful APIs\n-Experience with machine vision (i.e. openCV)\n-Experience working with containers and container orchestration systems (e.g. Docker, Kubernetes, DC/OS, Nomad)\n-Experience working with deep net frameworks (e.g. Tensorflow, Torch, mxnet, gluon)\n-Experience working with native code in non-native languages (e.g. JNA, JNI, DllImport)\n-Security industry experience\u003c/p\u003e\n\u003cp\u003eAdditional Specialized Knowledge/Skills:\u003c/p\u003e\n\u003cp\u003e-Passion for cutting-edge software design and development\n-Highly motivated and self-directed\n-Excellent written and oral communication skills\n-Keen attention to detail\n-Proven analytical, evaluative, and problem-solving abilities\n-Ability to effectively prioritize and execute tasks in a high-pressure environment\n-Exceptional customer service orientation\n-Extensive experience working in a team-oriented, collaborative environment\n-Willingness to mentor and train junior developers\n-Willingness to support resolution of escalated technical support issues\n-Willingness to travel to client locations is preferred\u003c/p\u003e\n\u003cp\u003eWork Location During Pandemic:\nFully remote\u003c/p\u003e\n\u003cp\u003ePost-Pandemic Location:\nPosition will be located in our Philadelphia, PA office after the pandemic is over\nWFH flexibility with a focus on in-office availability (post-pandemic)\nGeneral Office- travel less than 10%.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail resume to: \u003ca href=\"mailto:jobs@kognition.ai\"\u003ejobs@kognition.ai\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0tnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4f8ff6e72639c0c85d3e0ad9bb2bc97f0e96df08/Kognition-Logo.png"},{"id":"5514a0a7-7fe0-4647-9108-8243d453bd6b","type":"Full Time","url":"https://jobs.github.com/positions/5514a0a7-7fe0-4647-9108-8243d453bd6b","created_at":"Mon Apr 12 15:06:38 UTC 2021","company":"Canada Life","company_url":"https://www.canadalife.com/","location":"Toronto, Ontario, Canada","title":"Software Developer","description":"\u003cp\u003eWe are Canada Life\u003c/p\u003e\n\u003cp\u003eBeing a part of Canada Life means you have a voice. This is a place where your unique background, perspectives and talents are valued, and shape our future success.\u003c/p\u003e\n\u003cp\u003eYou can be your best here. You’re part of a diverse and inclusive workplace where your career and well-being are championed. You’ll have the opportunity to excel in your way, finding new and better ways to deliver exceptional customer and advisor experiences.\u003c/p\u003e\n\u003cp\u003eTogether, as part of a great team, you’ll deliver on our shared purpose to improve the well-being of Canadians. It’s our driving force. Become part of a strong and successful company that’s trusted by millions of Canadians to do the right thing. \u003c/p\u003e\n\u003cp\u003eBe your best at Canada Life.\u003c/p\u003e\n\u003cp\u003eAbout Canada Life’s Digital Hub\u003c/p\u003e\n\u003cp\u003eCanada Life’s Digital Hub is a team driven by customer needs. We provide expertise and strategic thought leadership that’s fueling Canada Life’s customer experiences.  \u003c/p\u003e\n\u003cp\u003eOur team of experts in design, technology, product and agile work collaboratively with our business partners, creating digital tools that improve our customers’ lives. Come join an organization committed to delivering innovative, digital experiences. \u003c/p\u003e\n\u003cp\u003eWe are looking for a Software Developer\u003c/p\u003e\n\u003cp\u003eAs a Software Developer on our Digital team, you will play a key role in delivering engaging digital products, web sites and mobile applications quickly and with minimal customizations for a configured solution that meets the needs of our customers.\u003c/p\u003e\n\u003cp\u003eWhat you will do \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking predominantly in Agile scrum teams, build out business processes using Java, Microsoft .Net Framework, ASP.NET and Angular.\u003c/li\u003e\n\u003cli\u003eInvolved in all phases of the project lifecycle - from low-level design and development through to deployment and post-production support\u003c/li\u003e\n\u003cli\u003eChallenge ideas and opinions to avoid pitfalls and inefficient solutions\u003c/li\u003e\n\u003cli\u003eHelp and mentor other members of the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you will bring \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years experience working on development teams, ideally using Agile development techniques\u003c/li\u003e\n\u003cli\u003eFull Stack Developer experienced in Java, Spring Boot, PL/SQL, Angular and other JavaScript frameworks, HTML5 and CSS and ready and willing to jump right into a training program to come up to speed quickly on the Salesforce Vlocity and Force.com platforms\u003c/li\u003e\n\u003cli\u003eUnderstanding of APIs and how to use them in practice\u003c/li\u003e\n\u003cli\u003eKnowledge and experience with routing and messaging integration platforms such as Apache Camel and queuing techniques\u003c/li\u003e\n\u003cli\u003eAdept at picking up new skills and technologies and excited to constantly learn\u003c/li\u003e\n\u003cli\u003eBachelor’s degree in Computer Science or equivalent experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are one of Canada's top 100 employers!\u003c/p\u003e\n\u003cp\u003eCanada Life serves the financial security needs of more than 13 million people across Canada, with additional operations in Europe and the United States. As members of the Power Financial Corporation group of companies, we’re one of Canada’s leading insurers with interests in life insurance, health insurance, investment and retirement savings. We offer a broad portfolio of financial and benefit plan solutions for individuals, families, businesses and organizations.  \u003c/p\u003e\n\u003cp\u003eWe are committed to providing an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live, and to creating an environment where every employee has the opportunity to reach their potential.  \u003c/p\u003e\n\u003cp\u003eCanada Life would like to thank all applicants, however only those who qualify for an interview will be contacted  \u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSubmit an application here: \u003ca href=\"https://bit.ly/3a53Wue\"\u003ehttps://bit.ly/3a53Wue\u003c/a\u003e or email a copy of your resume directly to \u003ca href=\"mailto:aynsley.hamilton@canadalife.com\"\u003eaynsley.hamilton@canadalife.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0NnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c100f88bfaeb2a7594caa849f9ca0d1aeb56c1b8/Canada%20Life%20Logo%20-%20LI.jfif"},{"id":"a17c1673-09b8-42e1-9ebf-6b8e97a40cc4","type":"Full Time","url":"https://jobs.github.com/positions/a17c1673-09b8-42e1-9ebf-6b8e97a40cc4","created_at":"Mon Apr 12 15:05:51 UTC 2021","company":"kognition","company_url":"https://kognition.ai","location":"Philadelphia, PA or remote","title":"DevOps Engineer","description":"\u003cp\u003eJob Title: DevOps Engineer\nCompany: Kognition AI\nDept./Group: Engineering\nEmployment Terms: Contract to hire (3-6 months) for Full-Time\nPosition reports to: Chief Technology Officer\nNumber of Direct Reports: 0-3\nCompensation: Market salary rate + equity incentives + full benefits upon hiring\u003c/p\u003e\n\u003cp\u003ePosition Summary (Purpose of job):\u003c/p\u003e\n\u003cp\u003eKognition is an enterprise AI software company that develops an interoperability infrastructure for smart buildings and smart cities. Kognition's AI-powered policy engine automates complex business operations in real-time. We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R\u0026amp;D team. We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!\u003c/p\u003e\n\u003cp\u003eAs a DevOps Engineer, you will be a key part of our research and development and operations team that builds and operates our core products. You will design, develop, deploy, document, test, and debug our on-prem and cloud Kubernetes infrastructure. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eAnalyze, design, and plan complex software solutions -- 20%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead programming effort -- 40%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePerforms complex bug verification, testing, and program support for various products -- 30%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvide technical assistance, mentorship and guidance to junior software developers -- 10%\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eMinimum Job Qualifications:\u003c/p\u003e\n\u003cp\u003eEducation/Training: Bachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related\u003c/p\u003e\n\u003cp\u003eBusiness Experience:\n5+ years experience in IT operations, software engineering\u003c/p\u003e\n\u003cp\u003eCritical Skills:\u003c/p\u003e\n\u003cp\u003e-Strong application design skills and understanding of AWS cloud services and Kubernetes\n-Thorough understanding and experience working with scripts and scripting languages (e.g. Bash, Python)\n-Experience working with containers and container orchestration systems and specifically Kubernetes.\n-Experience writing and deploying Helm charts on Kubernetes\n-Experience developing highly available, highly scalable web applications\n-Experience with real-time pub/sub, flow, and streaming frameworks (e.g. Kafka, NiFi)\n-Experience with NoSQL databases (e.g. MongoDB, Cassandra, CouchDB) and replication\n-Experience working with various testing methodologies, including test-driven development (TDD), behavior-driven development (BDD), and unit testing\n-Experience with performance-monitoring and tuning of complex applications\n-Experience deploying, managing, and configuring applications both on-prem and in-cloud (AWS, Google Cloud, Azure)\n-Solid understanding of the Software Development Life Cycle in Agile environment (e.g. Kanban, Scrum)\u003c/p\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cp\u003e-Experience with machine vision (i.e. openCV)\n-Experience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)\n-Experience working with deep net frameworks (e.g. Tensorflow, Torch, mxnet, gluon)\n-Experience working with native code in non-native languages (e.g. JNA, JNI, DllImport)\n-Security industry experience\u003c/p\u003e\n\u003cp\u003eAdditional Specialized Knowledge/Skills:\u003c/p\u003e\n\u003cp\u003e-Passion for cutting-edge software design and development\n-Highly motivated and self-directed\n-Excellent written and oral communication skills\n-Keen attention to detail\n-Proven analytical, evaluative, and problem-solving abilities\n-Ability to effectively prioritize and execute tasks in a high-pressure environment\n-Exceptional customer service orientation\n-Extensive experience working in a team-oriented, collaborative environment\n-Willingness to mentor and train junior developers\n-Willingness to support resolution of escalated technical support issues\n-Willingness to travel to client locations is preferred\u003c/p\u003e\n\u003cp\u003eWork Location During Pandemic:\nFully remote\u003c/p\u003e\n\u003cp\u003ePost-Pandemic Location:\nPosition will be located in our Philadelphia, PA office after the pandemic is over\nWFH flexibility with a focus on in-office availability (post-pandemic)\nGeneral Office- travel less than 10%.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail resume to: \u003ca href=\"mailto:jobs@kognition.ai\"\u003ejobs@kognition.ai\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbjZnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--35cd9cd717939c8c544d0d49474428b858be3bd5/Kognition-Logo.png"},{"id":"3e546b76-6555-41a5-a0f3-0b98f800e04e","type":"Full Time","url":"https://jobs.github.com/positions/3e546b76-6555-41a5-a0f3-0b98f800e04e","created_at":"Mon Apr 12 14:34:59 UTC 2021","company":"kognition","company_url":"https://kognition.ai","location":"Philadelphia, PA or remote","title":"Senior UI / UX Engineer - React, Node.js","description":"\u003cp\u003eJob Title: Senior UI / UX Engineer\nCompany: Kognition AI\nDept./Group: Engineering\nEmployment Terms: Contract to hire (3-6 months) for Full-Time\nPosition reports to: Chief Technology Officer\nNumber of Direct Reports: 0-3\nCompensation: Market salary rate + equity incentives + full benefits upon hiring\u003c/p\u003e\n\u003cp\u003ePosition Summary (Purpose of job):\u003c/p\u003e\n\u003cp\u003eKognition is an enterprise AI software company that develops an interoperability infrastructure for smart buildings and smart cities. Kognition's AI-powered policy engine automates complex business operations in real-time. We are looking for a full stack senior software engineer to join our dynamic and rapidly growing R\u0026amp;D team. We look at software development as a craft that requires deliberate practice, curiosity, and passion. If you work hard, have an innovative mindset, and love building great software, we should talk!\u003c/p\u003e\n\u003cp\u003eAs a Senior UI Engineer, you will be a key part of our research and development team that builds our core products. You will design, develop, document, test and debug Web UI applications and services. You will work as part of a high-powered team, in an agile fashion, towards an end goal of making the world smarter, safer and more secure.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eAnalyze, plan, and design easy-to-use user interfaces infocore products -- 20%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead programming effort -- 40%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePerforms complex bug verification, testing, and program support for various products -- 30%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvide technical assistance, mentorship and guidance to junior software developers -- 10%\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eMinimum Job Qualifications:\u003c/p\u003e\n\u003cp\u003eEducation/Training: Bachelors or Masters degree; Computer Science, Engineering, Management Information Systems, or related\u003c/p\u003e\n\u003cp\u003eBusiness Experience:\n5+ yrs experience web development\n3+ yrs experience with React.js and Node.js\u003c/p\u003e\n\u003cp\u003eCritical Skills:\u003c/p\u003e\n\u003cp\u003e-Strong application design skills and understanding of single page app design patterns\n-Thorough understanding of modern web languages (e.g. HTML5, CSS3 and ES6+)\n-Thorough understanding modern web build chain technologies and purpose (e.g. webpack, gulp)\n-Thorough understanding of React.js\n-Comprehensive knowledge of available library options within the React ecosystem (e.g. Redux, Material-UI, etc.)\n-Experience developing highly available, highly scalable web applications\n-Experience building and integrating RESTful APIs, and integrating back-end services\n-Experience with RDBMS and NoSQL databases\n-Experience working with various testing methodologies, including test-driven development (TDD), behavior-driven development (BDD), and unit testing\n-Experience with performance-monitoring and tuning of web stack applications\n-Experience deploying, managing, and configuring applications both on-prem and in-cloud (e.g. AWS, Google Cloud, Azure)\n-Solid understanding of the Software Development Life Cycle and various Agile methodologies (e.g. Kanban, Scrum)\u003c/p\u003e\n\u003cp\u003eDesired Skills:\u003c/p\u003e\n\u003cp\u003e-Experience working with containers and container orchestration systems (e.g. Docker, Kubernetes, DC/OS, Nomad)\n-Experience with machine vision (i.e. openCV)\n-Experience with web based video processing, video analytics, media compression and encoding (i.e. Gstreamer, ffmpeg)\u003c/p\u003e\n\u003cp\u003eAdditional Specialized Knowledge/Skills:\u003c/p\u003e\n\u003cp\u003e-Passion for cutting-edge software design and development\n-Highly motivated and self-directed\n-Excellent written and oral communication skills\n-Keen attention to detail\n-Proven analytical, evaluative, and problem-solving abilities\n-Ability to effectively prioritize and execute tasks in a high-pressure environment\n-Focus on user experience\n-Extensive experience working in a team-oriented, collaborative environment\n-Willingness to mentor and train junior developers\n-Willingness to support resolution of escalated technical support issues\u003c/p\u003e\n\u003cp\u003eWork Location During Pandemic:\nFully remote\u003c/p\u003e\n\u003cp\u003ePost-Pandemic Location:\nPosition will be located in our Philadelphia, PA office after the pandemic is over\nWFH flexibility with a focus on in-office availability (post-pandemic)\nGeneral Office- travel less than 10%.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:jobs@kognition.ai\"\u003ejobs@kognition.ai\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmlnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9cc81f3fdd0714ab6f095c69dde26b36da42744/Kognition-Logo.png"},{"id":"660d99c2-9b56-4005-8fa5-5faed6753ac9","type":"Full Time","url":"https://jobs.github.com/positions/660d99c2-9b56-4005-8fa5-5faed6753ac9","created_at":"Mon Apr 12 14:15:47 UTC 2021","company":"Canada Life","company_url":"https://www.canadalife.com/","location":"Canada","title":"Salesforce Vlocity Developer","description":"\u003cp\u003eWe are Canada Life\u003c/p\u003e\n\u003cp\u003eBeing a part of Canada Life means you have a voice. This is a place where your unique background, perspectives and talents are valued, and shape our future success.\u003c/p\u003e\n\u003cp\u003eYou can be your best here. You’re part of a diverse and inclusive workplace where your career and well-being are championed. You’ll have the opportunity to excel in your way, finding new and better ways to deliver exceptional customer and advisor experiences.\u003c/p\u003e\n\u003cp\u003eTogether, as part of a great team, you’ll deliver on our shared purpose to improve the well-being of Canadians. It’s our driving force. Become part of a strong and successful company that’s trusted by millions of Canadians to do the right thing. \u003c/p\u003e\n\u003cp\u003eBe your best at Canada Life.\u003c/p\u003e\n\u003cp\u003eAbout Canada Life’s Digital Hub  \u003c/p\u003e\n\u003cp\u003eCanada Life’s Digital Hub is a team driven by customer needs. We provide expertise and strategic thought leadership that’s fueling Canada Life’s customer experiences.   \u003c/p\u003e\n\u003cp\u003eOur team of experts in design, technology, product and agile work collaboratively with our business partners, creating digital tools that improve our customers’ lives. Come join an organization committed to delivering innovative, digital experiences.  \u003c/p\u003e\n\u003cp\u003eWe are looking for a Salesforce Vlocity Developer \u003c/p\u003e\n\u003cp\u003eGiven the size and scope of our organization, we have the flexibility for this position to be located in the following head office locations: Toronto, London, or Winnipeg\u003c/p\u003e\n\u003cp\u003eOverview\u003c/p\u003e\n\u003cp\u003eAs a Salesforce Industries Vlocity developer, you are responsible for transforming the design and product vision into a seamless and engaging product. You work hard to stay on top of fast changing technology and invest a lot of energy to learn new platform features. You stay on top of the latest Salesforce product developments and anticipate what the near future will bring. You love clean code, clean interfaces and have a real passion for problem solving.\u003c/p\u003e\n\u003cp\u003eAs a Salesforce Industries Vlocity Developer, you will also have deep understanding and proven grasp of end-to-end programming and an approach to development that focuses on building light-weight re-usable components that can be used to deliver a great product.\u003c/p\u003e\n\u003cp\u003eWhat you'll do \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and build experiences in Salesforce Communities using the Salesforce Industries Vlocity cloud platform\u003c/li\u003e\n\u003cli\u003eEnsure the code follows latest coding practices and industry standards\u003c/li\u003e\n\u003cli\u003eWork closely with other developers to understand and properly use the platform components\u003c/li\u003e\n\u003cli\u003eWrite both unit and integration tests and develop automation tools for daily tasks\u003c/li\u003e\n\u003cli\u003eChallenge ideas and opinions to avoid pitfalls and inefficient solutions\u003c/li\u003e\n\u003cli\u003eHelp and mentor other members of the team\u003c/li\u003e\n\u003cli\u003eBe a member of a high performing Agile team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you'll bring \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of experience in Salesforce application development and administration\u003c/li\u003e\n\u003cli\u003e1+ years of experience in Salesforce Lightning Web Components development\u003c/li\u003e\n\u003cli\u003e1+ years of experience in Salesforce Vlocity application development\u003c/li\u003e\n\u003cli\u003eAn in-depth understanding of the Salesforce Lightning Design System (SLDS) and Vlocity Newport Design System\u003c/li\u003e\n\u003cli\u003eExpert level experience using the core Vlocity technologies – Cards, Templates, Integration Procedures, OmniScripts and Data Raptors\u003c/li\u003e\n\u003cli\u003eUnderstanding of APIs and how to use them in practice\u003c/li\u003e\n\u003cli\u003eExperience with continuous integration tools like JIRA, Bitbucket, Jenkins and Confluence\u003c/li\u003e\n\u003cli\u003eKnowledge \u0026amp; experience with unit testing\u003c/li\u003e\n\u003cli\u003eUnderstanding and flexible in working in an Agile environment\u003c/li\u003e\n\u003cli\u003eBachelor’s degree in Computer Science or equivalent experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWho you are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent Salesforce knowledge and a positive attitude/customer focused\u003c/li\u003e\n\u003cli\u003eKeeps up to date with platform best practices, processes, and configuration patterns\u003c/li\u003e\n\u003cli\u003eSupports proactive identification risk and issues\u003c/li\u003e\n\u003cli\u003eDemonstrated ability to meet deadlines, handle and prioritize simultaneous requests\u003c/li\u003e\n\u003cli\u003eCreative and analytical thinker with strong problem-solving skills\u003c/li\u003e\n\u003cli\u003eMust demonstrate exceptional verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eAbility to critically evaluate information gathered from multiple sources \u0026amp; reconcile conflicts\u003c/li\u003e\n\u003cli\u003eAbility to assess the impact of new requirement on Salesforce.com and all upstream and downstream applications, systems, and processes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are one of Canada's top 100 employers!\u003c/p\u003e\n\u003cp\u003eCanada Life serves the financial security needs of more than 13 million people across Canada, with additional operations in Europe and the United States. As members of the Power Financial Corporation group of companies, we’re one of Canada’s leading insurers with interests in life insurance, health insurance, investment and retirement savings. We offer a broad portfolio of financial and benefit plan solutions for individuals, families, businesses and organizations.  \u003c/p\u003e\n\u003cp\u003eWe are committed to providing an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live, and to creating an environment where every employee has the opportunity to reach their potential.  \u003c/p\u003e\n\u003cp\u003eCanada Life would like to thank all applicants, however only those who qualify for an interview will be contacted.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSubmit an application here: \u003ca href=\"https://bit.ly/3a4hMx7\"\u003ehttps://bit.ly/3a4hMx7\u003c/a\u003e or email a copy of your resume directly to \u003ca href=\"mailto:aynsley.hamilton@canadalife.com\"\u003eaynsley.hamilton@canadalife.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbStnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e86f3ac8f41ba685faa63546acfcba6c9f933895/Canada%20Life%20Logo%20-%20LI.jfif"},{"id":"b3262e6f-bf14-4f06-9918-ded69df9e0dc","type":"Full Time","url":"https://jobs.github.com/positions/b3262e6f-bf14-4f06-9918-ded69df9e0dc","created_at":"Mon Apr 12 13:21:17 UTC 2021","company":"Canada Life","company_url":"https://www.canadalife.com","location":"Canada","title":"Salesforce Developer","description":"\u003cp\u003eWe are Canada Life\u003c/p\u003e\n\u003cp\u003eBeing a part of Canada Life means you have a voice. This is a place where your unique background, perspectives and talents are valued, and shape our future success.\u003c/p\u003e\n\u003cp\u003eYou can be your best here. You’re part of a diverse and inclusive workplace where your career and well-being are championed. You’ll have the opportunity to excel in your way, finding new and better ways to deliver exceptional customer and advisor experiences.\u003c/p\u003e\n\u003cp\u003eTogether, as part of a great team, you’ll deliver on our shared purpose to improve the well-being of Canadians. It’s our driving force. Become part of a strong and successful company that’s trusted by millions of Canadians to do the right thing.\n \nBe your best at Canada Life.\u003c/p\u003e\n\u003cp\u003eAbout Canada Life’s Digital Hub\u003c/p\u003e\n\u003cp\u003eCanada Life’s Digital Hub is a team driven by customer needs. We provide expertise and strategic thought leadership that’s fueling Canada Life’s customer experiences.  \u003c/p\u003e\n\u003cp\u003eOur team of experts in design, technology, product and agile work collaboratively with our business partners, creating digital tools that improve our customers’ lives. Come join an organization committed to delivering innovative, digital experiences. \u003c/p\u003e\n\u003cp\u003eWe are looking for a Salesforce Developer\u003c/p\u003e\n\u003cp\u003eGiven the size and scope of our organization, we have the flexibility for this position to be located in the following head office locations: Toronto, London, or Winnipeg\u003c/p\u003e\n\u003cp\u003eOverview\u003c/p\u003e\n\u003cp\u003eAs a Salesforce Developer, you will be responsible for the ongoing development of our Salesforce.com platform with 4000+ users. You will have a record of success in improving processes and adoption using the platform, working closely with leaders, business units, and subject matter experts to identify, configure, and deploy new business processes. This includes, but is not limited to: sales, support, marketing and corporate.\u003c/p\u003e\n\u003cp\u003eAs a Salesforce Developer, you will also have a deep understanding and grasp for executing on the day-to-day configuration, support, maintenance, and improvement of our platform.\u003c/p\u003e\n\u003cp\u003eWhat you’ll do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeliver configurations based on specifications to meet product requirements\u003c/li\u003e\n\u003cli\u003eCollaborate with our architects and analysts to configure and integrate components and third-party products, tools and solutions with the platform\u003c/li\u003e\n\u003cli\u003eIdentify and recommend solutions for application defects, determining root causes and minimizing the introduction of new defects\u003c/li\u003e\n\u003cli\u003ePerform unit testing, code and configuration management activities, system development and providing guidance to team members\u003c/li\u003e\n\u003cli\u003ePerform analysis, design, configuration, and implementation support for our platform\u003c/li\u003e\n\u003cli\u003eTroubleshoot platform issues and drive exploration of options, recommending solutions and / or preparing discussion for escalation\u003c/li\u003e\n\u003cli\u003eStudy and implement new Salesforce features and capabilities in support of evolving business needs \u003c/li\u003e\n\u003cli\u003eIdentify and incorporate new user flows within the platform to optimize functionality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you’ll bring\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMinimum 3 years of experience as a Salesforce.com developer\u003c/li\u003e\n\u003cli\u003e3-5 years technical Salesforce experience building solutions using Sales Cloud, Service Cloud, Community Cloud\u003c/li\u003e\n\u003cli\u003eExperience in Apex Code, triggers, custom object development, SFDC APIs, Web services, Force.com, Lightning Web Component development\u003c/li\u003e\n\u003cli\u003eSales Cloud, Service Cloud and Developer certifications preferred\u003c/li\u003e\n\u003cli\u003ePlatform Developer 1 certification preferred\u003c/li\u003e\n\u003cli\u003eProven ability to design and implement new processes and facilitate user adoption\u003c/li\u003e\n\u003cli\u003eStrong understanding of the platform, with the ability to build custom apps and objects, formula fields, workflows, custom views, and other content of intermediate complexity\u003c/li\u003e\n\u003cli\u003eStrong understanding of Salesforce.com best practices and functionality\u003c/li\u003e\n\u003cli\u003ePrevious experience working in a SCRUM or agile environment preferred \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWho you are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent Salesforce knowledge and a positive attitude/customer focused\u003c/li\u003e\n\u003cli\u003eKeeps up to date with platform best practices, processes, and configuration patterns\u003c/li\u003e\n\u003cli\u003eSupports proactive identification risk and issues\u003c/li\u003e\n\u003cli\u003eDemonstrated ability to meet deadlines, handle and prioritize simultaneous requests\u003c/li\u003e\n\u003cli\u003eCreative and analytical thinker with strong problem-solving skills\u003c/li\u003e\n\u003cli\u003eMust demonstrate exceptional verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eAbility to critically evaluate information gathered from multiple sources \u0026amp; reconcile conflicts\u003c/li\u003e\n\u003cli\u003eAbility to assess the impact of new requirement on Salesforce.com and all upstream and downstream applications, systems, and processes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are one of Canada's top 100 employers!\u003c/p\u003e\n\u003cp\u003eCanada Life serves the financial security needs of more than 13 million people across Canada, with additional operations in Europe and the United States. As members of the Power Financial Corporation group of companies, we’re one of Canada’s leading insurers with interests in life insurance, health insurance, investment and retirement savings. We offer a broad portfolio of financial and benefit plan solutions for individuals, families, businesses and organizations.  \u003c/p\u003e\n\u003cp\u003eWe are committed to providing an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of the communities in which we live, and to creating an environment where every employee has the opportunity to reach their potential.  \u003c/p\u003e\n\u003cp\u003eCanada Life would like to thank all applicants, however only those who qualify for an interview will be contacted  \u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSubmit an application here: \u003ca href=\"https://bit.ly/3a0NM4T\"\u003ehttps://bit.ly/3a0NM4T\u003c/a\u003e or email a copy of your resume directly to \u003ca href=\"mailto:aynsley.hamilton@canadalife.com\"\u003eaynsley.hamilton@canadalife.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf6e28b08841f6a5a7a725fc10b8c682d50c528e/Canada%20Life%20Logo%20-%20LI.jfif"},{"id":"0410109c-d3d6-44f3-80e4-f975d981787c","type":"Full Time","url":"https://jobs.github.com/positions/0410109c-d3d6-44f3-80e4-f975d981787c","created_at":"Mon Apr 12 13:46:31 UTC 2021","company":"Samskip","company_url":"https://vonq.io/326G599","location":"Cluj-Napoca","title":"Front-End Web Developer","description":"\u003ch2\u003eLead the development of user-friendly front-end solutions that do so much to enable the success of our international transport company\u003c/h2\u003e\n\u003cp\u003eSamskip is a large, international company that organizes thousands of goods transports every week. Our success depends substantially on a web portal that enables customers (and employees) to perform daily actions such as booking sea-freights and ordering containers. It’s a valuable 24/7 resource, run by an experienced team that is committed to the highest professional standards. If you think you could take the lead in front-end web development for this portal, please read on.\u003c/p\u003e\n\u003ch2\u003eFront-end excellence within a collaborative and professional environment\u003c/h2\u003e\n\u003cp\u003eYou will be part of the team that focuses on developing a robust and efficient Customer Portal (Service Web). The team works with legacy systems such as ReactJS and AngularJS (maintained by Facebook) and .NET Core and ASP.NET stack (maintained by Microsoft).\u003c/p\u003e\n\u003cp\u003eCentral to this effort is the ongoing development of attractive and user-friendly UIs. Your role is to act as team leader for this front-end web development, evolving interesting web designs that hundreds of people can easily interact with and rely on every day.\u003c/p\u003e\n\u003cp\u003eThe development team strives for mature, stable development frameworks that deliver competitive software performance, eliminate the risk of failure, and ensure scalability for future developments. This is achieved through continuous development within an agile, modernized software environment where business needs can be solved quickly on an ongoing basis.\u003c/p\u003e\n\u003ch2\u003eFlexible, professional and organized\u003c/h2\u003e\n\u003cp\u003eAs a Front-End Web Developer, you need the flexibility necessary to deliver predefined web designs while at the same time taking the initiative and proposing improvements to existing designs. Further, you should be an organized multi-tasker who can commit to a predefined sprint plan whilst also performing hotfixes that need to be solved ASAP. And you always show up on time for team meetings such as Planning-, Retro-, Daily- and Demo meetings. Your specific responsibilities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMaintaining and developing fully scalable websites and securing professional UX;\u003c/li\u003e\n\u003cli\u003eTaking the lead in front-end web development;\u003c/li\u003e\n\u003cli\u003eImplementing professional web designs and deliver UIs that attract users;\u003c/li\u003e\n\u003cli\u003eDealing with ad-hoc requirements and/or issues with web designs your team is responsible for.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThis is the place to get ahead\u003c/h2\u003e\n\u003cp\u003eSamskip is committed to innovating and applying sustainable and multimodal transport links across Europe. Our office in Cluj-Napoca plays an important role in this network. It’s busy, it’s fun and every day is different as you work with a diverse range of colleagues to deliver 21st-century solutions for a large portfolio of well-known customers.\u003c/p\u003e\n\u003cp\u003eMoreover, we want you to grow and thrive with us. That’s why you’ll have access to wide-ranging development opportunities including training and e-learning through our Samskip Academy. And we do all to ensure that Samskip is a company where colleagues become friends. Other benefits include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA competitive compensation package;\u003c/li\u003e\n\u003cli\u003e21-25 days of annual leave;\u003c/li\u003e\n\u003cli\u003eMeal ticket;\u003c/li\u003e\n\u003cli\u003eTransportation allowance;\u003c/li\u003e\n\u003cli\u003e7Card sports subscription;\u003c/li\u003e\n\u003cli\u003eMedical insurance;\u003c/li\u003e\n\u003cli\u003eA laptop and a mobile phone.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAre you the great front-end developer we’re looking for?\u003c/h2\u003e\n\u003cp\u003eTo succeed in this role you should have a solid software engineering background in front-end web development. In particular, you have extensive experience with frameworks such as ReactJS, Angular, Vue etc. As a leader, you also need knowledge of stylesheets such as CSS / SASS / LESS.\u003c/p\u003e\n\u003cp\u003eImplementing a proposed web design comes naturally to you, and you have a sharp eye for general UX improvements. It is essential that you always think in terms of finding universal scalability and you go the extra mile for fully scalable web designs. Above all, you love working in SCRUM / Kanban Agile continuous development environment. We are a cross-functional team working with a mono-repo so experience of collaborative development with Git is key. The back-end is mostly RESTful .NET APIs, so basic C# experience is a big plus.\u003c/p\u003e\n\u003cp\u003eYou also know your way around CSS, LESS, SASS, REST, HTTP, Swagger, Angular, React and Git. Although the development team always strives for modernized web development you will sometimes need to improve, coordinate, and add scalability to existing or older web designs.\u003c/p\u003e\n\u003cp\u003eAll of this demands highly evolved critical thinking and problem-solving skills, along with the ability to quickly master new techniques. Deadlines are often tight so you must have the flexibility to respond effectively under pressure to last-minute changes and priorities. You also need excellent communication and collaboration skills as you influence, negotiate and present information to engage others in our quest for framework simplicity and efficient future maintenance. The more technical requirements are:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA degree in Computer Science or similar and proven work experience of implementing fully scalable web designs;\u003c/li\u003e\n\u003cli\u003eProven work experience with today’s leading web frameworks such as ReactJS, Angular, AngularJS and/or Vue;\u003c/li\u003e\n\u003cli\u003eTransport / Logistics industry experience is a plus;\u003c/li\u003e\n\u003cli\u003eGood knowledge of HTML, CSS, SASS / LESS (experience with Tailwind is a plus), XML and JSON;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of ReactJS (experience with Redux is a plus) and basic knowledge of Angular and/or AngularJS;\u003c/li\u003e\n\u003cli\u003eGood knowledge of a RESTful infrastructure, with basic knowledge of C#, .NET Core and ASP.NET a plus;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of Visual Studio Code and front-end development extensions;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of Git (experience with GitFlow is a plus);\u003c/li\u003e\n\u003cli\u003eBasic knowledge of cloud infrastructure and experience with CI / CD setup (experience with Microsoft Azure is a plus);\u003c/li\u003e\n\u003cli\u003eExcellent written and spoken English.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eGet to the front-end of the queue!\u003c/h2\u003e\n\u003cp\u003eDo you think you could be a great asset to Samskip based on everything you’ve read here? Don’t hang around! \u003ca href=\"https://vonq.io/326G599\"\u003eClick here for the application form\u003c/a\u003e and send us your CV. If you have any questions about the vacancy feel free to call us on +31 (88) 400 13 93 or send an e-mail to: \u003ca href=\"mailto:career.management@samskip.com\"\u003ecareer.management@samskip.com\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/326G599\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWFnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e17f9638ee7f9a15c255a52c92bc1feb0ac7f2a8/Samskip.jpeg"},{"id":"213b7926-005e-43c2-800a-86835a870827","type":"Full Time","url":"https://jobs.github.com/positions/213b7926-005e-43c2-800a-86835a870827","created_at":"Mon Apr 12 12:22:30 UTC 2021","company":"Spotler Group","company_url":"https://spotlergroup.com/","location":"Utrecht","title":"PHP Lead Developer (Full Stack)","description":"\u003cp\u003e\u003cstrong\u003eSpotler Group, an Marketing software company with over 2500 clients in 8 European countries transmitting over 9 billion messages every year, is looking for an experienced\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePHP Lead Developer (Full Stack)\u003c/strong\u003e\n\u003cstrong\u003eFulltime – Utrecht\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a key member of the Development team, you’ll be responsible for leading a team to deliver our Marketing Automation roadmap to the business for our key existing email marketing software platform, Tripolis Webpower.\u003c/p\u003e\n\u003cp\u003eThe software is a full SAAS delivered Marketing Automation platform that allows our customers to build beautiful email, landing page, survey designs and deliver them through fast and secure email connections to millions of our customers contacts. The email campaigns can be basic one off email or sophisticated workflow based triggered mailings.\u003c/p\u003e\n\u003cp\u003eA full stack developer (PHP, MySQL) working in an Agile framework, has a clear drive for delivery as well as strong organisation and problem-solving skills.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTechnical requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePHP 7+\u003c/li\u003e\n\u003cli\u003eMySQL\u003c/li\u003e\n\u003cli\u003eReact, Javascript\u003c/li\u003e\n\u003cli\u003eA strong understanding of Event Driven Architecture using a message broker\u003c/li\u003e\n\u003cli\u003eUnit test driven\u003c/li\u003e\n\u003cli\u003eThird party integrations (CRMs, Zapier etc)\u003c/li\u003e\n\u003cli\u003eSecurity aware\u003c/li\u003e\n\u003cli\u003eAgile development background to lead the team\u003c/li\u003e\n\u003cli\u003eAPI delivery\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePersonal strengths\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA positive, can-do attitude; especially when working under pressure to produce results\u003c/li\u003e\n\u003cli\u003eConfidence and an eye for detail when carrying out thorough QA testing\u003c/li\u003e\n\u003cli\u003eComfortable working under pressure\u003c/li\u003e\n\u003cli\u003eSmart thinker\u003c/li\u003e\n\u003cli\u003eGood team leadership skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\nWe offer you a working environment in which you are challenged to bring out the best in yourself every day. After all, our field is always evolving. Grow with us in a company with international ambitions: \u003ca href=\"https://spotlergroup.com/\"\u003ehttps://spotlergroup.com/\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe role is for either remote home working, or potential to work in Holland or chance to travel there periodically in the future to interact with the development team face to face.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply today and become our new PHP Developer!\nSend us your CV and motivation via our \u003cstrong\u003e\u003ca href=\"https://www.spotler.jobs/php-lead-developer-full-stack/nl?utm_source=github\u0026amp;utm_medium=referral\u0026amp;utm_term=2021\u0026amp;utm_content=184247\u0026amp;utm_campaign=php-lead-developer-full-stack\"\u003eapplication form\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b4dd9978a9b9ada7c90dc9dacaae21092cdf21e9/Logo%20Spotler%20group.png"},{"id":"83ac62fe-aa09-4a06-9f45-2f24d6d69a6e","type":"Full Time","url":"https://jobs.github.com/positions/83ac62fe-aa09-4a06-9f45-2f24d6d69a6e","created_at":"Mon Apr 12 11:57:25 UTC 2021","company":"Spotler Group","company_url":"https://spotlergroup.com/","location":"Utrecht","title":"(Junior) PHP Developer (Full Stack)","description":"\u003cp\u003e\u003cstrong\u003eSpotler Group, an Marketing software company with over 2500 clients in 8 European countries transmitting over 9 billion messages every year, is looking for a\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e(Junior) PHP Developer (Full Stack)\u003c/strong\u003e\n\u003cstrong\u003eFulltime – Utrecht\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou will work within the development focused on customer development projects and also on our Marketing Automation roadmap to the business for our key existing email marketing software platform, Tripolis Webpower.\u003c/p\u003e\n\u003cp\u003eThe software is a full SAAS delivered Marketing Automation platform that allows our customers to build beautiful email, landing page, survey designs and deliver them through fast and secure email connections to millions of our customers contacts. The email campaigns can be basic one off email or sophisticated workflow based triggered mailings.\u003c/p\u003e\n\u003cp\u003eA full stack developer (PHP, MySQL) working in an Agile framework with a clear drive for delivery.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTechnical requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e1+ years development background\u003c/li\u003e\n\u003cli\u003ePHP 7+\u003c/li\u003e\n\u003cli\u003eMySQL\u003c/li\u003e\n\u003cli\u003eReact, Javascript\u003c/li\u003e\n\u003cli\u003eUnit test driven\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePersonal strengths\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA positive, can-do attitude\u003c/li\u003e\n\u003cli\u003eConfidence and an eye for detail\u003c/li\u003e\n\u003cli\u003eComfortable working under pressure\u003c/li\u003e\n\u003cli\u003eGood team skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\nWe offer you a working environment in which you are challenged to bring out the best in yourself every day. After all, our field is always evolving. Grow with us in a company with international ambitions: \u003ca href=\"https://spotlergroup.com/\"\u003ehttps://spotlergroup.com/\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe role is for either remote home working, or potential to work in Holland or chance to travel there periodically in the future to interact with the development team face to face.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply today and become our new PHP Developer!\nSend us your CV and motivation via our \u003cstrong\u003e\u003ca href=\"https://www.spotler.jobs/php-developer-full-stack/nl?utm_source=github\u0026amp;utm_medium=referral\u0026amp;utm_term=2021\u0026amp;utm_content=184243\u0026amp;utm_campaign=junior-php-developer-full-stack\"\u003eapplication form\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHFnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cd9fb74541eb627123af0b7564e0e9e06259dcf0/Logo%20Spotler%20group.png"},{"id":"3f8fb79f-7e78-4c6b-b006-22848d41b72f","type":"Full Time","url":"https://jobs.github.com/positions/3f8fb79f-7e78-4c6b-b006-22848d41b72f","created_at":"Mon Apr 12 09:58:52 UTC 2021","company":"Synetec Ltd","company_url":"https://synetec.co.uk/","location":"London","title":"Mid Level .Net Developer","description":"\u003cp\u003eSynetec are looking for an enthusiastic, conscientious and technically skilled Mid Level .Net developer to work within the Development Team and who will report to the Head of Delivery.\u003c/p\u003e\n\u003cp\u003eThe role will be to assist in the design and then develop the solutions that are needed to support the growing business and trading platforms. The individual will be influential in the analysis, design, development, and ongoing maintenance of these class leading platforms, whilst liaising with a Product Owner and fellow developers. The person will be working within a small IT team, reporting to the Head of Delivery and will be comfortable in a fast-paced, entrepreneurial, team-orientated environment and will be required to:\u003c/p\u003e\n\u003cp\u003eParticipate in an Agile project team with an emphasis on delivery and client value\nBe included in scrum team responsibilities, e.g. review presentation, etc.\nProvide code reviews and “buddy testing”\nHelp mentor and support Junior Developers\nCommit to self-improvement, learning and progression\nAttend appropriate meet-ups for client projects and internal team development\nResearch new technologies as they become relevant\nEssential Skills:\u003c/p\u003e\n\u003cp\u003eMinimum of 4 years C# commercial experience\nGood knowledge/experience of design patterns(repository \u0026amp; UoW)\nStrong C# .Net developer, with proven experience working on server-side multi-threaded systems.\nGood knowledge of .Net development\nGood knowledge of Domain Driven Design\nGood Entity Framework skills.\nGood Microservices experience\nGood knowledge/experience of writing testable software\nComfortable joining an Agile Scrum team\nExcellent written and spoken English\nGood knowledge/experience with GIT software repository\u003c/p\u003e\n\u003cp\u003eWhat we can offer you:\u003c/p\u003e\n\u003cp\u003eSalary: £55,000 to £65,000, depending on experience.\nFlexible working hours, home and office\nUp-skilling/training opportunities\nPrivate healthcare after qualifying period\nGenerous leave allowance of 23 days as well as all working days off between Christmas and New Year’s Day\nCulture of inclusivity\nGreat location in London near London Bridge, Southwark and Waterloo stations. Remote working during COVID restrictions.\nImmediate start available\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your CV to \u003ca href=\"mailto:careers@synetec.co.uk\"\u003ecareers@synetec.co.uk\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b43b37c9816051d3d87abe3af0d4bd4248df2edc/SYN-RGB-Colour_Block.jpg"},{"id":"c25080a2-83ec-4f62-bd6c-ad8c88c76b10","type":"Full Time","url":"https://jobs.github.com/positions/c25080a2-83ec-4f62-bd6c-ad8c88c76b10","created_at":"Fri Apr 09 22:40:43 UTC 2021","company":"CLMBR","company_url":"http://www.clmbr.com","location":"Denver","title":"Lead React Developer","description":"\u003cp\u003eCLMBR- Lead React Developer\u003c/p\u003e\n\u003cp\u003eDenver, CO 80206\u003c/p\u003e\n\u003cp\u003eThe Company \u0026amp; Role\u003c/p\u003e\n\u003cp\u003eWith a mission to revolutionize the climbing machine and empower every person to achieve more with greater efficiency, CLMBR has designed the most efficient, connected machine engineered with the end user in mind. CLMBR is built to support the movement the body was made for. To help you do your best work, you’ll have colleagues that are among the best in the business. They’re also people you can count on. We all support and learn from each other. We value honesty, creativity, optimism, thoughtfulness, and curiosity.\u003c/p\u003e\n\u003cp\u003eWe’re looking for a React Developer Lead who’s excited about using HTML and CSS to help build and maintain our CLMBR app ecosystem. You should be committed to doing exceptional work which, to us, means being committed to working thoughtfully, collaboratively, and accurately. You will work from our beautiful office in Cherry Creek and will collaborate with our external teams and partners.\u003c/p\u003e\n\u003cp\u003eDuties and Responsibilities:\u003c/p\u003e\n\u003cp\u003eHelping the leadership team make high-level architecture and platform decisions.\nCollaborating with multiple remote development teams working to build the CLMBR app platform.\nManaging the development roadmap and milestones.\nWorking with designers to ensure consistent structure across CLMBR products.\u003c/p\u003e\n\u003cp\u003eJob Qualifications:\u003c/p\u003e\n\u003cp\u003eAt least two years of experience building applications in React. (one year for junior)\nExperience using the Firebase platform, Firestore database, and cloud functions.\nExperience with React Native, especially building Android native modules.\nExperience working with platforms like Algolia, Mux or Segment.\nExperience working with a remote team.\nHours:\u003c/p\u003e\n\u003cp\u003e8:00 am – 8:00 p.m., Monday – Friday (or as-needed to meet requirements). This is a salary position.\u003c/p\u003e\n\u003cp\u003eAre you the person we're looking for? A resume and a cover letter are required to be considered for this position. Let us know what makes you a good fit for CLMBR in particular, and what excites you about our industry.\u003c/p\u003e\n\u003cp\u003eVisit \u003ca href=\"http://www.CLMBR.com\"\u003ewww.CLMBR.com\u003c/a\u003e to learn more about this Denver based company!\u003c/p\u003e\n\u003cp\u003eCLMBR is an equal opportunity employer.\u003c/p\u003e\n\u003cp\u003eJob Type: Full-time\u003c/p\u003e\n\u003cp\u003eBenefits:\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\u003c/p\u003e\n\u003cp\u003eSalary: $100,000 with opportunity for more based on experience\u003c/p\u003e\n\u003cp\u003eWork Remotely:\nNo\u003c/p\u003e\n\u003cp\u003eJob Type: Full-time\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:haylee@clmbr.com\"\u003ehaylee@clmbr.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6864b79a3a3687c7070833b0ae171ada2dcf40e9/CLMBR_LOGO_BLACK.png"},{"id":"dbe48cc7-4dcd-46dd-aa3b-08b03a16ee59","type":"Full Time","url":"https://jobs.github.com/positions/dbe48cc7-4dcd-46dd-aa3b-08b03a16ee59","created_at":"Fri Apr 09 19:32:18 UTC 2021","company":"Mindgrub","company_url":"https://www.mindgrub.com/careers/javascript-engineer","location":"Baltimore, MD or Remote","title":"JavaScript Engineer ","description":"\u003cp\u003eBased in Baltimore, Mindgrub sits at the crux of business and technology. With in-house design, marketing, project management, strategy, and engineering expertise, we tackle projects from mobile, to web, VR, marketing, and robotics, and we don’t shy away from a challenge.\u003c/p\u003e\n\u003cp\u003eWe produce award winning, end-to-end marketing and technology solutions for Fortune 100 companies, educational institutions, healthcare organizations, non-profits and start-ups. Mindgrub is a member of the Inc. 5000 Hall of Fame and was voted one of Inc. Magazine’s Best Workplaces.\u003c/p\u003e\n\u003cp\u003eWho you are\nAs a JavaScript Engineer, you are an open source enthusiast and very proficient with server side technologies, especially NodeJS.\u003c/p\u003e\n\u003cp\u003eResponsibilities\nDesign, develop, and maintain solutions for Mindgrub’s internal and external clients\nParticipate in all steps of the Agile process including Sprint Planning, Sprint Review, Sprint Retrospective, and Daily Scrum\nThoroughly test through both automated and manual means all code to prove its effectiveness\nCollaborate and help team members by sharing knowledge and combining brainpower to solve problems\nLook for ways to improve processes and functionality to further deliver increased value to Mindgrub’s clients\u003c/p\u003e\n\u003cp\u003eRequirements:\nExperience leveraging NodeJS to produce performant, scalable, and reliable API's or GraphQL\nProfessional experience with Git (or similar source control management)\nNice to haves: Typescript, Microsoft Azure experience\u003c/p\u003e\n\u003cp\u003eEducation \u0026amp; Experience\nBachelor’s degree in computer science preferred, not required with relevant experience\n4+ years of experience in a prior software engineering role including interactions with non-technical stakeholders\nActive GitHub profile preferred\nReact/Ember/Angular experience preferred, but not necessary\nMicrosoft Azure certification preferred\u003c/p\u003e\n\u003cp\u003eBenefits + Comments:\nThe position will allow you to work remotely, on-site in our Baltimore office, or on client offices (when/if they re-open) and will require you to manage multiple tasks while delivering projects on-time and on-budget. Some client travel may be required.\nThis is a full-time position. Contractors should not apply\nMindgrub’s office is dog-friendly\nExcellent benefits package that includes medical, dental, vision, 401(k), transportation subsidy, and more\nAnnual training budget dedicated to your professional development\nA flexible schedule\nA variety of fun Mindgrub hosted events (e.g. Adventure club, O’s games, Happy Hours, and more)\u003c/p\u003e\n\u003cp\u003eNo phone calls or recruiters, please.\u003c/p\u003e\n\u003cp\u003eDo you think you have what it takes? If so, we want to meet you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply at:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.mindgrub.com/careers/javascript-engineer\"\u003ehttps://www.mindgrub.com/careers/javascript-engineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--559e555eb4eabbdd7326de5df54578677ba143e9/mg_bulb_white%20background.jpg"},{"id":"a0fe7c9a-ef7b-4c6d-90e8-1ae3962f66c8","type":"Full Time","url":"https://jobs.github.com/positions/a0fe7c9a-ef7b-4c6d-90e8-1ae3962f66c8","created_at":"Fri Apr 09 18:54:53 UTC 2021","company":"Keeper Tax","company_url":"https://www.keepertax.com/","location":"San Francisco","title":"Engineer #3 at Series A YC startup","description":"\u003cp\u003eKeeper Tax is looking for engineer #3 to help us automate taxes for freelancers.\u003c/p\u003e\n\u003ch2\u003eWhy should you join Keeper Tax?\u003c/h2\u003e\n\u003cp\u003e60M people in the US (over 50% of Gen Z workers) receive 1099 income. While they might not think of themselves as business owners, the IRS expects them to make quarterly tax payments, track mileage, and more. Keeper Tax automates all that accounting grunt work, freeing freelancers to devote more time to their business.\u003c/p\u003e\n\u003ch2\u003eAbout you\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eYou want to build stuff with React Native, Node, and Python\u003c/strong\u003e - You'll be working on our mobile app (React Native), our tax filing system (Node), and our data processing platform (Python + SQL). We don't have a lot of process, and believe it's more valuable to get something out the door than to spend a lot of time perfecting it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou want to make something great for the customer\u003c/strong\u003e - Engineers are a core part of product planning, and review user recordings and analytics on a weekly basis alongside PM and data. We're looking for proto-founders who care more about the customer experience than the technology being used.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou want to work on a small team and have a high impact\u003c/strong\u003e - You'll be joining a small team (2 founders + 2 engineers). We all live in San Francisco, and are planning to work out of our SF office once everyone is vaccinated. We highly value working as a team, celebrating our successes collectively, and being both open and respectful in our communication.\u003c/p\u003e\n\u003ch2\u003eBenefits\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eHealth, dental, and vision\u003c/li\u003e\n\u003cli\u003eWe subscribe to the No rules, rules! mantra. Each employee gets a personal spending card - whether it's lunch on a workday, a new monitor, or an external consultant, you should get yourself whatever you need.\u003c/li\u003e\n\u003cli\u003eUnlimited PTO\u003c/li\u003e\n\u003cli\u003eVisa sponsorship\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInterview process\u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003eCall with hiring manager (30 min)\u003c/li\u003e\n\u003cli\u003eTwo coding exercises (1 hr each)\u003c/li\u003e\n\u003cli\u003eData and PM interviews (1 hr each)\u003c/li\u003e\n\u003cli\u003eTake home project (2 hours)\u003c/li\u003e\n\u003cli\u003eOnsite - meet the team (1 hour)\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003eI'm the CTO and the hiring manager for the role. If you're looking to join a small and ambitious team, and the mission resonates with you, let's chat: \u003ca href=\"https://calendly.com/matt-425/30min\"\u003ehttps://calendly.com/matt-425/30min\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2lnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cce6ad49c4cb92e1746bbd26e6a5d74915508ec0/logo.png"},{"id":"cbc784c7-13e7-4613-a965-086dc9ecbf09","type":"Full Time","url":"https://jobs.github.com/positions/cbc784c7-13e7-4613-a965-086dc9ecbf09","created_at":"Fri Apr 09 17:25:44 UTC 2021","company":"Float","company_url":"http://Float.com","location":"Remote","title":"Lead Engineer (JavaScript)","description":"\u003cp\u003e\u003cstrong\u003eDescription\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFloat is the world’s leading resource planner, helping teams at brands such as Airbnb, Buzzfeed and Ogilvy better plan and manage their time. Founded in 2011, Float is proudly self-funded, profitable and 100% remote. Our growing team of twenty-four are made up of Engineers, Product Managers, Marketing and Customer Success folks in more than eight countries.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're seeking a Lead Engineer to join a highly-skilled senior engineering team of 12 to maintain and scale a fast-growing SaaS product. The candidate will be an accomplished JavaScript programmer also experienced with development of at least one other application language in production (node.js preferred).\u003c/p\u003e\n\u003cp\u003eYou’ll take ownership of our web application, supporting large scale features, and maintain our JavaScript codebase while supporting a wide variety of technologies. You’ll have the opportunity to determine methods and approaches on new projects, coordinating closely with the Product team, CEO and CTO.\u003c/p\u003e\n\u003cp\u003eThis is a hands-on role, you’ll lead by example, setting the bar for quality, and use both code reviews and peer reviews as an opportunity to help drive improvement across the organisation. There are growth opportunities along both Principal and Manager paths.\u003c/p\u003e\n\u003cp\u003eYou should be familiar with modern microservice development and its associated benefits (and challenges) in creating stable, performant, rapidly deployable services.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone who is passionate about developing applications that communicate through elegantly designed, well-defined systems. You’re a great communicator, naturally curious and comfortable diving in and helping out without ego. You recognize the importance of just-enough documentation, in a growing team. You have strong experience in a collaborative environment working with web applications, preferably B2B SaaS apps.\u003c/p\u003e\n\u003cp\u003eYou consider yourself highly proficient in:\u003c/p\u003e\n\u003cp\u003eArchitecting and implementing interactive features (e.g. drag + drop, resizing) in React on both DOM and SVG elements\nJavaScript - React.js + Redux development\nModern ECMAScript Standards\nHTML5 and CSS\nFront-end build and test tools (npm, yarn, webpack, babel, jest, puppeteer)\nSource control workflow, Git/GitFlow\nOptimizing client and browser performance (profiling and tweaking rendering and data pipelines)\nMySQL relational database including optimizing SQL queries for web applications\nDeveloping integrations with third-party APIs\u003c/p\u003e\n\u003cp\u003eYou should have some experience ideally with:\u003c/p\u003e\n\u003cp\u003eMicroservice-based architecture in production\nSoftware containerization (Docker, Kubernetes) and serverless computing\nExperience with CircleCI, Jenkins and/or similar CI/CD applications\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe salary range for this role is US $120-$145K.\u003c/p\u003e\n\u003cp\u003eWe have a range of expanding and improving benefits and perks including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHome office expense budget: We help you kickstart or upgrade your home office setup.\u003c/li\u003e\n\u003cli\u003eCo-working expense budget: A budget for when you'd like to work out of home.\u003c/li\u003e\n\u003cli\u003eAnnual team meetup: We get together as a full team every year, the last two were in Athens and Lisbon. We will continue this tradition when the time is right.\u003c/li\u003e\n\u003cli\u003eCare for your community. Two days a year for you to support with your time, or donate with your wage, for a local charity of your choosing.\u003c/li\u003e\n\u003cli\u003eTeam liquidity pool: Rewarding our team if there's ever an exit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you’re in the US, we pay 50% of your medical, dental \u0026amp; vision coverage, including partners and children.\u003c/p\u003e\n\u003cp\u003eWe encourage people of different locations, backgrounds and perspectives. We are a US-based company, if you are outside the US, you’ll be hired as a contractor.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Process\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe post will be open until April 26th, 2021. We will be in touch with eligible candidates starting the week of April 12th.\u003c/p\u003e\n\u003cp\u003eFor more information on our interview process and what it’s like to join our global team, visit our Float \u003ca href=\"https://www.float.com/careers\"\u003ecareers page\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor the best advice on submitting a successful application, check out our \u003ca href=\"https://www.float.com/blog/applying-for-a-remote-job/\"\u003eCEO’s post on top tips for applying for a role at Float\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe appreciate the time and energy that goes into crafting a job application, unfortunately, we are unable to provide individual feedback during the application stage due to the volume of applications we receive.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eComplete application at \u003ca href=\"https://apply.workable.com/floatjobs/j/F87896F8D7/\"\u003ehttps://apply.workable.com/floatjobs/j/F87896F8D7/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0tnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aed7377b7e27c71d2ce0314c4fa1b8cfa4045597/avatar-blue-on-white%20(2).png"},{"id":"57421ac1-46cf-4fe1-b486-c7fd74f946d9","type":"Full Time","url":"https://jobs.github.com/positions/57421ac1-46cf-4fe1-b486-c7fd74f946d9","created_at":"Fri Apr 09 14:21:28 UTC 2021","company":"emax digital GmbH","company_url":"https://www.emax-digital.com/","location":"Munich","title":"Fullstack Engineer - Focus: Backend","description":"\u003cp\u003eWe are emax.digital Big Data analytics start-up from Munich.\u003c/p\u003e\n\u003cp\u003eWe develop AI-based software, and help brands sell even more successfully on Amazon \u0026amp; Co. thanks to smart technology and years of Amazon, Analytics \u0026amp; Tech experience of the three founders Andreas, Dimitri and Dominik.\u003c/p\u003e\n\u003cp\u003eAs former Amazon executives we understand the complexity brands are facing in fast-paced digital environments. For 12+ years we worked closely with leading brands and manufacturers across the EU and US and developed successful e-commerce strategies for multiple verticals. We founded emax.digital to help brands excel in e-commerce through smart tools, retail excellence and the right mix of marketing \u0026amp; activation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExtend and improve our scalable, microservice-based backend that collects and streams data from APIs and crawlers.\u003c/li\u003e\n\u003cli\u003eCreate beautiful dashboards with the help of Designers \u0026amp; Product Owners.\u003c/li\u003e\n\u003cli\u003eBe part of the full CI/CD process and develop new features from scratch to deployment.\u003c/li\u003e\n\u003cli\u003eContinuously improve our application with the help of state-of-the-art technologies.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in IT or comparable education.\u003c/li\u003e\n\u003cli\u003eYou love to keep up with the latest technologies.\u003c/li\u003e\n\u003cli\u003eExperienced in working with OOP and TypeScript based frameworks like NestJS.\u003c/li\u003e\n\u003cli\u003eAt least three years working experience with Node.js.\u003c/li\u003e\n\u003cli\u003eExperienced with at least one frontend framework, ideally React.\u003c/li\u003e\n\u003cli\u003eSolid experience with Databases, ideally PosgreSQL/Redshift and MongoDB.\u003c/li\u003e\n\u003cli\u003eFluent in English (additional languages are a plus).\u003c/li\u003e\n\u003cli\u003eYou are open to give and receive feedback and strive to improve.\u003c/li\u003e\n\u003cli\u003eYou are a team player and love the challenge of complex projects.\u003c/li\u003e\n\u003cli\u003eIdeally you have already worked with message brokers like RabbitMQ and data streaming frameworks like Flink.\u003c/li\u003e\n\u003cli\u003eIdeally you have experience in using Docker and Kubernetes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA fast-growing data analytics start-up where you can take on responsibility from the very beginning and leave your footprint starting at day one.\u003c/li\u003e\n\u003cli\u003eGet insights into all areas of our big data project that uses the most recent technologies and approaches.\u003c/li\u003e\n\u003cli\u003eYou work closely with the founder team and be part of the development of the product.\u003c/li\u003e\n\u003cli\u003eYou work together with a team that is passionate about technology.\u003c/li\u003e\n\u003cli\u003eLaptop and operating system of your choice.\u003c/li\u003e\n\u003cli\u003eClose collaboration and direct feedback from leading brands, agencies and other start-ups.\u003c/li\u003e\n\u003cli\u003eWork from home and flexible working hours.\u003c/li\u003e\n\u003cli\u003ePlay with our office dog.\u003c/li\u003e\n\u003cli\u003eYou will gain deep insights into the DNA of the most successful e-commerce players (Amazon \u0026amp; Co.).\u003c/li\u003e\n\u003cli\u003eOur office in the heart of Munich offers a warm, family-like atmosphere amongst other start-up companies (incl. team events, Ping Pong and foosball matches).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/87d72bd2aba808b50b02cc35bd10f57c777cb0ca/68747470733a2f2f742e676f686972696e672e636f6d2f682f35633931613362326638306565333362646135663536656366656436363762326532623234303130326338633536333065623632346463383933623236373564\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/bc68b498284d1e53f04147af54de83d659846321b389cf318864722e3ba2d1e7\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaitnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--40758307c2d0f30e542e3a4cfe36311e87b8ba25/emax%20digital%20GmbH.png"},{"id":"082b8d8c-76b8-4b5c-b640-e54bca4b18b7","type":"Full Time","url":"https://jobs.github.com/positions/082b8d8c-76b8-4b5c-b640-e54bca4b18b7","created_at":"Fri Apr 09 14:19:58 UTC 2021","company":"Scrum Inc.","company_url":"https://scruminc.com","location":"Remote","title":"Senior Full Stack Developer","description":"\u003cp\u003eOur mission at Scrum Inc. is to fundamentally change the way the world gets work done. We provide training, consulting, and coaching to help companies create more productive and happier workplaces. Our clients range from start-ups to Fortune 100 companies who use Scrum to reinvent the way they deliver products, shape their organization, and drive stakeholder value.\u003c/p\u003e\n\u003cp\u003eWe’re seeking a Sr. Full Stack Developer to evolve our learning management system (LMS) and architect innovative solutions to support our business objectives and customers as we grow. Our Agile Education LMS is where instructors from all over the world can list Scrum courses, and where students can register for those courses, interact with trainers, consume online educational content and more. Our company is growing and this position will have a direct impact and influence on the continued success of our business. This is a 90-day temporary-to-hire position with the goal of bringing the right candidate on full-time.\u003c/p\u003e\n\u003cp\u003eYou have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA love of code and test-driven development\u003c/li\u003e\n\u003cli\u003eA mindset consistent with the core Scrum Values: openness, courage, respect, focus, commitment\u003c/li\u003e\n\u003cli\u003e4 years of full-stack software development with depth and breadth of experience including expertise in both frontend and backend development:\n\u003cul\u003e\n\u003cli\u003eReact (with Redux), Node.js (with Express)\u003c/li\u003e\n\u003cli\u003eAWS, Google Cloud\u003c/li\u003e\n\u003cli\u003eHTML5, CSS3, AJAX, JS\u003c/li\u003e\n\u003cli\u003eMongoDB\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eExperience with information security best practices\u003c/li\u003e\n\u003cli\u003eThoughtful communication skills; you can explain anything to anyone\u003c/li\u003e\n\u003cli\u003eA desire to mentor and pair with fellow developers\u003c/li\u003e\n\u003cli\u003eHigh energy and a desire to work on a collaborative team\u003c/li\u003e\n\u003cli\u003eA commitment to continuous improvement\u003c/li\u003e\n\u003cli\u003eA drive to build something inspiring and lasting\u003c/li\u003e\n\u003cli\u003ePassion for finding performant, responsive solutions to challenging problems and learning new things\u003c/li\u003e\n\u003cli\u003eA desire and ability to be in the driver’s seat when it comes to technical solutions and decision making\u003c/li\u003e\n\u003cli\u003eMust be eligible to work in the U.S.\u003c/li\u003e\n\u003cli\u003eBonus if you have experience with Automated CI/CD and have experience growing jr. developers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIn this role you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a member of an amazing, cross-functional Scrum Team: Product Owner, Scrum Master, Developers, Marketing, Program Management and Operations.\u003c/li\u003e\n\u003cli\u003eMentor fellow developers and other team members.\u003c/li\u003e\n\u003cli\u003eWork on an agile learning management system and community platform.\u003c/li\u003e\n\u003cli\u003eArchitect new solutions to solve business and customer problems.\u003c/li\u003e\n\u003cli\u003eDevelop and maintain products deployed on AWS cloud services.\u003c/li\u003e\n\u003cli\u003eResearch, design and implement new features and functionalities for our platform.\u003c/li\u003e\n\u003cli\u003eTroubleshoot issues, fix bugs, and respond to support requests.\u003c/li\u003e\n\u003cli\u003eLearn a lot and have the ability to make significant contributions.\u003c/li\u003e\n\u003cli\u003eHelp us write the next chapters of our story…\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpportunities to work with the best, most experienced Scrum teams on the planet at the company founded by Dr. Jeff Sutherland, the co-creator of Scrum\u003c/li\u003e\n\u003cli\u003eA work environment that combines the best aspects of collaboration, autonomy, and diversity\u003c/li\u003e\n\u003cli\u003eMeaningful work and an opportunity to make a big impact at a small, family-owned company\u003c/li\u003e\n\u003cli\u003eA rapidly growing company that is continuously looking to evolve\u003c/li\u003e\n\u003cli\u003eGenerous pay and benefits (full health and dental, unlimited vacation, retirement plan, etc.), professional development opportunities, and company-based profit sharing\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHow we work:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe do Scrum. We strive to live the Scrum values and to continuously improve as individuals, as teams and as a company.\u003c/li\u003e\n\u003cli\u003eWe work from anywhere and everywhere.  Our web team is six people in 5 different states.  Our main office is in Boston, but you are welcome to work from home, or in the office as you like.  Once every 3 months, we get together, in person, as a company for a 2-day quarterly gathering (dependent on travel guidelines).\u003c/li\u003e\n\u003cli\u003eWe work collaboratively.  We encourage pairing and knowledge sharing via tools like zoom, slack, and Mural.\u003c/li\u003e\n\u003cli\u003eWe value happiness.  We view the happiness of our team members as the primary leading indicator of team performance and prioritize it accordingly\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we would do together:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe’ll evolve our learning management platform and practices\u003c/li\u003e\n\u003cli\u003eSupport our customers\u003c/li\u003e\n\u003cli\u003eArchitect solutions for existing and emerging business problems\u003c/li\u003e\n\u003cli\u003eImprove our test coverage\u003c/li\u003e\n\u003cli\u003eAssess if we have a mutually beneficial relationship that we’d like to continue\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Scrum Inc.’s Education Business\u003c/p\u003e\n\u003cp\u003eWe incubate new curriculum to meet the needs of industry and then ensure maximum impact and access by distributing that curriculum through our network of Agile Education Trainers. We accomplish this through two fundamental value streams: teaching courses to upskill or reskill professionals and professional credentialing.\u003c/p\u003e\n\u003cp\u003eAbout Scrum Inc.\u003c/p\u003e\n\u003cp\u003eOur mission at Scrum Inc. is three fold: to fundamentally change the way the world works, to continue the evolution of scrum, and be a model for how work should be. Our clients range from start-ups to Fortune 500 companies who use Scrum to reinvent the way they deliver products, shape their organization, and drive stakeholder value.\u003c/p\u003e\n\u003cp\u003eAt Scrum Inc., we give our clients the ability to get results and drive performance at speeds they never thought possible. We give them the tools to be able to deliver twice the work in half the time. And with every client we work with, we learn something about how Scrum fundamentally changes their way of working. We use that knowledge to evolve scrum and advance agile practices around the globe.\u003c/p\u003e\n\u003cp\u003eWe do this in various ways such as training, consulting, and credentialing, but also through online courses, articles, books, and videos. Through our thought leadership we create productive and happy workplaces throughout the world.\u003c/p\u003e\n\u003cp\u003eScrum, Inc is an Equal Opportunity Employer and is committed to diversity. Our goal as a company is to help the entire world work better across cultures, countries, and industries. As a company, we believe that creating an open and inclusive environment that is welcoming to all is a key to achieving that goal.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email the following to \u003ca href=\"mailto:education@scruminc.com\"\u003eeducation@scruminc.com\u003c/a\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eAn example of a website / web application that you’ve built with a brief summary of the technology used, any specific technological challenges that you encountered and how you overcame them.\u003c/li\u003e\n\u003cli\u003eAn example of an algorithm that you’ve written that you are particularly proud of and brief commentary on why it’s awesome\u003c/li\u003e\n\u003cli\u003eA resume\u003c/li\u003e\n\u003c/ol\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e10e568a0420ab4a9bf1a04f2bdfc24555e8de31/logo_scruminc-w-tagline.png"},{"id":"2781cba8-a6d6-44f2-82c6-dacc2623d592","type":"Full Time","url":"https://jobs.github.com/positions/2781cba8-a6d6-44f2-82c6-dacc2623d592","created_at":"Fri Apr 09 14:02:45 UTC 2021","company":"Technische Universiteit Eindhoven (TU/e)","company_url":"http://www.tue.nl","location":"Eindhoven","title":".NET Developer","description":"\u003cp\u003eTU Eindhoven is op zoek naar een\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e.NET Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFunctieomschrijving:\u003c/strong\u003e\nAls ICT’er groter worden dan jezelf, in je vak en als persoon. Dat kan alleen als je iedere dag wordt uitgedaagd. Op de TU/e worden studenten en wetenschappers in staat gesteld het ondenkbare te creëren. Hierbij is de kracht van het IT-landschap succesbepalend en dus ben jij dat ook. De knapste koppen verwachten dat je met ze meedenkt en hen morgen een oplossing biedt die je vandaag nog niet kent. Samen bouwen we aan de digitale backbone waar dit epicentrum van wetenschap en technologie om vraagt.\u003c/p\u003e\n\u003cp\u003eBen jij een .NET Developer met affiniteit voor applicatie-integratie en die de finesses van het ICT-vakgebied kent? Ben je op zoek naar een uitdaging, waar je gaat werken in een innovatieve, dynamische omgeving, met complexe ICT infrastructuur en (onderzoeks)projecten? Heb je ruime ervaring met .NET, WCF SOAP, REST services,  XML en JSON, alsmede SQL (Oracle en MS SQL) en Visual Studio en Team Foundation Server? Dan ben jij misschien wel de ambitieuze, veelzijdige ICT professional die wij zoeken!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOver de functie van .NET Developer:\u003c/strong\u003e\nAls .NET Developer ben je verantwoordelijk voor het ontwerp en de innovatie van TU/e middleware en de realisatie hiervan. Naast de rol van ontwikkelaar ben je, samen met een team collega's, verantwoordelijk voor het beheren en up to date houden van het bestaande integratielandschap. Je ontwikkelt en ontwerpt producten in overleg met Diensten en Faculteiten op het gebied van bedrijfsvoering, onderwijs en onderzoek. Je participeert in grotere projecten als .NET Developer. Daarnaast volgt de TU/e de transitie naar Azure Cloud op de voet. Kennis van BizTalk 2016 en Azure Integration Services (API Management, Service Bus, Event Grid, Event Hub, Azure Functions, Logic Apps) is een pré. Daarnaast worden in 2021 de eerste stappen gezet richting Azure om te migreren richting een hybride integratieplatform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben je?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe hebt HBO werk en denkniveau;\u003c/li\u003e\n\u003cli\u003eJe hebt ruime ervaring met .NET;\u003c/li\u003e\n\u003cli\u003eJe bent in staat om zelfstandig een technisch ontwerp te vertalen naar realisatie (conform standaard en richtlijnen);\u003c/li\u003e\n\u003cli\u003eJe kunt de opgeleverde oplossing documenteren en overdragen;\u003c/li\u003e\n\u003cli\u003eJe bent bekend met Domain Driven Development;\u003c/li\u003e\n\u003cli\u003eJe bent resultaatgericht en teamspeler;\u003c/li\u003e\n\u003cli\u003eVerder ben je gemotiveerd om jezelf te ontwikkelen tot expert in BizTalk.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat biedt TU Eindhoven jou?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen dynamische werkomgeving met een uitdagend werkpakket en ontwikkelmogelijkheden;\u003c/li\u003e\n\u003cli\u003eEen salaris afhankelijk van kennis en ervaring van minimaal €2.790,- en maximaal €4.402- (salarisschaal 10) bruto per maand bij een voltijdse aanstelling conform CAO Nederlandse Universiteiten;\u003c/li\u003e\n\u003cli\u003eDaarnaast biedt de TU/e aantrekkelijke secundaire arbeidsvoorwaarden, waaronder 41 vakantiedagen (bij een fulltime aanstelling) een eindejaarsuitkering ter hoogte van 8,3% van het jaarsalaris (overeenkomend met een maandsalaris), een vakantie-uitkering ter hoogte van 8% van het jaarsalaris en uitstekende sportfaciliteiten;\u003c/li\u003e\n\u003cli\u003eHet betreft in eerste instantie een dienstverband voor de periode van één jaar. Bij gebleken geschiktheid behoort uitzicht op een vast dienstverband tot de mogelijkheden. Overwogen kan worden de aanstelling via Euflex te laten verlopen, de detacheringsorganisatie van de TU/e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInformatie:\u003c/strong\u003e\nHeb je vragen naar aanleiding van deze vacature, neem dan contact op met Elly van den Eertwegh, recruiter; \u003ca href=\"e.a.m.v.d.eertwegh@tue.nl\"\u003ee.a.m.v.d.eertwegh@tue.nl\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eReageer op deze vacature middels onderstaande \u003ca href=\"https://jobs.tue.nl/nl/vacature/net-developer-873138.html?utm_source=github\u0026amp;utm_medium=referral\u0026amp;utm_term=2021\u0026amp;utm_content=184239\u0026amp;utm_campaign=net-developer\"\u003esollicitatiebutton\u003c/a\u003e. Wij reageren niet op sollicitaties die op een andere manier bij ons terecht komen. Voor deze vacature wordt gelijktijdig intern en extern geworven. Bij gelijke geschiktheid gaan interne kandidaten voor op externe kandidaten.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTrefwoorden: Developer, IT Developer, .NET, Applicatieontwikkeling, ICT, WCF SOAP, REST services, XML, SQL\u003c/em\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamVnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c9668c90832cdc80f7ab9f1330d2dda7fc1ecef6/Logo%202018.jpg"},{"id":"4e662af0-5c4c-4b30-b017-caf5c5a4b763","type":"Full Time","url":"https://jobs.github.com/positions/4e662af0-5c4c-4b30-b017-caf5c5a4b763","created_at":"Fri Apr 09 13:28:50 UTC 2021","company":"Bring! Labs AG","company_url":"https://www.getbring.com/en/home","location":"Zürich, Zurich","title":"Senior Android Engineer, Zurich, 100% (m,w,d)","description":"\u003cp\u003eBring! – The perfect shopping companion\u003c/p\u003e\n\u003cp\u003eOur vision at Bring! is to simplify grocery shopping for people around the world. Our Bring! app is used in millions of households to organize daily shopping, discover new delicious recipes and find the best local deals.\u003c/p\u003e\n\u003cp\u003eWe help brands and retailers reach their customers\u003c/p\u003e\n\u003cp\u003eWe help our partners from FMCG and retail to reach out to their existing and future customers. We provide them with the most relevant advertising platform to showcase and promote their products at the right time: during the planning and execution of their household shopping.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs an Android Engineer you will have the unique opportunity to join us in a strong growth phase and be responsible for all Android-related topics. In doing so, you will report directly to the CTO. The role includes the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are responsible for the Bring! Android application\u003c/li\u003e\n\u003cli\u003eYou implement new features, do code reviews, help improving the overall architecture and work with our UX team\u003c/li\u003e\n\u003cli\u003eYou support the team on requirement engineering and testing\u003c/li\u003e\n\u003cli\u003eYou are an active part of the engineering team and as such help improving our engineering process\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Bring! we have high ambitions and the vision to change the way our customers communicate with consumers. To meet our expectations, your skills and experience should be as follows:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are currently working on larger Android application(s) from their development until their release\u003c/li\u003e\n\u003cli\u003eYou have an extensive understanding of Android framework components and the capabilities of different Android API levels\u003c/li\u003e\n\u003cli\u003eYou have strong computer science fundamentals in the topics: data structures, clean architectures, algorithms and automated testing\u003c/li\u003e\n\u003cli\u003eYou are fluent in Kotlin and Java\u003c/li\u003e\n\u003cli\u003eYou are experienced with the Android tool ecosystem for development, testing, debugging, and performance benchmarking (Android Studio, Git, Gradle, Jenkins) including Google Play Console and preferably also Firebase\u003c/li\u003e\n\u003cli\u003eYou have experience with common Android libraries like Retrofit, RxJava, Google Play Services, Android Jetpack\u003c/li\u003e\n\u003cli\u003eYou are experienced in client-server architectures and you are able to take a generalist view on the whole platform\u003c/li\u003e\n\u003cli\u003eYou live in Switzerland or Germany\u003c/li\u003e\n\u003cli\u003eRemote work possible\u003c/li\u003e\n\u003cli\u003eYou are fluent in both written and spoken English, it's a bonus if you speak German\u003c/li\u003e\n\u003cli\u003eIt’s a bonus if you also have experience with Android Wear and if you’ve contributed to open-source projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur mission at Bring! is to provide an open work culture that welcomes different perspectives and backgrounds. In addition to an attractive and modern working environment in the heart of Zürich or Berlin, we offer you a competitive compensation package with many perks \u0026amp; benefits. You will enjoy a high degree of work freedom with flexible working hours and the possibility of remote work. Bring! was named \"No. 1 Online Startup\" in Switzerland by the \"Top 100 Startups\" in 2020.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou want to become part of our team?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eClick on “Apply now”! We look forward hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://bring.join.com/jobs/2107698-senior-android-engineer-zurich-100-m-w-d?pid=757e7cf81db3118dbbf1\u0026amp;oid=337fac70-c293-4820-94a7-66c53a5f1e67\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bandroid%2Bengineer%2Bzurich%2B100%2Bm%2Bw%2Bd\"\u003ehttps://bring.join.com/jobs/2107698-senior-android-engineer-zurich-100-m-w-d?pid=757e7cf81db3118dbbf1\u0026amp;oid=337fac70-c293-4820-94a7-66c53a5f1e67\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bandroid%2Bengineer%2Bzurich%2B100%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaldnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d9a1e23e0f673fcfe0fa0c12c5f797741c8b01c2/bring.png"},{"id":"c7e94634-0bfb-4d56-bc07-55cb73c80e30","type":"Full Time","url":"https://jobs.github.com/positions/c7e94634-0bfb-4d56-bc07-55cb73c80e30","created_at":"Fri Apr 09 13:09:21 UTC 2021","company":"DynamicElement AG","company_url":"https://dynamicelement.com/","location":"Remote","title":"Technical Lead","description":"\u003cp\u003eDie DynamicElement AG wurde 2018 von Prof. Dr. Jörg Eberhardt (RWU) und Friedrich Kisters gegründet. DynamicElement identifiziert und unterscheidet gleichartige Produkte durch ihre charakteristischen Produktoberflächen. Barcodes oder andere Markierungen werden nicht benötigt. Jedes Produkt besitzt einen eindeutigen Fingerabdruck, der die Oberflächen des Produkts und dessen dynamische Veränderung über die Zeit beschreibt. Dieser Fingerabdruck wird Multi-Dimensional Dynamic Identity (MDDI) genannt.\u003c/p\u003e\n\u003cp\u003eAls Teil von DynamicElement erwarten dich spannende Aufgaben und die Möglichkeit unser Unternehmen aktiv mitzugestalten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDas sind Deine Aufgaben:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu bist im engen Austausch mit unserem CTO und arbeitest an der Architektur unseres Produkts.\u003c/li\u003e\n\u003cli\u003eAls Teil unseres internationalen Entwicklungsteams baust du komplexe und skalierbare Lösungen und bist in jedem Schritt des Product Lifecycle mit dabei (design, build, run).\u003c/li\u003e\n\u003cli\u003eNach deiner Einarbeitung baust du unser bestehendes Entwicklungsteam aus und leitest dieses an.\u003c/li\u003e\n\u003cli\u003eDu gestaltest aktiv unseren agilen Entwicklungsprozess mit.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas ist dein Profil:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu weißt, wie eine SaaS Business Anwendung in Produktion betrieben wird.\u003c/li\u003e\n\u003cli\u003eDu verfügst über sehr gute C++ Kenntnisse.\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrung im Bereich Cloud-basierter Services\u003c/li\u003e\n\u003cli\u003eDu hast Interesse an Künstlicher Intelligenz und Bildverarbeitung\u003c/li\u003e\n\u003cli\u003eClean Code und Qualität sind dir wichtig und lebst du täglich vor.\u003c/li\u003e\n\u003cli\u003eDir ist gute Kommunikation wichtig.\u003c/li\u003e\n\u003cli\u003eDu hast sehr gute Deutsch- und Englischkenntnisse.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eMindset:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast Lust etwas zu bewegen und Verantwortung zu übernehmen.\u003c/li\u003e\n\u003cli\u003eWir bauen gleichzeitig unser Produkt und unser Startup auf - Ein agiles Mindset und kontinuierliche Verbesserungen sind genau deins.\u003c/li\u003e\n\u003cli\u003eDu bist in einem wachsenden Team ohne starre Rollen stets offen für neue Aufgaben.\u003c/li\u003e\n\u003cli\u003eDu bist ein Problemlöser und gehst proaktiv voran.\u003c/li\u003e\n\u003cli\u003eDu bist offen für Feedback.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eTech Stack:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAWS (EC2)\u003c/li\u003e\n\u003cli\u003egRPC\u003c/li\u003e\n\u003cli\u003eKubernets\u003c/li\u003e\n\u003cli\u003eC++\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003cli\u003eGitLab\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWir bieten:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSpannende und herausfordernde Aufgaben\u003c/li\u003e\n\u003cli\u003eMitgestaltung - Wir sind derzeit im am Aufbau des Startups sowie unseres Produkts. Jeder kann Verantwortung übernehmen und die Unternehmenskultur mitgestalten.\nAgile Arbeitsumgebung\u003c/li\u003e\n\u003cli\u003eFlexibilität - Wir bieten flexible Arbeitszeiten und Homeoffice\u003c/li\u003e\n\u003cli\u003eArbeitsplatz - Du kannst dir deine Hardware selbst raussuchen\u003c/li\u003e\n\u003cli\u003eWir freuen uns auf Deine Bewerbung mit Angabe des möglichen Eintrittstermins und Deiner Gehaltsvorstellung.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://dynamicelement.join.com/jobs/2074531-technical-lead?pid=357a3b4531918760973f\u0026amp;oid=dde7e42b-1e30-4eac-8e68-980e6b99d88a\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=technical%2Blead\"\u003ehttps://dynamicelement.join.com/jobs/2074531-technical-lead?pid=357a3b4531918760973f\u0026amp;oid=dde7e42b-1e30-4eac-8e68-980e6b99d88a\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=technical%2Blead\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBak9nIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9e74e41985b1dd60060b9cdc1ed294916f153d3/dynamic%20elelement.jpg"},{"id":"c6ff6491-6e05-4020-af5e-72d5bdff94a5","type":"Full Time","url":"https://jobs.github.com/positions/c6ff6491-6e05-4020-af5e-72d5bdff94a5","created_at":"Fri Apr 09 12:55:22 UTC 2021","company":"deepset ","company_url":"http://www.deepset.ai","location":"Berlin / Remote (Europe)","title":"Senior Python Engineer","description":"\u003cp\u003e\u003cstrong\u003eDescription\u003c/strong\u003e\nAs a Senior Python Engineer (m/f/x) you will work on making neural search scalable and accessible for enterprises all around the world. You will improve our open-source framework Haystack to make it more developer-friendly, extend it's functionality and improve the scalability.\nYou will join us in building \u0026amp; shaping \"Haystack Hub\" a cloud-based SaaS product to facilitate neural search for our enterprise clients.\u003c/p\u003e\n\u003cp\u003eExamples: Integrate a FAISS backend in Haystack; Efficient distribution of requests in the REST API across workers; Interact with our GitHub Community to implement a feature request\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eConceptualize \u0026amp; implement new features for our open-source framework Haystack\u003c/li\u003e\n\u003cli\u003eImprove \u0026amp; shape the architecture of Haystack\u003c/li\u003e\n\u003cli\u003eInteract with our GitHub Community\u003c/li\u003e\n\u003cli\u003eWork closely with our ML Engineers on integrating new ML models to improve search in a scalable way\u003c/li\u003e\n\u003cli\u003eBuild components for Haystack Hub (our Enterprise SaaS product on top of Haystack)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience of having worked in a related field\u003c/li\u003e\n\u003cli\u003eUniversity degree in Computer Science or comparable qualification\u003c/li\u003e\n\u003cli\u003eExcellent Software Engineering skills\u003c/li\u003e\n\u003cli\u003eStrong track record of designing complex software projects\u003c/li\u003e\n\u003cli\u003eIdeally: Experience in the interaction with open-source communities\u003c/li\u003e\n\u003cli\u003eExpert in Python\u003c/li\u003e\n\u003cli\u003eExperience with Git, AWS, container orchestration and deployment\u003c/li\u003e\n\u003cli\u003eExperience with Machine Learning/NLP or the motivation to learn about it\u003c/li\u003e\n\u003cli\u003ePragmatism, sense of responsibility and independent work style\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFast \u0026amp; expanding environment - Team lead possibilities, fast decisions, direct impact and flexibility\u003c/li\u003e\n\u003cli\u003eWe live and breathe open source: See Haystack, FARM, German BERT ...\u003c/li\u003e\n\u003cli\u003eLatest machine learning \u0026amp; tech - no legacies\u003c/li\u003e\n\u003cli\u003eCollaborate with tech experts - we understand your language \u0026amp; problems\u003c/li\u003e\n\u003cli\u003eWork on real world cases - no AI hype\u003c/li\u003e\n\u003cli\u003ePossibility to speak at conferences and workshops\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout deepset\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOne of the leading companies in transformer-based NLP\u003c/li\u003e\n\u003cli\u003eLiving Open Source, in products and culture\u003c/li\u003e\n\u003cli\u003eBacked by renowned and mission-driven investors from the US and Europe\u003c/li\u003e\n\u003cli\u003eSupported by strong partners like AWS and NVIDIA\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:careers@deepset.ai\"\u003ecareers@deepset.ai\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f56b04c09ae96bc357208457006fa375a3863ad/deepset_logo%20(1).png"},{"id":"87ba6229-bc94-4afb-825e-8e8a6e39e66c","type":"Full Time","url":"https://jobs.github.com/positions/87ba6229-bc94-4afb-825e-8e8a6e39e66c","created_at":"Fri Apr 09 12:16:13 UTC 2021","company":"Samskip","company_url":"https://careersatsamskip.com/","location":"Cluj-Napoca","title":"Full Stack Software Engineer","description":"\u003cp\u003e\u003cstrong\u003eBecome part of a highly professional and future-focused software development team that is integral to the success of our international transport operations\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSamskip is a large, international company that organizes thousands of transport movements every week. Our web portal acts as an essential tool that our customers (and employees) rely on to perform actions such as booking sea-freights and ordering containers. It’s a valuable 24/7 resource, run by an experienced team that is committed to the highest professional standards. If you have the skills to become part of that team as it collaborates to develop interesting IT products, read on and find out more about Samskip.\u003c/p\u003e\n\u003ch2\u003eAgile and continuous development for evolving business needs\u003c/h2\u003e\n\u003cp\u003eYou will be a part of the team that focuses on developing a Customer Portal (Service Web) whose main purpose is to enable communication between the company’s IT systems, combining their core features into a user-friendly web portal. Working with legacy systems such as ReactJS and AngularJS (maintained by Facebook) and .NET Core and ASP.NET stack (maintained by Microsoft), we deploy robust IT systems that specialize in certain domains.\u003c/p\u003e\n\u003cp\u003eThe development team strives for mature, stable development frameworks that deliver competitive software performance, eliminate the risk of failure, and ensure scalability for future developments. The team practices continuous development within an agile, modernized software environment where business needs can be solved quickly on an ongoing basis.\u003c/p\u003e\n\u003ch2\u003eFlexible, professional and organized\u003c/h2\u003e\n\u003cp\u003eAs a Full Stack Software Engineer you need the flexibility to work on specialized front- and back-end projects simultaneously. Further, you should be an organized multi-tasker who can commit to a predefined sprint plan whilst also performing hotfixes that need to be solved ASAP. We expect professional results and you must be on time for Planning-, Retro-, Daily- and Demo meetings. Your specific responsibilities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMaintaining and developing end-to-end fully scalable websites;\u003c/li\u003e\n\u003cli\u003eImplementing and documenting stable web APIs which are relied on by both internal software teams and/or 3rd parties;\u003c/li\u003e\n\u003cli\u003eImplementing professional web designs and deliver UIs that attract users;\u003c/li\u003e\n\u003cli\u003eDealing with ad-hoc requirements and/or issues with web products your team is responsible for.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eA great career in a great company\u003c/h2\u003e\n\u003cp\u003eSamskip is committed to innovating and applying sustainable and multimodal transport links across Europe. Our office in Cluj-Napoca plays an important role in this network. It’s busy, it’s fun and every day is different as you work with a diverse range of colleagues to deliver 21st century solutions for a large portfolio of well-known customers.\nMoreover, we want you to grow and thrive with us. That’s why you’ll have access wide-ranging development opportunities including training and e-learning through our Samskip Academy. And we do all to ensure that Samskip is a company where colleagues become friends. Other benefits include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA competitive compensation package;\u003c/li\u003e\n\u003cli\u003e21-25 days of annual leave;\u003c/li\u003e\n\u003cli\u003eMeal ticket;\u003c/li\u003e\n\u003cli\u003eTransportation allowance;\u003c/li\u003e\n\u003cli\u003e7Card sports subscription;\u003c/li\u003e\n\u003cli\u003eMedical insurance;\u003c/li\u003e\n\u003cli\u003eA laptop and a mobile phone.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eThis is what success looks like\u003c/h2\u003e\n\u003cp\u003eTo succeed in this role you need a solid software engineering background in both front- and back-end development. We are a Microsoft suite so .NET experience is very important. You must have a good eye for design and proven hands-on experience in modernized front-end web development with one of today’s leading web frameworks such as Angular, React, (Vue).\u003c/p\u003e\n\u003cp\u003eBeyond that, you should know your way around C#, .NET (Core vs Framework), REST, HTTP, Swagger, SQL, Angular, React and Git. Although the development team uses modernized web development tools you should be open to legacy systems such as notions like SOAP (WCF Services), FTP, IIS etc. The team focuses on deploying stable and smooth-running software that meets today’s modernized requirements, so a good understanding of an on-prem infrastructure combined with cloud infrastructure is important.\u003c/p\u003e\n\u003cp\u003eAll of this demands highly evolved critical thinking and problem-solving skills and the proven ability to quickly master new techniques within a SCRUM/Kanban Agile methodology. You will also need excellent communication and collaboration skills as you influence, negotiate and present information to engage others in our quest for framework simplicity and efficiency. The more technical requirements are:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA degree in Computer Science or similar and work experience with C# in a large-scale web application set-up;\u003c/li\u003e\n\u003cli\u003eTransport/Logistics industry experience is a plus;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of C#, .NET Core and ASP.NET. as well as excellent knowledge of software security such as basic principles of JWT, HTTPS and auth roles in .NET;\u003c/li\u003e\n\u003cli\u003eGood knowledge of a RESTful infrastructure and basic knowledge of SOAP (WCF services is a plus) and DNS set-up;\u003c/li\u003e\n\u003cli\u003eGood knowledge of HTML, CSS, SASS / LESS (experience with Tailwind is a plus), XML and JSON;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of ReactJS (experience with Redux is a plus) and basic knowledge of Angular and/or AngularJS;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of DB query languages such as Oracle SQL and MSSQL;\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of Visual Studio, Visual Studio Code, and common DB IDEs, with excellent knowledge of Git (experience with GitFlow is a plus).\u003c/li\u003e\n\u003cli\u003eBasic knowledge of cloud infrastructure and experience with CI / CD setup (experience with Microsoft Azure is a plus);\u003c/li\u003e\n\u003cli\u003eExcellent written and spoken English language skills.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eMove fast!\u003c/h2\u003e\n\u003cp\u003eDo you think you could be a great asset to Samskip based on everything you’ve read here? Don’t hang around! Click on \u003ca href=\"https://vonq.io/3d1aHiw\"\u003ethis link\u003c/a\u003e and send us your CV. If you have any questions about the vacancy feel free to call us on +31 (88) 400 13 93 or send an e-mail to: \u003ca href=\"mailto:career.management@samskip.com\"\u003ecareer.management@samskip.com\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3d1aHiw\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3fe7765b7d7c15a54b2a8a57fef42ce7ec6f6d35/Samskip.jpg"},{"id":"d208a008-65db-47e2-827e-c7d478049e51","type":"Full Time","url":"https://jobs.github.com/positions/d208a008-65db-47e2-827e-c7d478049e51","created_at":"Fri Apr 09 11:38:32 UTC 2021","company":"azeti GmbH","company_url":"https://www.azeti.net/","location":"Berlin","title":"Site Reliability Engineer (SRE)","description":"\u003cp\u003eWe are a Berlin-based IoT software company. Our IoT platform enables the simple and fast implementation of industrial IoT applications. We have been offering software \"Made in Germany\" for national and international customers since 2006. Our IoT solutions are in use in Europe, America and China. As specialists for digitization and IoT, our TÜV-certified IoT platform is already being used in a wide range of industries. Various research projects and long-term OEM partnerships in the industry underline our competence and expertise in solving the most demanding IoT projects. With our Open Source Edge Software and brand new IoT stack, we are going one step further and will make the Internet of Things possible for every business.\u003c/p\u003e\n\u003cp\u003eFor more information: \u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/2/yCAaaEOKye6AaOFK8a8elw/aHR0cDovL3d3dy5hemV0aS5uZXQ\"\u003ewww.azeti.net\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThese strange times demand a lot of everyone. \u003cstrong\u003eWe provide a secure and long-term work environment for our team and are in search for team members that add to our team for the next years to come.\u003c/strong\u003e Besides having a stable business, we are backed by the Aurubis AG and are a secure employer for your next career step.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e- Stable and secure work environment\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFlexible working hours and regards to your family matters (homeschooling, daycare, etc.)\u003c/li\u003e\n\u003cli\u003eUp to 100% Home Office possible\u003c/li\u003e\n\u003cli\u003eFree choice of hardware (Linux, Mac, Windows) and equipment for your home office\u003c/li\u003e\n\u003cli\u003eAbove-average salary and awesome career development possibilities\u003c/li\u003e\n\u003cli\u003eAgile work in a diverse international team, flat hierarchies\u003c/li\u003e\n\u003cli\u003eDirect impact in product development with immediate effect for our customer base\u003c/li\u003e\n\u003cli\u003eTop-notch technology stack with exciting developments already inline\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/3/4PAPgY7YB6hBsa8hkNHQEw/aHR0cHM6Ly9jb3Jwb3JhdGUudXJiYW5zcG9ydHNjbHViLmNvbS9lbg\"\u003eUrban Sports Club\u003c/a\u003e membership, fully paid by us\u003c/li\u003e\n\u003cli\u003eBike leasing by \u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/4/0QXls7ff2fwcXVYHLafWVw/aHR0cHM6Ly93d3cuYnVzaW5lc3NiaWtlLmRlL2Rl\"\u003ebusiness-bike\u003c/a\u003e or \u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/5/JZ683lEvrafR9HKowu2t2Q/aHR0cHM6Ly93d3cuam9icmFkLm9yZy8\"\u003ejobrad\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/6/G5H_1asp8g0XbnCRGAU7OQ/aHR0cHM6Ly93d3cuY29ycG9yYXRlLWJlbmVmaXRzLmRlLw\"\u003eCorporate Benefits Programm\u003c/a\u003e with nice discounts\u003c/li\u003e\n\u003cli\u003eContinuous learning and 100 € \u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/7/eRF2IO0Q1TDkWjifrjp4Pw/aHR0cHM6Ly93d3cudWRlbXkuY29tLw\"\u003eUdemy\u003c/a\u003e budget per month\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin our Operations team as our first Site Reliability Engineer (SRE) and help us to lift the operation of our IoT platform (multi cloud) to the next level in regards to resilience, observability, incident management and automation.\u003c/p\u003e\n\u003cp\u003eYou will take ownership of our tools for monitoring/incident management and observability and consult our engineering teams with best practices and guidance on how to build resilient modern applications.\nTogether with our Ops and DevOps engineers, you'll work on automation and extension of CI/CD pipelines.\u003c/p\u003e\n\u003cp\u003e50% of your time will be dedicated to new developments, necessary for good SRE/DevOps practices and 50% will be dedicated in our daily operations, deploying infrastructure, solving issues and participating in on-call rotation.\nThings will break and you'll support the team to facilitate post-mortem reviews and optimise our documentation. You keep a close an eye on reoccurring alerts and create runbooks for common mitigation tasks together with our engineering.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur tech stack and ongoing initiatives\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou'll join us in the midst of our migration from Docker to automated (Ansible) Kubernetes deployments (Helm) with Gitlab CI following CI/CD Best Practices. Our IoT platform is cloud-agnostic and we're running it as a service for our customers in their cloud environments (Azure, AWS). Our platform includes RDBMS, Time Series Database, Java/Kotlin and React apps plus message broker infrastructure. Our goal is to further automate all deployments with observability built into our applications and to extend resilience in our application stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour first challenge\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFacilitate a chaos test with our engineers and start a tradition of chaos engineering, so we're on top of potential weak spots and continuously improve our infrastructure and tooling.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAre you an experienced software engineer who wants to move into SRE but you don't own all required skills (see below) yet?\u003c/strong\u003e If you got the right mindset and core knowledge (patterns, methods, tooling), even though not yet applied in large scale, let's talk. SRE is a mindset and we believe that bright minds learn fast. If you're structured, a great communicator, well organised and happy to take on responsibility, then this might be your chance to move into SRE.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProfile\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou've got experience in SRE best practices and implementation of such. Incident management, observability tooling, automation with Ansible and Kubernetes are your strong fields. You have a strong mindset for collaboration and encouragement of modern SRE and DevOps best practices within teams. You communicate clearly and consult engineers in using new methods and applying patterns, i.e. chaos testing, runbooks or post mortem reviews.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkillset\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong understanding and ideally experience in SRE patterns and best practices\u003c/li\u003e\n\u003cli\u003eExperience in incident management and software observability (monitoring), Opsgenie is our tool of choice\u003c/li\u003e\n\u003cli\u003eExperience in monitoring of Kubernetes environments with Prometheus\u003c/li\u003e\n\u003cli\u003eExtensive experience in infrastructure automation with Terraform and Ansible\u003c/li\u003e\n\u003cli\u003eStrong understanding of container orchestration with Kubernetes\u003c/li\u003e\n\u003cli\u003eStrong collaboration, communication skills and structured work style\u003c/li\u003e\n\u003cli\u003eOrganised work flow that includes sharing knowledge, especially as runbooks\u003c/li\u003e\n\u003cli\u003eExperience in infrastructure operations within AWS or Azure\u003c/li\u003e\n\u003cli\u003eGood understanding of CI/CD and their respective pattern\u003c/li\u003e\n\u003cli\u003eStrong Linux \u0026amp; Networking troubleshooting skills\u003c/li\u003e\n\u003cli\u003eFluency in English, especially well-written.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThese are a plus:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExisting work permit for Europe, ideally Germany\u003c/li\u003e\n\u003cli\u003eExperience with SLI, SLO patterns for engineering teams\u003c/li\u003e\n\u003cli\u003eExperience in chaos and resilience testing for modern cloud applications\u003c/li\u003e\n\u003cli\u003eExperience with broker systems Pub/sub, i.e. VerneMQ, ActiveMQ\u003c/li\u003e\n\u003cli\u003eExperience Grafana, Fluentd and Opsgenie\u003c/li\u003e\n\u003cli\u003eExperience with Helm charts for k8s deployments\u003c/li\u003e\n\u003cli\u003eExperience with Ansible AWX\u003c/li\u003e\n\u003cli\u003eExperience in Scrum based teams and agile work\u003c/li\u003e\n\u003cli\u003eExperience in build automation for Java, Kotlin, Spring, ReactJS applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt's a plus if you live close or in Berlin. We encourage remote work but hope to meet again in our Berlin office regularly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKontakt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePlease \u003ca href=\"http://t3u1.mjt.lu/lnk/AU4AACoNluMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgcCwvC-whqNeBQUWq8Hrx6sdN8gAGCXo/8/K_YCe076CanZlG1O5cdlSQ/aHR0cHM6Ly9hemV0aS5qb2JzLnBlcnNvbmlvLmRlLz9fX2hzdGM9MTk0NzIwNzU0Ljg5OWQwYjJlNmIwZGYzNjBjZTM5Yzg4MzY3M2U0N2RkLjE2MTc4Njc1ODEzNTkuMTYxNzg2NzU4MTM1OS4xNjE3ODY3NTgxMzU5LjEmX19oc3NjPTE5NDcyMDc1NC4xLjE2MTc4Njc1ODEzNTkmX19oc2ZwPTM3MDc0MDQ0MDQmaHNDdGFUcmFja2luZz01NzczZTRhMS04MTAwLTRkMjYtYTBjZC05ZTFkMDhiMTg1MTAlN0MzYThmZWEwZi0yMDE5LTRmMjAtOWQxOC1lMDVjYjY2MTQxNzg\"\u003esubmit your application on our career page\u003c/a\u003e or send it to \u003ca href=\"mailto:career@azeti.net\"\u003ecareer@azeti.net\u003c/a\u003e Your main contact is Sebastian Koch.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/144d97f94c5841114ecfd81110c69d2aec977cbe/68747470733a2f2f742e676f686972696e672e636f6d2f682f35353733353364306263646137393034653564303461376132656234336366646538613937316265643834303163366265353363633034613635333265646339\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/2e0e97380af8ab38f0dac4a22889df3dd22941a0116952313eeaef828a5f34d4\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXVnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b46706715c7b2b083db377e7201e1fe2e11387db/azeti%20GmbH.png"},{"id":"cf249e51-79f9-4cac-a925-d587babac81e","type":"Full Time","url":"https://jobs.github.com/positions/cf249e51-79f9-4cac-a925-d587babac81e","created_at":"Wed Apr 07 18:12:18 UTC 2021","company":"Transplant Connect","company_url":"http://www.transplantconnect.com","location":"Los Angeles, CA ","title":"Software Developer","description":"\u003cp\u003eWork in an incredibly exciting field where people directly benefit from your work in a major (life-saving) way! We have an amazing team of friendly, dedicated, talented developers that keeps growing. The ideal candidate is very comfortable with the Microsoft development stack, including ASP.NET, C#, MVC and SQL. We definitely make use of many cutting-edge tools, including Visual Studio 2019, SQL Server 2019, Bamboo/Octopus Deploy for build \u0026amp; deployments, JIRA for user story management, Confluence as our Knowledge Base, BitBucket for Source Control, Xamarin for mobile development, TypeScript, SignalR, Entity Framework, and so on. We have many interesting projects that you'll be a part of! If you are not already located in Los Angeles, we will likely fly you out to us for 1-2 weeks every quarter or so – that way you get to meet your coworkers face to face!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePlease: Only candidates that are (1) located in the continental United States, (2) have current U.S. work authorization, and (3) can regularly work during Pacific Time business hours (9:00am to 6:00pm)!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHere’s what you need:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong programming experience in C#, ASP.NET/MVC, JavaScript/jQuery and SQL Server\u003c/li\u003e\n\u003cli\u003ePlus: Experience with other frameworks such as Entity Framework, Bootstrap, SignalR, SASS/SCSS, TypeScript, xUnit etc.\u003c/li\u003e\n\u003cli\u003eAt least 4 years of development experience\u003c/li\u003e\n\u003cli\u003eExcellent oral and written communication skills\u003c/li\u003e\n\u003cli\u003eCuriosity for new technologies!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eYou should work at Transplant Connect because:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe build software that truly helps people \u0026amp; saves lives around the world\u003c/li\u003e\n\u003cli\u003eWe use cutting-edge technology wherever possible\u003c/li\u003e\n\u003cli\u003eWe strive to continuously train and enhance the technical proficiency of all developers\u003c/li\u003e\n\u003cli\u003eWe tackle amazing challenges relating to technology and organ donation-transplantation as a whole\u003c/li\u003e\n\u003cli\u003eWe have a friendly and fun environment\u003c/li\u003e\n\u003cli\u003eWe genuinely care for our employees - you are not just a \"cog in a machine\"\u003c/li\u003e\n\u003cli\u003eWe provide competitive pay, health/dental/vision benefits, 401K, paid time off\u003c/li\u003e\n\u003cli\u003eWe participate in major developer conferences\u003c/li\u003e\n\u003cli\u003eYou WILL like it here!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits \u0026amp; Perks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, Vision, and Dental Benefits\u003c/li\u003e\n\u003cli\u003ePaid Life Insurance\u003c/li\u003e\n\u003cli\u003eFully-Paid Training\u003c/li\u003e\n\u003cli\u003eMonthly Virtual Team-Building and Social Events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Us\u003c/strong\u003e\nProvide cutting-edge software solutions to save more lives through the miracle of transplantation: that’s our goal at Transplant Connect.\u003c/p\u003e\n\u003cp\u003eAnd as the world’s leading provider of human biologics (organ, tissue, eye, placenta, etc.) donation and transplantation software, we’re incredibly proud that our modern, web-based solutions have already enabled millions of lives to be saved and healed around the globe.\u003c/p\u003e\n\u003cp\u003eIt’s an exciting time for us. We not only have a steady and continually growing stream of new partners adopting use of our award-winning, secure cloud-based iTransplantSM  Platform, but we remain tireless in our journey to continually evolve and expand our portfolio of products - including the build-out of entirely new revolutionary clinical solutions to transform and improve this key space.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:amuller@transplantconnect.com\"\u003eamuller@transplantconnect.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2VnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fcdd1016daecd7a33473f6445b855bf847ecb6a9/TC%20Logo%20-%20Always%20Innovating.jpg"},{"id":"6f3f1380-7819-4287-8494-a2cd54d470bb","type":"Full Time","url":"https://jobs.github.com/positions/6f3f1380-7819-4287-8494-a2cd54d470bb","created_at":"Fri Apr 09 00:06:43 UTC 2021","company":"Armstrong Robotics","company_url":"http:","location":"San Francisco","title":"Software Engineer - Backend","description":"\u003cp\u003eArmstrong Robotics is a startup founded by previously successful entrepreneurs that is developing a new class of consumer robot. We are a seed-stage company that has developed a technical prototype over the last two years. We are seeking software engineers to form our backend team. No robotics experience is necessary for this role, but you will work closely with robots.\u003c/p\u003e\n\u003cp\u003eCompetitive salary, equity and benefits.\u003c/p\u003e\n\u003ch2\u003eWhat you’ll do\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop the backend systems that run our robots\u003c/li\u003e\n\u003cli\u003eDesign infrastructure that combines on-robot and cloud-based processing\u003c/li\u003e\n\u003cli\u003eCollaborate with the computer vision and motion planning teams to implement production-ready versions of prototypes\u003c/li\u003e\n\u003cli\u003eOperate and test robots to find opportunities for improvement\u003c/li\u003e\n\u003cli\u003eInterface with low-level hardware and sensors\u003c/li\u003e\n\u003cli\u003eParticipate in product brainstorms and evaluate the technical complexity of possible features\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we’re looking for\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDegree in computer science or related field\u003c/li\u003e\n\u003cli\u003e2+ years of professional software development\u003c/li\u003e\n\u003cli\u003eA strong interest in learning about robotics or computer vision (but no direct experience required)\u003c/li\u003e\n\u003cli\u003eExperience in C++ or a willingness to learn it\u003c/li\u003e\n\u003cli\u003eExperience in some or all of the following:\n\u003cul\u003e\n\u003cli\u003eDistributed systems\u003c/li\u003e\n\u003cli\u003eDatabases (schema design, trade offs of various technology choices, etc)\u003c/li\u003e\n\u003cli\u003eMultithreaded or GPU-enabled parallel processing\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail \u003ca href=\"mailto:founders@armstrongrobotics.com\"\u003efounders@armstrongrobotics.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"473a6367-8358-4427-84cf-bad1f621de57","type":"Full Time","url":"https://jobs.github.com/positions/473a6367-8358-4427-84cf-bad1f621de57","created_at":"Thu Apr 08 23:58:42 UTC 2021","company":"Armstrong Robotics","company_url":"http:","location":"San Francisco","title":"Software Engineer - Motion Planning","description":"\u003cp\u003eArmstrong Robotics is a startup founded by previously successful entrepreneurs that is developing a new class of consumer robot. We are a seed-stage company that has developed a technical prototype over the last two years. We are seeking software engineers to form our motion planning team.\u003c/p\u003e\n\u003cp\u003eCompetitive salary, equity and benefits, and your own robot.\u003c/p\u003e\n\u003ch2\u003eWhat you’ll do\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop motion planning and control algorithms for mobile robots and arms\u003c/li\u003e\n\u003cli\u003eEvaluate recent robotics research advances, develop proofs of concept for relevant techniques, and implement production-ready versions of successful ideas\u003c/li\u003e\n\u003cli\u003eCollaborate with other teams, including computer vision and mechanical engineering, to find effective solutions\u003c/li\u003e\n\u003cli\u003eOperate and test robots to identify opportunities for improvement\u003c/li\u003e\n\u003cli\u003eParticipate in product brainstorms and evaluate the technical complexity of possible features\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we’re looking for\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDegree in computer science, robotics, electrical engineering or similar field\u003c/li\u003e\n\u003cli\u003e2+ years of professional software development or graduate degree\u003c/li\u003e\n\u003cli\u003eExperience in some or all of the following:\n\u003cul\u003e\n\u003cli\u003eSampling-based motion planning algorithms like RRT\u003c/li\u003e\n\u003cli\u003eTrajectory optimization\u003c/li\u003e\n\u003cli\u003eRobot dynamics and kinematics\u003c/li\u003e\n\u003cli\u003eNonlinear programming and convex optimization\u003c/li\u003e\n\u003cli\u003eOptimal control algorithms\u003c/li\u003e\n\u003cli\u003eReinforcement learning\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eA passion for robotics\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease email \u003ca href=\"mailto:founders@armstrongrobotics.com\"\u003efounders@armstrongrobotics.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"548af8ef-a201-46aa-8689-48c6eebd18d4","type":"Full Time","url":"https://jobs.github.com/positions/548af8ef-a201-46aa-8689-48c6eebd18d4","created_at":"Thu Apr 08 18:50:59 UTC 2021","company":"King County Environmental Lab","company_url":null,"location":"Seattle, WA","title":"Senior Applications Developer","description":"\u003cp\u003eThe Environmental Lab (KCEL) is a Section of the Department of Natural Resources and Parks (DNRP) Water and Land Division (WLRD). DNRP's mission is to provide regional parks and trails; protect the region's water, air, land, natural habitats, and historic properties; and reduce, safely dispose of and create resources from wastewater and solid waste. KCEL is a full-service environmental laboratory that provides quality field, laboratory, regulatory, and advisory services in support of King County and other publicly sponsored programs that protect and enhance water quality. (See \u003ca href=\"http://www.kingcounty.gov/depts/dnrp/wlr/sections-programs/environmental-lab.aspx\"\u003ehttp://www.kingcounty.gov/depts/dnrp/wlr/sections-programs/environmental-lab.aspx\u003c/a\u003e for more details).\u003c/p\u003e\n\u003cp\u003eKCEL is currently looking for a Term-Limited-Temporary full stack Senior Applications Developer to be part of a team to modernize an existing legacy Laboratory Information Management System (LIMS). Specifically, this project is focused on replacing the legacy Oracle Forms front end with a web-based solution. The primary technologies on this project are: an on prem Oracle database server, Oracle SQL, C#, .Net 5, Azure App Service hosted Web APIs, Azure DevOps CI/CD pipelines, React, Typescript, Telerik React UI components and Cascading Style Sheets (CSS). The project workflow utilizes Azure DevOps product backlog items and corresponding Kanban boards. The project is expected to end 12/31/2024.\u003c/p\u003e\n\u003cp\u003eThis project offers several unique opportunities for job satisfaction: ground floor custom development working on a small dedicated team with an experienced technical leader, leveraging modern technologies to provide an efficient new system that drives the daily activities of a well engaged, on-site user community.\u003c/p\u003e\n\u003cp\u003eThis position will work under an IT Supervisor both independently and collaboratively as a member of the KCEL LIMS Project Team and KCEL’s scientific staff. Duties of this job encompass all areas of custom software development lifecycle including customer interaction, eliciting user requirements, extracting requirements from the existing codebase, workflow analysis, designing, data modelling, programming, reviewing others code, assisting with test plans, testing and formally documenting all work.\nDuration: This is a term-limited temporary (TLT) position that is expected to last three and a half (3 1/2) years.\u003c/p\u003e\n\u003cp\u003eWho is Eligible: This position is open to the public.\u003c/p\u003e\n\u003cp\u003eWork Location: This position is located at the King County Environmental Lab, 322 West Ewing Street, Seattle, WA 98119. However, work will also be completed remotely due to the telecommuting mandate implemented by the County’s COVID-19 pandemic response.\u003c/p\u003e\n\u003cp\u003eWork Schedule: This position is exempt from the overtime provision of the Fair Labor Standard Act (FLSA) and is not overtime eligible. This full-time position works a 40-hour work week.\u003c/p\u003e\n\u003cp\u003eJob Duties\nIncrementally develop, release, and support modernized replacement for existing Lab Information Management System (LIMS) front end application. Duties include:\u003c/p\u003e\n\u003cp\u003eLearn aspects of a complex environmental science business domain and an in-depth understanding of those client needs.\nLearn business needs and determine systems requirements through client meetings and system analysis.\nPractice creative approaches to designing the new system to run in PARALLEL compatibility with all the existing legacy systems.\nManage the full software development life cycle – conception, requirements analysis, specification design, coding, testing, documenting, training, user acceptance refinement, rollout, and support of project modules.\nManage and regularly communicate personal work status to supervisor, team members, and customers.\nProvide user support, training, and documentation.\nProvide code comments and documentation of the project’s software, architecture, and processes to ensure other team members can review code and support each other.\nIndependently develop project modules and individual web-pages.\nPerform an advanced degree of relational database programming on Oracle platform, including relational table design, stored procedures, set-based query design, and performance tuning.\nPerform an advanced degree of programming in both dotnet core C# web API domain and typescript React front end domain.\nEvaluate existing applications for process efficiency, system integrity, security, and data quality; proactively manage risks; redesign and replace selected application sub-systems as needed.\nExperience, Qualifications, Knowledge, Skills\nRequired Qualifications\u003c/p\u003e\n\u003cp\u003eBachelor’s degree in computer science, engineering, or management information systems (MIS), or the equivalent combination of education and experience.\nMinimum three years' experience developing in a multi-user production environment using the .Net development stack.\nMinimum five years' experience working with major relational databases (Oracle, SQL Server, MySQL, etc), developing stored procedures, relational modeling, maintaining an ERD and database tuning.\nMinimum two years' experience developing unit and integration testing.\nKnowledge of object-relational mapping, such as Entity Framework.\nMinimum three years' experience developing within a REST Web API architecture.\nMinimum three years' experience developing in a modern javascript SPA framework (e.g. React, Angular, Vue).\nAdvanced knowledge of relational database and web frontend programming environments.\nFamiliarity with cloud integration and Microsoft Azure.\nAdvanced knowledge of software engineering principles, practices, and software development life cycle.\nAdvanced skills in analyzing client business processes.\nKnowledge of Agile and Scrum project management principles and methods.\nExpertise in analysis, problem solving and troubleshooting.\nAbility to translate user needs, through strong written and oral communication skills, to design requirements and technical documentation.\nUnintimidated by multiple competing priorities.\nStrong customer service ethic.\nInspired by working with a diverse team environment.\nThe Most Competitive Candidates May Have:\nExperience working for clients in chemical or biological sciences.\nExperience with a Laboratory Information Management System.\nExperience developing Oracle SQL (stored procedures, views).\nExperience modernizing a legacy application to a web-based platform.\nExperience contributing to design of a .Net stack application architecture.\nSpecialization in modern CSS (cascading style sheets), e.g. CSS grid.\nThree years' React experience versus another SPA framework.\nNecessary Special Requirements:\nEmployment will be contingent upon successfully passing a background check.\nSupplemental Information\nApplication and Selection Process: Application materials will be screened for clarity, completeness including online application, cover letter and resume, and responsiveness to the list of qualifications, skills, and abilities. The most competitive candidates will be invited to participate in a selection process that may include testing, code review, and one or more panel interview. Applications without the following required materials may not be considered for this position.\u003c/p\u003e\n\u003cp\u003eKing County application\nResume\nCover Letter detailing your background and what you can bring to this position\nResponses to supplemental questions\nUnion Representation: This position is not represented by a union.\u003c/p\u003e\n\u003cp\u003eFor more information regarding this recruitment, please contact:\nDeena Prasad, Senior Human Resource Analyst\nPhone: 206-263-0101\nEmail: \u003ca href=\"mailto:dprasad@kingcounty.gov\"\u003edprasad@kingcounty.gov\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eForbes recently named King County as one of Washington State's best employers.\u003c/p\u003e\n\u003cp\u003eTogether, with leadership and our employees, we're changing the way government delivers service and winning national recognition as a model of excellence. Are you ready to make a difference? Come join the team dedicated to serving one of the nation's best places to live, work and play.\u003c/p\u003e\n\u003cp\u003eGuided by our \"True North\", we are making King County a welcoming community where every person can thrive. We value diversity, inclusion and belonging in our workplace and workforce. To reach this goal we are committed to workforce equity. Equitable recruiting, support, and retention is how we will obtain the highest quality workforce in our region; a workforce that shares and will help advance our guiding principles--we are one team; we solve problems; we focus on the customer; we drive for results; we are racially just; we respect all people; we lead the way; and we are responsible stewards. We encourage people of all backgrounds and identities to apply, including Native American and people of color, immigrants, refugees, women, LGBTQ+, people living with disabilities, and veterans.\u003c/p\u003e\n\u003cp\u003eKing County is an Equal Employment Opportunity (EEO) Employer\nNo person is unlawfully excluded from employment opportunities based on race, color, religion, national origin, sex (including gender identity, sexual orientation and pregnancy), age, genetic information, disability, veteran status, or other protected class. Our EEO policy applies to all employment actions, including but not limited to recruitment, hiring, selection for training, promotion, transfer, demotion, layoff, termination, rates of pay or other forms of compensation.\u003c/p\u003e\n\u003cp\u003eTo Apply\nIf you are interested in pursuing this position, please follow the application instructions carefully. If you need this announcement in an alternate language or format, would like to request accommodation or assistance in the application or assessment process or if you have questions please contact your recruiter listed on this job announcement.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.governmentjobs.com/careers/kingcounty/jobs/3023330/senior-applications-developer\"\u003ehttps://www.governmentjobs.com/careers/kingcounty/jobs/3023330/senior-applications-developer\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply At: \u003ca href=\"https://www.governmentjobs.com/careers/kingcounty/jobs/3023330/senior-applications-developer\"\u003ehttps://www.governmentjobs.com/careers/kingcounty/jobs/3023330/senior-applications-developer\u003c/a\u003e\nto apply\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--344b6ccd13571368b663ad31baae2609fa4ed1e4/Capture.JPG"},{"id":"067a59f9-3487-44d2-b81d-47d9d06fba74","type":"Full Time","url":"https://jobs.github.com/positions/067a59f9-3487-44d2-b81d-47d9d06fba74","created_at":"Thu Apr 08 15:22:26 UTC 2021","company":"Superside","company_url":"https://www.superside.com","location":"Remote/Europe","title":"Senior Software Engineer","description":"\u003cp\u003eSuperside is growing fast and we're currently looking to expand our engineering team with a bunch of talented and product-driven engineers. We are looking for both front-end, full-stack, and back-end engineers.\u003c/p\u003e\n\u003cp\u003eABOUT SUPERSIDE\u003c/p\u003e\n\u003cp\u003eOur vision is to bring the future of work to life and flood the world with beautiful, intuitive design - all while building a creative platform the likes of which the world has not yet seen. And we want your help.\u003c/p\u003e\n\u003cp\u003eBorn out of Norway and the US, Superside since 2015 grown to more than 200 employees located all around the world, spanning 58 countries and 19 timezones. Superside is a remote scale-up building a design workflow and collaboration platform while delivering mind-blowing creative work to some of the most innovative companies in the industry. By building customizable managed workflows and communication technology, we are changing the way the world creates and collaborates at scale.\u003c/p\u003e\n\u003cp\u003eWe have the backing and momentum to do it - Y Combinator, Slack Fund, Freestyle Capital and High Alpha Capital are all supporting our vision, and over the last year, Superside has grown over 250 percent. Through our platform, Superside has attracted some of the world’s largest brands, such as Facebook, Redbull, Puma, Amazon, Salesforce, Cisco, HP, Twitch, Airbus, L'Oreal, Tiffany \u0026amp; Co.\u003c/p\u003e\n\u003cp\u003eGrowing our engineering and product team is just the next step in this exciting journey and one that will lead to our biggest achievements yet.\u003c/p\u003e\n\u003cp\u003eABOUT THE ENGINEERING TEAM\u003c/p\u003e\n\u003cp\u003eWe work remotely, meaning that we want to work with the best, no matter where you want to live. Our growing engineering and product team is full of alumni from Spotify, Adobe, Yandex, Mail.ru and more all now looking to disrupt creative operations together. The team is fully distributed across Europe but everyone is working within CET +/- 3 hours.\u003c/p\u003e\n\u003cp\u003eToday, our engineering team consists of 12 developers, our aim is to extend to 25-30 engineers within the year.\u003c/p\u003e\n\u003cp\u003eSuperside works closely together and emphasize a product-driven mindset. Everyone is given a lot of freedom and autonomy, and you’ll be able to take part in all types of product-related discussions, ranging from architecture to algorithms, DevOps and Cloud. You will work with scrum methodology, weekly product meetings, daily stand-ups with the team and weekly grooming sessions.\u003c/p\u003e\n\u003cp\u003eWHAT YOU WILL BE WORKING ON\u003c/p\u003e\n\u003cp\u003eAs an engineer at Superside, you'll be taking a crucial role in building, improving and scaling our platform. Depending on the role, you'll be involved in different parts of our product development process and work closely with both designers, product managers, QA and SRE to deliver compelling user-facing products.\u003c/p\u003e\n\u003cp\u003eYou can expect to get your hands dirty with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe part of important product discussions, and discuss with product managers, ux designers and other engineers\u003c/li\u003e\n\u003cli\u003eMigration from monolith to microservice architecture\u003c/li\u003e\n\u003cli\u003eBuild a design commenting system ala Figma\u003c/li\u003e\n\u003cli\u003eBuild and improve on our Chat and Collaboration system (Superchat)\u003c/li\u003e\n\u003cli\u003eBuilt integrations towards other services in the design space\u003c/li\u003e\n\u003cli\u003eBuild out our project management platform\u003c/li\u003e\n\u003cli\u003eImprove on our staffing system\u003c/li\u003e\n\u003cli\u003eBuild version control for design assets\u003c/li\u003e\n\u003cli\u003eArchitect efficient and reusable front-end systems that drive complex web applications\u003c/li\u003e\n\u003cli\u003eArchitect efficient, scalable and highly available back-end systems that drive complex web applications\u003c/li\u003e\n\u003cli\u003eIdentify and resolve performance and scalability issues\u003c/li\u003e\n\u003cli\u003eWe want to bring the future of work to life and flood the world with beautiful, intuitive design. And we want your help in doing both.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTHE TECH STACK\u003c/p\u003e\n\u003cp\u003eFrontend\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNodeJS\u003c/li\u003e\n\u003cli\u003eLambda Edge\u003c/li\u003e\n\u003cli\u003eNext.js/ React\u003c/li\u003e\n\u003cli\u003eStyled Components\u003c/li\u003e\n\u003cli\u003eTypescript\u003c/li\u003e\n\u003cli\u003eSanity Headless CMS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBackend\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava/Kotlin\u003c/li\u003e\n\u003cli\u003eSpring Boot 2\u003c/li\u003e\n\u003cli\u003eHibernate/ AWS RDS / MySql\u003c/li\u003e\n\u003cli\u003eRedisson/Redis\u003c/li\u003e\n\u003cli\u003eJunit for testing\u003c/li\u003e\n\u003cli\u003eElasticSearch\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInfrastructure\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTerraform\u003c/li\u003e\n\u003cli\u003eAWS SQS/SNS, ECS, Cloudfront, Route53,  EC2, S3, WAF, PageDuty, ParameterStore, ALB\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eJenkins\u003c/li\u003e\n\u003cli\u003ePusher\u003c/li\u003e\n\u003cli\u003eMailgun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCheck out the video below to get a sneak peak of our DesignOps platform and a look and feel of the product you'll be working on : \u003ca href=\"https://www.youtube.com/watch?v=WlZc10j_eDo\"\u003ehttps://www.youtube.com/watch?v=WlZc10j_eDo\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://superside.vervoe.net/job-page/senior-software-engineer-full-time-remote/ddaaf40d-3195-44e1-92e2-5d77579c6dfb\"\u003ehttps://superside.vervoe.net/job-page/senior-software-engineer-full-time-remote/ddaaf40d-3195-44e1-92e2-5d77579c6dfb\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaCtnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--471ec8127b6458a497bbdc3fa9b27904d3f5e490/69779277_2489957244565569_1506768630170255360_n.png"},{"id":"9eec73f3-b4f8-4f35-8693-c7cc15cd3d29","type":"Full Time","url":"https://jobs.github.com/positions/9eec73f3-b4f8-4f35-8693-c7cc15cd3d29","created_at":"Thu Apr 08 15:00:42 UTC 2021","company":"Infina, Ltd","company_url":"https://vonq.io/3d0kBB1","location":"McLean","title":"Senior Software Developer","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eEveryone wins if government works better. We provide innovative solutions and services to complex problems and processes. We apply our creative skill set and expertise to empower government. Our proficient staff is at the front line of digital media, financial services, business management, and solution development.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eInfina is seeking a highly motivated Software Developer with both front and back-end development experience. This individual will perform front end application development in Windows using WPF and WCF, coding in HTLM5 under Visual Studio 2013 or greater, and back-end development creating Windows services and databases (Oracle).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf you have an interest and experience in programming, AR/VR and game development, this may be a great fit for you!\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWork collaboratively with team to receive and respond to project requests\u003c/li\u003e\n\u003cli\u003eDesign algorithms and flowcharts to create new software programs and systems\u003c/li\u003e\n\u003cli\u003eCreatively and efficiently design applications and software solutions to meet customer requirements\u003c/li\u003e\n\u003cli\u003eUtilize industry-accepted testing methods to troubleshoot, de-bug, maintain, and improve existing software\u003c/li\u003e\n\u003cli\u003eCompile and assess user feedback to improve software performance\u003c/li\u003e\n\u003cli\u003eDevelop technical documentation to guide future software development projects\u003c/li\u003e\n\u003cli\u003eWork with different teams and departments to ensure code quality\u003c/li\u003e\n\u003cli\u003eCreate reports and present development updates to teams and stakeholders\u003c/li\u003e\n\u003cli\u003eCustomize existing code to ensure efficiency and functionality\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMust have a bachelor's degree in Computer Science or a related field\u003c/li\u003e\n\u003cli\u003eAt least eight (8) years of experience in programming software or mobile applications\u003c/li\u003e\n\u003cli\u003eGame development, AR/VR and mixed reality experience is a plus\u003c/li\u003e\n\u003cli\u003eExcellent communications skills and an intellectual curiosity\u003c/li\u003e\n\u003cli\u003eProficiency in C# coding language and .Net framework; experience with AngularJS framework is a plus\u003c/li\u003e\n\u003cli\u003eUp-to-date knowledge of different programming languages, such as HTML 5, C, C+, C++, Java, Javascript, Ruby and Python\u003c/li\u003e\n\u003cli\u003eExperience with Geographical Information System (GIS) tools\u003c/li\u003e\n\u003cli\u003eExcellent knowledge of the software development life cycle\u003c/li\u003e\n\u003cli\u003eProficiency with various database tools such as Oracle, MySQL, AWS, cloud computing, etc.\u003c/li\u003e\n\u003cli\u003eExperience with version control systems\u003c/li\u003e\n\u003cli\u003eStrong problem-solving and communication skills\u003c/li\u003e\n\u003cli\u003eKnowledge of Object-Relational Mapping frameworks\u003c/li\u003e\n\u003cli\u003eExperience with Agile and Scrum development methodologies\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003ePlease note that this position will be located in McLean, VA, once we are ready to return to the office.\u003c/p\u003e\n\u003cp\u003eInfina, Ltd. is an equal opportunity employer. All individuals are encouraged to apply.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3d0kBB1\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3d0kBB1\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDZnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ad60f4fa4162d3a6a657979cbd374408a1dddce7/infina.jpg"},{"id":"d14da3f5-2cb6-47ce-938a-60503527a395","type":"Full Time","url":"https://jobs.github.com/positions/d14da3f5-2cb6-47ce-938a-60503527a395","created_at":"Thu Apr 08 14:45:51 UTC 2021","company":"c-Com GmbH","company_url":"http://www.c-com.net","location":"Aalen","title":"Backend Software Developer (m/w/d)","description":"\u003cp\u003eDie c-Com GmbH – ein Unternehmen der MAPAL Gruppe – ist ein innovatives Start-up im Industrie-4.0-Umfeld. Auf Basis von SAP bietet c-Com eine Cloud-Plattform für das hersteller­unab­hängige Daten­management von C-Teilen an.\u003c/p\u003e\n\u003cp\u003eDie MAPAL Gruppe ist ein inter­na­tional agierender Anbieter von Präzisions­werk­zeugen für die Zer­spanung nahezu aller Werk­stoffe. Das Familien­unter­nehmen beschäftigt 5.500 Mit­arbeiter weltweit, davon 3.600 in Deutschland. Wir bieten Ihnen interes­sante und heraus­fordernde Aufgaben­stellungen, gute Entwicklungs­möglich­keiten sowie attrak­tive Rahmen­be­dingungen eines modernen Unternehmens.\u003c/p\u003e\n\u003cp\u003eWir suchen\nBackend Software Developer (m/w/d)\u003c/p\u003e\n\u003cp\u003eIHR AUFGABENGEBIET:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSie entwickeln digitale Services in Zusammen­arbeit mit Nutzern aus der Industrie\u003c/li\u003e\n\u003cli\u003eIm Backend entwickeln Sie in Java mit dem Frame­work Spring und stellen dies in einem Cloud Cluster den Kunden zur Ver­fügung\u003c/li\u003e\n\u003cli\u003eAls Teil des DevOps Teams unter­stützen Sie beim Aufbau und Betrieb unserer Systemlandschaften, beispielsweise unter Anwendung von Infrastructure-as-Code-Werkzeugen wie Terraform und Ansible\u003c/li\u003e\n\u003cli\u003eSie entwickeln Test­fälle zur Qualitäts­sicherung auf ver­schiedenen Ebenen (Schnittstellen, Komponenten)\u003c/li\u003e\n\u003cli\u003eIn einem Industrie-4.0-Software­ent­wicklungs­projekt arbeiten Sie eng mit inter­nationalen Frontend-, App- und Backendent­wicklern zusammen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIHR PROFIL:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossene Berufsaus­bildung als Fach­informatiker (m/w/d) Anwendungs­ent­wicklung oder abge­schlossenes Studium mit Programmier­inhalten\u003c/li\u003e\n\u003cli\u003eErfahrungen in der Anwendungs­ent­wicklung mit Java und relationalen Daten­banken sowie in der Bereit­stellung der Daten über RESTful Web­services sind erforder­lich\u003c/li\u003e\n\u003cli\u003eSicherer Umgang mit Cloud-Technologien wie virtuelle Ressourcen (Instanzen, Netz­werke, Load Balancer) und Erfahrungen mit mindestens einem Hyperscaler (AWS, Azure, GCP, Alibaba)\u003c/li\u003e\n\u003cli\u003eZusätzliche Kennt­nisse in Jenkins, Maven, Git und agilen Werk­zeugen wie z.B. Jira sind vorteil­haft\u003c/li\u003e\n\u003cli\u003eSichere Kommunikation in Deutsch und Englisch ist erforder­lich\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInteressiert? Dann bewerben Sie sich über das Karriereportal unter \u003ca href=\"http://www.mapal.com\"\u003ewww.mapal.com\u003c/a\u003e.\nWeitere Informationen zu c-Com finden Sie unter \u003ca href=\"http://www.c-com.net\"\u003ewww.c-com.net\u003c/a\u003e.\nc-Com GmbH | Heinkelstraße 11 | D-73431 Aalen\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.mapal.com/job/Aalen-Fullstack-Software-Developer-%28mwd%29-73431/649426501/\"\u003ehttps://jobs.mapal.com/job/Aalen-Fullstack-Software-Developer-%28mwd%29-73431/649426501/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--185c8f9bee1397630dbbe43b32266c58c55275f3/c-Com_logo.png"},{"id":"f65296f1-3772-47fc-a0f3-8af6269d79c5","type":"Part Time","url":"https://jobs.github.com/positions/f65296f1-3772-47fc-a0f3-8af6269d79c5","created_at":"Thu Apr 08 08:53:10 UTC 2021","company":"Chemovator","company_url":"https://chemovator.com/","location":"Mannheim","title":"Werkstudent Agile Softwareentwicklung (m/w/d)","description":"\u003cp\u003eChemovator is the business incubator of BASF. We provide a protected space to build commercial ventures from unconventional ideas. Our Venture Teams take full ownership of their idea, creatively explore their business, learn fast and pivot beyond corporate boundaries.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVenture Team\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSharcx\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUnser Venture Team sharcx entwickelt cloud-basierte Analysedienste, die es B2B-Vertriebs- und Marketingabteilungen ermöglichen, den Umsatz durch automatisch erhöhte Kundenzufriedenheit zu steigern. Die Data-Analytics Engine senkt Customer-Churn, verbessert die Kundenzufriedenheit (z.B. NPS®) und erhöht den Customer Lifetime Value. Weitere Informationen findest Du unter \u003ca href=\"http://www.sharcx.com/\"\u003ewww.sharcx.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir wollen nun unserer Software Entwickler Team ausbauen und suchen einen motivierten und sehr selbständigen Werkstudenten, der unseren Continuous-Delivery-Prozess auf die nächste Stufe bringt. Bist du der/die Richtige, um uns auf dieser Reise zu begleiten?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu unterstützt unseren CTO beim technischen Aufbau unserer CI/CD-Pipeline\u003c/li\u003e\n\u003cli\u003eDu unterstützt unser Team bei der Definition und Evaluierung unserer SDLC-Prozesse\u003c/li\u003e\n\u003cli\u003eDu bist verantwortlich für die Definition und Durchführung einer umfassenden Testmethodik für unsere Produktentwicklungspipeline\u003c/li\u003e\n\u003cli\u003eDu identifizierst Potenziale zur Testautomatisierung und führst die notwendigen Schritte zur Umsetzung durch\u003c/li\u003e\n\u003cli\u003eDu unterstützt das Team bei der Testfallerstellung und -durchführung\u003c/li\u003e\n\u003cli\u003eDu unterstützt das Team beim Beheben von Bugs und dem Bugfixing-Prozess\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu befindest dich in einem Studium (Bachelor - mindestens 5. Semester oder Master) im Bereich Angewandte Informatik / Informatik oder Wirtschaftsinformatik\u003c/li\u003e\n\u003cli\u003eDu hast deine Erfahrung in agiler Softwareentwicklung und Softwaretestverfahren bereits in anderen Praktika unter Beweis gestellt\u003c/li\u003e\n\u003cli\u003eDu hast ein gutes Verständnis für modernes CI/CD\u003c/li\u003e\n\u003cli\u003eDu bist kundenorientiert, offen und hast keine Scheu, mit Menschen zu sprechen, die du noch nicht kennst\u003c/li\u003e\n\u003cli\u003eDu beschreibst Dich selbst als sehr strukturiert und pragmatisch, bist ein großer Teamplayer und arbeitest mit Deinem ausgezeichneten Organisationstalent gerne in einem agilen Umfeld\u003c/li\u003e\n\u003cli\u003eDu bist daran interessiert, moderne Tools einzusetzen und den Entwicklungsablauf zu automatisieren\u003c/li\u003e\n\u003cli\u003eDu kannst Prozesse visualisieren und entsprechend umsetzen (BPMN ist ein Plus)\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrung mit CI/CD-Tools (z.B. Jenkins, TeamCity, DevOps)\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrung mit Tools zur (agilen) Softwareentwicklung (z.B. Jira, YouTrack, Xray, BitBucket)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEinen stetigen Austausch und Dialog mit erfahrenen Experten aus zwei Welten dem BASF-Konzern und unserem breiten externen Netzwerk\u003c/li\u003e\n\u003cli\u003eDen Erfahrungsschatz Ihrer Kollegen und unserer Entrepreneurs in Residence, um dich und das Vorhaben weiterzuentwickeln\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten und mobiles Arbeiten sowie die üblichen Annehmlichkeiten eines Unternehmens im Startup-Umfeld, z.B. kostenlose Getränke und eine inspirierende Atmosphäre in einer unkonventionellen Location in Mannheim\u003c/li\u003e\n\u003cli\u003eEin wettbewerbsfähiges Gehalt und die Möglichkeit, nach Abschluss des Studiums in Vollzeit bei sharcx einzusteigen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAre you interested?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNoch ist nichts in Stein gemeißelt, daher ist dein Input sehr willkommen. Bitte kontaktiere Tobias Seeger mit deinen relevanten Unterlagen. Wir freuen uns, von dir zu hören!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/3a51c06950c2ef47f6663fa553266187d4a55e5d/68747470733a2f2f742e676f686972696e672e636f6d2f682f65376637333566356638636261666562663066336138633165653366643661656531656133396262656132633539346264343565376439363132306137313237\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/d5d08568316cda6795cb208adfb543ede5099e0d746afbf429ad8200bda0e154\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ffc576e3add1b4951c47b2b69cfc2de0658dad29/Chemovator.png"},{"id":"f02c0a72-fc94-4c46-807a-9b2027ad4cc4","type":"Full Time","url":"https://jobs.github.com/positions/f02c0a72-fc94-4c46-807a-9b2027ad4cc4","created_at":"Thu Apr 08 06:16:28 UTC 2021","company":"f2pool \u0026 stakefish","company_url":"https://stake.fish/en/","location":"Remote","title":"Developers","description":"\u003cp\u003eWe are f2pool and stakefish.\u003c/p\u003e\n\u003cp\u003eFounded in 2013, f2pool is the largest Bitcoin mining pool. Over 1 million $BTC and 6 million $ETH born here. We are also helping secure $LTC, $DOGE, and dozens of other #PoW cryptocurrencies.\u003c/p\u003e\n\u003cp\u003estakefish is a non-custodial staking provider. We are a group of digital nomads doing the same thing f2pool is doing but for the #PoS blockchains. We recently launched Eth2 staking services and currently have more than 200k ETH on the beaconchain safely staked with us.\u003c/p\u003e\n\u003cp\u003eWe are looking for #geeks and #nerds to join us for our decentralized future.\nSome of the roles we are looking for: Devs, iOS Dev, DevOps, and UX designer.\u003c/p\u003e\n\u003cp\u003eOpen-source gurus and crypto hackers are very much welcome.\u003c/p\u003e\n\u003cp\u003eWe expect you to have extensive experiences with GNU/Linux and have in-depth knowledge in operating systems, networking, algorithms, and data structure.\u003c/p\u003e\n\u003cp\u003ePlease send resume in English to jobs[at]stake[dot]fish.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSend your resume in English to \u003ca href=\"mailto:jobs@stake.fish\"\u003ejobs@stake.fish\u003c/a\u003e or visit our website.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE9nIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--33faf0916ead0cc87427bd39a6b69f279e217460/stakefish_logo.png"},{"id":"df7a06bd-3b0e-4a10-a412-e74acb00d858","type":"Full Time","url":"https://jobs.github.com/positions/df7a06bd-3b0e-4a10-a412-e74acb00d858","created_at":"Thu Apr 08 00:19:54 UTC 2021","company":"NationBuilder","company_url":"https://nationbuilder.com/","location":"Remote within the United States","title":"UI Engineer","description":"\u003cp\u003eNationBuilder is seeking a visually oriented UI engineer with a strong command of React, HTML, and CSS. You will be a co-owner of \u003ca href=\"https://www.nationbuilder.design/\"\u003eRadius\u003c/a\u003e, the NationBuilder product pattern library, and be responsible for translating design requirements into functional and polished user interfaces across the NationBuilder product. You will also be responsible for the maintenance and nurturing of NationBuilder’s stock website theme templates, used by hundreds of thousands of websites around the world. This is a remote position (within the U.S.)\u003c/p\u003e\n\u003cp\u003eThis is an excellent position for someone who thrives working in creative environments. You should have experience hacking existing frameworks, and have no problem building your own. You will report directly to the VP of Design.\u003c/p\u003e\n\u003cp\u003eNationBuilder offers everyone the technology and community infrastructure to power organizations, movements, and campaigns. Our customers range from nonprofits and political parties to corporations and individuals just getting started - essentially anyone who’s building a community of people to make something happen in the world. To learn more about NationBuilder, read our \u003ca href=\"https://nationbuilder.com/mission\"\u003emission, beliefs, and values.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking for someone who...\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHas a strong command of HTML/CSS/JavaScript, cross-browser development, and writes semantic, scalable code.\u003c/li\u003e\n\u003cli\u003eHas experience creating React components, writing tests, and delivering delightful user experiences through their command of JavaScript.\u003c/li\u003e\n\u003cli\u003eHas experience building out polished, functional user interfaces in web applications\u003c/li\u003e\n\u003cli\u003eHas experience working on website themes and a familiarity with Bootstrap\u003c/li\u003e\n\u003cli\u003eIs strongly visually oriented and precise in code, communication, and documentation.\u003c/li\u003e\n\u003cli\u003eIs a pragmatic problem solver, knowing how to find the middle ground between \"perfect, but takes forever to code\" and \"fixes it now, but nobody will ever be able to understand what I did.\"\u003c/li\u003e\n\u003cli\u003eIs a clear and concise communicator with excellent collaboration skills.\u003c/li\u003e\n\u003cli\u003eIs humble, passionate about personal growth, and would rather be “better” than “right.”\u003c/li\u003e\n\u003cli\u003eProactively seeks out feedback and welcomes it as an opportunity to grow.\u003c/li\u003e\n\u003cli\u003eHas a strong work ethic, a quick learner and is willing to work with a fast-paced team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApply\u003c/strong\u003e\nTo apply, submit your resume, a link to your portfolio or recent work, and tell us why you're a good fit for the job in 280 characters or less (like a tweet, but you don't have to actually tweet it)!\u003c/p\u003e\n\u003cp\u003eNationBuilder is an equal opportunity employer and we value inclusion. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/30bac8563us\"\u003ehttps://grnh.se/30bac8563us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaENnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d8047e2d468b43bf076460e5f2ca634830bc9d04/nationbuilder%20logo.jpg"},{"id":"50df2783-b82f-42c3-b671-0e960bf88dfe","type":"Full Time","url":"https://jobs.github.com/positions/50df2783-b82f-42c3-b671-0e960bf88dfe","created_at":"Wed Apr 07 23:23:38 UTC 2021","company":"ActiveState Software","company_url":"https://www.activestate.com/","location":"Vancouver, BC / Remote","title":"Java Language Compiler Specialist","description":"\u003cp\u003e\u003cstrong\u003eJava Language Specialist\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eActiveState Platform - made by developers for developers! We are reinventing build engineering with an on-demand SaaS Platform and CLI tool that lets developers automate the building of any runtime environment using any open source language ecosystem on any platform. In Beta right now, we support Python and Perl and we're hiring to add more languages and packages! We’re building an ambitious language distribution platform so that no engineer ever has to suffer dependency hell again, and we need your help to add Java to it!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis position is available to remote workers anywhere in the world, as long as you are able to work on a schedule that aligns with our core North American business hours of 10:00am - 4:00pm PST.\u003c/strong\u003e You can also choose to work from our headquarters in beautiful Vancouver, BC once the health situation makes this possible.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat You’ll be Doing\u003c/strong\u003e\nAs a  Java Language Specialist on our team, you are responsible for using your deep understanding of Java -- its internals, dependency management, idioms, and community -- to teach our Platform to build and distribute Java for multiple Operating Systems. We’re building from source. Note this is not a Java development role. Rather you'll be writing software to create custom Java distributions and this software won't necessarily be written in Java. You’ve been bitten by Java and have successfully tamed it.\u003c/p\u003e\n\u003cp\u003eOur day to day work practices are centered around GitHub, pull requests, code review, CI for testing, and agile development with Pivotal Tracker as our project management tool. We’re always looking to improve our practices and we expect you to help us to do so.\u003c/p\u003e\n\u003cp\u003eOur team is scattered around the US and Canada, so we coordinate with each other and the rest of the company using Slack for chat, Highfive for video calls and screen sharing, Pivotal Tracker, and Google Drive.\u003c/p\u003e\n\u003cp\u003eWe like to use open source software whenever possible, and we also like to contribute back to the open source ecosystem. We embrace open sourcing both libraries and tools developed in-house as long as those are not mission-critical code.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s in it for You\u003c/strong\u003e\n-Working for a stable and growing company that offers the environment and personal growth potential of a start-up.\n-The chance to work with a smart, passionate team of people.\n-Competitive salary, bonus, and stock option plan.\n-Comprehensive benefits package and health/wellness credit program.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeep understanding of the Java platform, its packaging ecosystem, and how to build Java and its dependencies.\u003c/li\u003e\n\u003cli\u003eUnderstand how JDK binaries are built and used\u003c/li\u003e\n\u003cli\u003eUnderstand how Maven dependency management works\u003c/li\u003e\n\u003cli\u003eExperience with C/C++ programming on multiple operating systems (Windows/UNIX/OSX) and the build system for a Java distribution (e.g. OpenJDK)\u003c/li\u003e\n\u003cli\u003eAbility to work in multiple languages. We use Python, Go, Perl, and other languages as needed.\u003c/li\u003e\n\u003cli\u003eExcellent written and spoken skills, both technical and non-technical. You’ll need to work closely with your developer teammates, as well as be able to have coherent conversations with people from QA, sales, marketing, and other parts of the company.\u003c/li\u003e\n\u003cli\u003eA willingness to engage in the process of defining our work through conversations with product management, other engineering teams, and the rest of the company.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAssets\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you have experience with any of the following please make sure to highlight it in your cover letter:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a maintainer, contributor to the core Java code base, or have a popular Java based Open Source project. We make special accommodations to help you maintain those activities.\u003c/li\u003e\n\u003cli\u003eA deep understanding of Maven and/or Nexus, especially their pros and cons, especially private artifact repositories.\u003c/li\u003e\n\u003cli\u003ePractical experience with Java 9 modules\u003c/li\u003e\n\u003cli\u003eExperience with JLink\u003c/li\u003e\n\u003cli\u003eExperience working on a build system outside of an IDE.\u003c/li\u003e\n\u003cli\u003eAgile processes, including breaking large projects up into smaller stories, estimation, working in branches (GitHub Flow), code review, and CI.\u003c/li\u003e\n\u003cli\u003eC or C++ code and debugging compiler issues across platforms.\u003c/li\u003e\n\u003cli\u003ePerl, Python, Tcl, or Java, especially an understanding of their respective language communities and their toolchains.\u003c/li\u003e\n\u003cli\u003eBig iron operating systems including Solaris, AIX, and HP-UX.\u003c/li\u003e\n\u003cli\u003eBuild tools such as make, autotools, bazel, etc.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWorking at ActiveState\u003c/strong\u003e\nActiveState has a collaborative, respectful, and professional culture. We’re all about working together to find the best solutions, and making sure that the experience of doing so is positive for everyone involved. There is a commitment from the CEO on down to making work at ActiveState a great experience for all of us.\u003c/p\u003e\n\u003cp\u003eOur company is a team of 50+ and growing, with 2/3rds of the positions in technical roles  including software development and QA. We maintain a set of core, overlapping hours, but we’re flexible with specific start and end times and are understanding about appointments and life events.\u003c/p\u003e\n\u003cp\u003eOur vision is to have an ActiveState solution on every device on every planet, so we certainly don’t lack for ambition! But even though we’re ambitious we don’t expect work to become your life. We know you will do your best work in a positive environment free from death marches. For more about working at ActiveState and our Glassdoor rating go to \u003ca href=\"http://www.activestate.com/careers\"\u003ewww.activestate.com/careers\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our careers page posting at the bottom of the job description here: \u003ca href=\"https://www.activestate.com/company/careers/?gh_jid=4334349002#grnhse_app\"\u003ehttps://www.activestate.com/company/careers/?gh_jid=4334349002#grnhse_app\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzJnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--14605ce1f9dc1e5a22bfa2ba9f5d25d3011a015e/activestate-logo-black-header.png"},{"id":"3893d6dd-b122-41eb-aca3-6ca4054f8d6b","type":"Full Time","url":"https://jobs.github.com/positions/3893d6dd-b122-41eb-aca3-6ca4054f8d6b","created_at":"Wed Apr 07 17:08:34 UTC 2021","company":"Fluidra North America","company_url":"https://www.fluidrausa.com/en","location":"Remote","title":"Staff Software Engineer, Cloud Platform ","description":"\u003cp\u003eIf you have significant experience in hands-on coding with high level languages, cloud-based technologies, RESTful APIs, micro services architecture, and want to join a global team that is passionate, hardworking, innovative, and FUN! You might be the Staff Engineer, Cloud Platform we’ve been looking for! This person will be the technical expert and team member that will design, develop and support IOT solutions in AWS for our backend cloud platform.\u003c/p\u003e\n\u003cp\u003eUS, Remote\u003c/p\u003e\n\u003cp\u003eWHY WORK FOR FLUIDRA?\u003c/p\u003e\n\u003cp\u003eWe are a leader in the global pool industry.  Our portfolio includes some of the most trusted brands; we offer our customers an expansive array of products across both the residential and commercial pool and wellness markets; and we have strong geographical footprint with operations in over 45 countries.  With our merger with Zodiac, we now have over 5,500 employees and the combined resources to accelerate innovation in critical areas like energy-efficiency, robotics and the Internet of Things.\u003c/p\u003e\n\u003cp\u003eWe are guided by clear values and come to work every day with a simple and direct mission in mind: To create the perfect pool and wellness experience. By staying focused on this mission, we will create value for all our stakeholders–customers, pool owners, investors and employees.\nWe own a portfolio of some of the industry’s most recognized and trusted brands, including Jandy®, AstralPool®, Polaris®, Cepex®, Zodiac®, CTX Professional® and Gre®.\nWHAT YOU WILL CONTRIBUTE\u003c/p\u003e\n\u003cp\u003eWe are looking for a Lead Cloud Engineer to join our IoT team. We are an innovative, passionate and fun-loving team working in a start-up spirit in areas which have direct impact on our company’s success. You will join our global team influencing our technology roadmap and making a difference in our customers life. Additionally, you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and development of IoT solutions in AWS primarily for backend cloud platform\u003c/li\u003e\n\u003cli\u003eImplementation of high-volume telemetry data ingestion and processing in relational/NoSQL or data warehouse in cloud environment\u003c/li\u003e\n\u003cli\u003eWork closely with architects and digital product managers to translate system architecture and requirements into performant software\u003c/li\u003e\n\u003cli\u003eTake ownership of IoT backend platform and mentor junior engineers to develop high quality components\u003c/li\u003e\n\u003cli\u003eCollaborate with data scientists to understand and implement data integration and analytics pipeline for IoT generated data\u003c/li\u003e\n\u003cli\u003eWork closely with a globally distributed team and coordinate work accordingly\u003c/li\u003e\n\u003cli\u003eDesign and develop API for internal and external consumption\u003c/li\u003e\n\u003cli\u003eCollaborate on DevOps practices including CI and CD\u003c/li\u003e\n\u003cli\u003eParticipate in Agile development, daily scrum and sprints\u003c/li\u003e\n\u003cli\u003eDevelop new features, unit testing and system tests automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWHAT WE SEEK\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e7+ years of experience in software development\u003c/li\u003e\n\u003cli\u003e3+ years hands-on AWS/Cloud development\u003c/li\u003e\n\u003cli\u003e1+ years in IoT preferably in manufacturing domain\u003c/li\u003e\n\u003cli\u003eExperience with/of horizontally scalable micro services architecture and low latency, consistent, simple to use RESTful APIs.\u003c/li\u003e\n\u003cli\u003eStrong experience in Cloud Computing with one or more Platform-as-a-Service, (PaaS), offerings with IoT capabilities (AWS IoT preferred or Google Cloud IoT)\u003c/li\u003e\n\u003cli\u003eExpertise in cloud based IoT technologies (MQTT, Notification engines, etc.)\u003c/li\u003e\n\u003cli\u003eExperience in cloud-based NoSQL stores (e.g., DynamoDB, MongoDB, HBase, Cassandra, etc.) and RDBMS.\u003c/li\u003e\n\u003cli\u003e5+ years Hands-on coding experience in NodeJS, Ruby, Perl or other high-level languages\u003c/li\u003e\n\u003cli\u003eHands-on experience of Kafka/Kinesis/Spark streaming platform to build API’s utilizing real-time data pipelines.\u003c/li\u003e\n\u003cli\u003eHands-on experience on NoSQL database management system and Query language (Cassandra/Dynamo).\u003c/li\u003e\n\u003cli\u003eHands-on experience on Relational Database Management Systems and SQL (Aurora, MySQL, RDS).\u003c/li\u003e\n\u003cli\u003eDebugging and monitoring experience of cloud application using Graphite/Grafana, ELK, Google Prometheus, Datadog.\u003c/li\u003e\n\u003cli\u003eExperience with Container technologies like Docker and orchestration using Kubernetes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEDUCATION\u003c/p\u003e\n\u003cp\u003eComputer/Electrical Engineering or Computer Science BS Degree. MS preferable.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply, please visit: \u003ca href=\"https://www.fluidrausa.com/en/careers\"\u003ehttps://www.fluidrausa.com/en/careers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1dnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b60d2fc635a1ef224abb7044676168b6393b6384/Fluidra_Blue.png"},{"id":"0b535239-89fb-48a3-a72a-631b24e48c53","type":"Full Time","url":"https://jobs.github.com/positions/0b535239-89fb-48a3-a72a-631b24e48c53","created_at":"Wed Apr 07 15:38:11 UTC 2021","company":"dirico","company_url":"https://dirico.io/","location":"Koblenz","title":"Fullstack Developer (m/f/d)","description":"\u003cp\u003eWe are 247GRAD Labs GmbH, the IT company behind dirico, the all-in-one platform for communication and marketing teams.\u003c/p\u003e\n\u003cp\u003edirico helps companies worldwide to plan, create and publish their content better than ever before. This makes our customers so happy that they are already using \u003ca href=\"http://dirico.io/\"\u003edirico.io\u003c/a\u003e in over 20 countries. Our customer base is constantly growing and includes some of the top 50 companies in Germany.\u003c/p\u003e\n\u003cp\u003eTherefore we are looking for you to support our team in Koblenz and Oradea (Romania).\u003c/p\u003e\n\u003cp\u003eFind out more about us and take a look behind the scenes: \u003ca href=\"https://dirico.io/en/about-us/\"\u003ehttps://dirico.io/en/about-us/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks at dirico\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNew and further development of our software solution with focus on C#, .NET and React\u003c/li\u003e\n\u003cli\u003eActive participation in the design of the infrastructure and processes used in the development team\u003c/li\u003e\n\u003cli\u003eApplication and testing of state-of-the-art practices and implementation of new ideas\u003c/li\u003e\n\u003cli\u003eEvaluation and selection of new technologies for use in development\u003c/li\u003e\n\u003cli\u003eCooperation in an internationally operating environment of development teams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we are looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProfound knowledge of .NET and C#\u003c/li\u003e\n\u003cli\u003eYou have deep knowledge in preferably ReactJS or framework comparable to React\u003c/li\u003e\n\u003cli\u003ePrevious experience in TypeScript and Storybook would be an advantage\u003c/li\u003e\n\u003cli\u003eGood knowledge of relational databases/SQL, design patterns and common frameworks (e.g. EF)\u003c/li\u003e\n\u003cli\u003eIdeally, you have experience with interfaces of social media platforms\u003c/li\u003e\n\u003cli\u003eExperience with the Azure platform supplements your profile\u003c/li\u003e\n\u003cli\u003eSafe handling of object-oriented code, UML and design patterns\u003c/li\u003e\n\u003cli\u003eScrum, Git and Clean Code are not foreign words, but old acquaintances\u003c/li\u003e\n\u003cli\u003eAn agile mindset, a well-structured working style and strong team and problem-solving skills characterize you\u003c/li\u003e\n\u003cli\u003eFluent verbal and written English skills are required, German language skills are a plus\u003c/li\u003e\n\u003cli\u003eYou are ready to develop further and face new challenges\u003c/li\u003e\n\u003cli\u003eYou are committed and interested in actively contributing your opinion to the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to expect from dirico\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAn innovative software product in an exciting marketing context\u003c/li\u003e\n\u003cli\u003eRenowned reference customers such as BMW, ThyssenKrupp, Lanxess, WetterOnline, R+V, Dr. Oetker, Sport2000 and many more\u003c/li\u003e\n\u003cli\u003eA strongly growing and motivated team with world class colleagues\u003c/li\u003e\n\u003cli\u003eVaried and challenging tasks\u003c/li\u003e\n\u003cli\u003eReal start-up atmosphere in a successful Mittelstand company\u003c/li\u003e\n\u003cli\u003eFlat hierarchies and fast decision-making channels for your creative ideas\u003c/li\u003e\n\u003cli\u003eAgile work processes and state-of-the-art hardware\u003c/li\u003e\n\u003cli\u003eAn annual training budget to support your professional and personal development\u003c/li\u003e\n\u003cli\u003eFlexible working hours based on trust\u003c/li\u003e\n\u003cli\u003eThe possibility of home office\u003c/li\u003e\n\u003cli\u003eErgonomic working environment with height-adjustable tables and back-friendly chairs\u003c/li\u003e\n\u003cli\u003eGrant for the premium fitness studio DANY\u003c/li\u003e\n\u003cli\u003eRegular team events\u003c/li\u003e\n\u003cli\u003eCompany pension scheme\u003c/li\u003e\n\u003cli\u003eFresh fruit and coffee variations\u003c/li\u003e\n\u003cli\u003eNo dress code – we want you to feel comfortable, so: come as you are\u003c/li\u003e\n\u003cli\u003eOur office dogs are professional feelgood managers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/ef7c13ffebbd6874e88a93e02ca25ca3cf2d1f71/68747470733a2f2f742e676f686972696e672e636f6d2f682f38623066643462363661326365623436303539653939663764636538636137333936663531666539353237636165626631383466376136663638323133343061\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/2c668cdf87cd31b8db14e337071f215b9894743e4b182225ea4f6ea05b096186\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0dnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de1c56e79b7c6d35a58de73a5a17e5c9a9775ed0/dirico.png"},{"id":"221ef411-e134-49b2-a789-b0bec9063540","type":"Full Time","url":"https://jobs.github.com/positions/221ef411-e134-49b2-a789-b0bec9063540","created_at":"Wed Apr 07 15:35:13 UTC 2021","company":"dirico","company_url":"https://dirico.io/","location":"Koblenz","title":"Frontend Developer (m/f/d)","description":"\u003cp\u003eWe are 247GRAD Labs GmbH, the IT company behind dirico, the all-in-one platform for communication and marketing teams.\u003c/p\u003e\n\u003cp\u003edirico helps companies worldwide to plan, create and publish their content better than ever before. This makes our customers so happy that they are already using \u003ca href=\"http://dirico.io/\"\u003edirico.io\u003c/a\u003e in over 20 countries. Our customer base is constantly growing and includes some of the top 50 companies in Germany.\u003c/p\u003e\n\u003cp\u003eTherefore we are looking for you to support our team in Koblenz and Oradea (Romania).\u003c/p\u003e\n\u003cp\u003eFind out more about us and take a look behind the scenes: \u003ca href=\"https://dirico.io/en/about-us/\"\u003ehttps://dirico.io/en/about-us/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks at dirico\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNew and further development of our software solution with the focus on React and TypeScript\u003c/li\u003e\n\u003cli\u003eCreation of system architecture and software design\u003c/li\u003e\n\u003cli\u003eActive co-design of the infrastructure and processes used in the development team\u003c/li\u003e\n\u003cli\u003eUse and test the latest practices and implement new ideas\u003c/li\u003e\n\u003cli\u003eEvaluation and selection of new technologies for use in development\u003c/li\u003e\n\u003cli\u003eCooperation in an internationally operating environment of development teams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we are looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have deep knowledge in preferably ReactJS or framework comparable to React\u003c/li\u003e\n\u003cli\u003ePrevious experience in TypeScript and Storybook would be an advantage\u003c/li\u003e\n\u003cli\u003eSecure handling of object-oriented code, UML and design patterns\u003c/li\u003e\n\u003cli\u003eScrum, Git and Clean Code are not foreign words, but old acquaintances\u003c/li\u003e\n\u003cli\u003eAn agile mindset, a well-structured working style and strong team and problem-solving skills characterize you\u003c/li\u003e\n\u003cli\u003eFluent verbal and written English skills are required, German language skills are a plus\u003c/li\u003e\n\u003cli\u003eYou are ready to develop further and face new challenges\u003c/li\u003e\n\u003cli\u003eYou are committed and interested in actively contributing your opinion to the team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to expect from dirico\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAn innovative software product in an exciting marketing context\u003c/li\u003e\n\u003cli\u003eRenowned reference customers such as BMW, ThyssenKrupp, Lanxess, WetterOnline, R+V, Dr. Oetker, Sport2000 and many more\u003c/li\u003e\n\u003cli\u003eA strongly growing and motivated team with world class colleagues\u003c/li\u003e\n\u003cli\u003eVaried and challenging tasks\u003c/li\u003e\n\u003cli\u003eReal start-up atmosphere in a successful Mittelstand company\u003c/li\u003e\n\u003cli\u003eFlat hierarchies and fast decision-making channels for your creative ideas\u003c/li\u003e\n\u003cli\u003eAgile work processes and state-of-the-art hardware\u003c/li\u003e\n\u003cli\u003eAn annual training budget to support your professional and personal development\u003c/li\u003e\n\u003cli\u003eFlexible working hours based on trust\u003c/li\u003e\n\u003cli\u003eThe possibility of home office\u003c/li\u003e\n\u003cli\u003eErgonomic working environment with height-adjustable tables and back-friendly chairs\u003c/li\u003e\n\u003cli\u003eGrant for the premium fitness studio DANY\u003c/li\u003e\n\u003cli\u003eRegular team events\u003c/li\u003e\n\u003cli\u003eCompany pension scheme\u003c/li\u003e\n\u003cli\u003eFresh fruit and coffee variations\u003c/li\u003e\n\u003cli\u003eNo dress code – we want you to feel comfortable, so: come as you are\u003c/li\u003e\n\u003cli\u003eOur office dogs are professional feelgood managers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/cd95fb736184d38b7ceb68481566936d5467dc7d/68747470733a2f2f742e676f686972696e672e636f6d2f682f36636365346361623133636465653538633836336464636665323363653539633538653831303031653833376264343266396663643633393634633265313035\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/1e691dd4919790bf79e335fe9b22e4c8d75b573b83eded38212a250699d5ea73\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBditmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--000fd5aa2d85568e9f0f238f24d7c49d2394450f/dirico.png"},{"id":"9a737891-2f64-4aa5-bfcf-691f0e175041","type":"Full Time","url":"https://jobs.github.com/positions/9a737891-2f64-4aa5-bfcf-691f0e175041","created_at":"Wed Apr 07 15:28:33 UTC 2021","company":"Dart Appraisal","company_url":"http://dartappraisal.com","location":"Troy, MI ","title":"Software Developer - In Office (Not Remote)","description":"\u003cp\u003eDart Appraisal is a leading nationwide appraisal management company and we are looking for an experienced Software Developer to work in our Troy MI office to maintain and update our proprietary software platform. The Software Developer will work with internal Dart Appraisal personnel and our Software Development Vendor. This is a fantastic opportunity to engage in a positive and creative work environment. At Dart Appraisal, we believe the key to our success as an Appraisal Management Company lies within each of our staff members.  We believe in our people and want them to grow with our firm as far as they can.\nResponsibilities and Duties:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop and implement new features of Dart Appraisal software platform\u003c/li\u003e\n\u003cli\u003eMaintain and improve the performance of existing software\u003c/li\u003e\n\u003cli\u003eIntegrate Dart Appraisal platform with 3rd party software and vendor platforms\u003c/li\u003e\n\u003cli\u003eClearly and regularly communicate with management regarding task status\u003c/li\u003e\n\u003cli\u003eTest and maintain software updates\u003c/li\u003e\n\u003cli\u003eDocument all work for future reference\u003c/li\u003e\n\u003cli\u003eRecommend and execute improvements\nQualifications and Skills:\u003c/li\u003e\n\u003cli\u003eProven experience as a Software Developer\u003c/li\u003e\n\u003cli\u003eProficiency with ASP Classic and .NET languages\u003c/li\u003e\n\u003cli\u003eExperience with MS SQL Server and database management\u003c/li\u003e\n\u003cli\u003eMISMO XML experience a plus\u003c/li\u003e\n\u003cli\u003eExperience with mobile platform development (Apple and Android)\u003c/li\u003e\n\u003cli\u003eBachelor’s degree or minor in Computer Science or a combination of successful coursework and employment experience\nWhat Makes Dart Appraisal a great place to work?\u003c/li\u003e\n\u003cli\u003eBenefits include medical, dental, vision, disability, life insurance and 401k.\u003c/li\u003e\n\u003cli\u003eGenerous paid time off package starting in your first year of employment.\u003c/li\u003e\n\u003cli\u003eManagement team that encourages suggestions and feedback.\u003c/li\u003e\n\u003cli\u003eInnovative, team-oriented environment that doesn’t skimp out on fun!\nJob Type: Full-time\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:tmoser@dartappraisal.com\"\u003etmoser@dartappraisal.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjJmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5feb6adb6ef84096e82b6f58570ec0947ac3518c/dart.png"},{"id":"c03b4c36-f126-485f-91c1-7c668087e4ba","type":"Full Time","url":"https://jobs.github.com/positions/c03b4c36-f126-485f-91c1-7c668087e4ba","created_at":"Wed Apr 07 14:49:52 UTC 2021","company":"Temerty Faculty of Medicine - University of Toronto","company_url":"https://jobs.utoronto.ca/job/Developer/545651417/","location":"Toronto","title":"Developer","description":"\u003cp\u003eAbout us:\u003c/p\u003e\n\u003cp\u003eHome to over 40 departments and institutes, the University of Toronto's Temerty Faculty of Medicine lies at the heart of the Toronto Academic Health Science Network and is a global leader in ground-breaking research and education, spanning clinical medicine, basic science and the rehabilitation sciences sectors.\u003c/p\u003e\n\u003cp\u003eYour opportunity:\u003c/p\u003e\n\u003cp\u003eDiscovery Commons provides information technology support for the Faculty of Medicine.Our mission is to partner and collaborate with clients, University, and third parties to determine value based, sustainable technology solutions that enable the Faculty to achieve its academic mission.\u003c/p\u003e\n\u003cp\u003eAs Developer, you will design, develop, maintain and support web-based applications for staff, faculty and learners. Working in close collaboration with our Lead Developer and the Service Delivery Team, you will gather business requirements, design and diagram systems, conduct programming and testing, deployment and system refactoring, and actively participate in Scrum processes to move our projects forward. Relying on your initiative and strong desire to stay on top of emerging trends and technologies, you will recommend, test, prototype and develop new methods and tools to help us drive continuous improvement and innovation for the faculty.\u003c/p\u003e\n\u003cp\u003eYour responsibilities will include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWriting complex technical code and designing, testing and modifying programming code\u003c/li\u003e\n\u003cli\u003eAnalyzing user needs and business processes to create programming solutions\u003c/li\u003e\n\u003cli\u003eEvaluating programming code to ensure it has validity, compatibility, and that it meets appropriate standards\u003c/li\u003e\n\u003cli\u003eDeveloping technical application implementation plans\u003c/li\u003e\n\u003cli\u003ePlanning and implementing components of web projects\u003c/li\u003e\n\u003cli\u003eConducting usability testing for web applications and troubleshooting and resolving technical issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEssential Qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's Degree in Computer Science, Engineering or acceptable combination of equivalent experience\u003c/li\u003e\n\u003cli\u003eMinimum four years experience in website development and design including requirements analysis, system modeling, and database diagramming\u003c/li\u003e\n\u003cli\u003eExperience developing remote services such as web services using RESTful API’s (JSON, XML) and messaging queues\u003c/li\u003e\n\u003cli\u003eExperience with front end development frameworks (Bootstrap, Vue.js, ember) that support responsive design for multiple platforms (desktop, tablet, smartphone)\u003c/li\u003e\n\u003cli\u003eDemonstrated experience with continuous integration principles and automated testing tools (MAVEN, JENKINS, POSTMAN, COMPOSER, TestNG, JUnit, PHPUnit, Codeception)\u003c/li\u003e\n\u003cli\u003eDemonstrated experience working in an Agile software development environment\u003c/li\u003e\n\u003cli\u003eDemonstrated experience with direct contact with clients, including training end users, and experience in open source development\u003c/li\u003e\n\u003cli\u003eMust be fluent in Enterprise Java (JEE), using JEE technologies such as servlets/JSP and Frameworks such as Spring, Struts or JSF, JDBC or JPA or HIBERNATE (or any other O/R mapper such as OpenJPA, TopLink, etc.)\u003c/li\u003e\n\u003cli\u003eMust be fluent in PHP and experience in using frameworks such as Zend, and Laravel\u003c/li\u003e\n\u003cli\u003eProficiency in JavaScript, AJAX, DHTML, XHTML, XML, CSS, and JQuery; Strong knowledge of MVC and object-oriented programming\u003c/li\u003e\n\u003cli\u003eProficiency in IIS, APACHE/TOMCAT, MSSQL, and MySQL; Familiarity with TCP/IP and related Internet protocols\u003c/li\u003e\n\u003cli\u003eExcellent interpersonal and communication (oral and written) skills\u003c/li\u003e\n\u003cli\u003eMust have superior organizational and analytical/diagnostic skills\u003c/li\u003e\n\u003cli\u003eMust be self-motivated, results oriented, a quick learner with a strong customer service focus and impeccable attention to detail\u003c/li\u003e\n\u003cli\u003eWorks well under pressure in a fast paced environment, meets strict deadlines and has sound judgment\u003c/li\u003e\n\u003cli\u003eWorks effectively both independently and as part of a team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAssets (Nonessential):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTechnical certification in Java\u003c/li\u003e\n\u003cli\u003eFamiliarity with University of Toronto ITS systems: Shibboleth, GROUPER, LDAP\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our Careers website:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.utoronto.ca/job/Developer/545651417/\"\u003ehttps://jobs.utoronto.ca/job/Developer/545651417/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdm1mIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--937ec6bff27ae7a5c2f8f337b978d966281a93ab/MED_Temerty%20Faculty%20of%20Medicine_Colour%20Signature_Print.jpg"},{"id":"783a4a66-e09d-4bee-b7ec-200291893c4f","type":"Full Time","url":"https://jobs.github.com/positions/783a4a66-e09d-4bee-b7ec-200291893c4f","created_at":"Wed Apr 07 12:35:36 UTC 2021","company":"BusPatrol","company_url":"https://www.buspatrol.com/careers/","location":"Remote","title":"Ruby Developer","description":"\u003cp\u003eWho We Are:\u003c/p\u003e\n\u003cp\u003eOur mission is to create a culture of responsibility and awareness on the road. We are devoted to making the journey to and from school safer.  We develop partnerships, deploy Safety Tech and manage the entire program.  We have equipped thousands of buses across North America with our innovative technology and we continue to educate tens of thousands of drivers a month on safety.  BusPatrol America cares about student safety. We educate motorists every day by helping to enforce the law and work with school officials to improve safety. \u003c/p\u003e\n\u003cp\u003eThe Opportunity:\u003c/p\u003e\n\u003cp\u003eReporting to the Sr. Software Development Lead, the successful candidates will be instrumental in executing and delivering well tested code. This position will require you to work in close concert, as part of a larger geographically distant team where you will be required to share your insights to drive a better process.\u003c/p\u003e\n\u003cp\u003eWhat we need you to do:\u003c/p\u003e\n\u003cp\u003eDesign, build, and maintain efficient, reusable, and tested code\nContribute in all phases of the development lifecycle\nBe a productive member of an inclusive team where pairing and peer reviewed code are valued\nFollow best practices (continuous integration, SCRUM, refactoring, and code standards)\nDrive continuous adoption and integration of relevant new technologies into design\nEngineer documented, scalable, and secure APIs from deprecated legacy code\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003eWhat you bring:\u003c/p\u003e\n\u003cp\u003e3+ years Ruby development experience\n3+ years of experience with Ruby web frameworks(ex: Rails or Rack)\nProven work experience in a software development team\nDemonstrable knowledge of front-end technologies such as JavaScript, HTML5, CSS3\nPassion for writing great, simple, clean, efficient code\nWorkable knowledge of relational databases(ex: MySQL, Postgres)\nBS/MS degree in Computer Science or equivalent experience\nKnowledge of version control, such as Git\u003c/p\u003e\n\u003cp\u003eSome Preferred Experience:\u003c/p\u003e\n\u003cp\u003eVue.js and Jest testing framework\nSASS experience\nIoT Technologies\nFamiliarity with Docker\nUse of code quality tools (ex: RuboCop)\u003c/p\u003e\n\u003cp\u003eWhat we offer:\u003c/p\u003e\n\u003cp\u003eAn opportunity to help build a company dedicated to children’s safety\nThe chance to join an innovative and dedicated team, focused on leading edge technology\nCompetitive salary and benefits package\u003c/p\u003e\n\u003cp\u003eWe’re looking for critical members of the BusPatrol team to assist us in our quest to improve children’s safety.  This is an important role for us and a great opportunity for the right candidates.  Our environment is inclusive, diverse, ignited, built on integrity and deeply committed.  Come and help us keep our children safe.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eQualified candidates, please submit your applications via the link below:\n\u003ca href=\"https://grnh.se/963dec9c3us\"\u003ehttps://grnh.se/963dec9c3us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmFmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8d3e1ee855654152d4cf277ab4456779b93f178e/Logo_BP-RGB.png"}]